{"id":13549,"alternative_names":[{"id":5548,"name":"エネミー・ゼロ"}],"cover":{"id":114167,"alpha_channel":false,"animated":false,"game":13549,"height":1060,"image_id":"co2g3b","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2g3b.jpg","width":795,"checksum":"d268f1bc-ac31-0880-6bd4-42fcd5bdb8bd"},"first_release_date":850435200,"genres":[{"id":5,"name":"Shooter"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":27106,"company":{"id":7053,"name":"WARP"},"created_at":1444780800,"developer":true,"game":13549,"porting":false,"publisher":true,"supporting":false,"updated_at":1444780800,"checksum":"a8071f9e-95e4-f7a3-fcb5-9625be4cdcf8"},{"id":27107,"company":{"id":112,"name":"Sega"},"created_at":1444780800,"developer":false,"game":13549,"porting":false,"publisher":true,"supporting":false,"updated_at":1444780800,"checksum":"f58c4dcd-d1c3-bfcf-c028-b325f67d298c"}],"name":"Enemy Zero","screenshots":[{"id":15306,"game":13549,"height":720,"image_id":"omygrmvh2iuptcnlizad","url":"//images.igdb.com/igdb/image/upload/t_thumb/omygrmvh2iuptcnlizad.jpg","width":960,"checksum":"662478ab-0aa8-7ccb-971c-e889c99a4077"},{"id":15307,"game":13549,"height":360,"image_id":"uxamnfps0k8xkys3ljco","url":"//images.igdb.com/igdb/image/upload/t_thumb/uxamnfps0k8xkys3ljco.jpg","width":480,"checksum":"d9572212-b0a6-3c2b-70b7-fe4540cce1d0"},{"id":15308,"game":13549,"height":171,"image_id":"nvlfikqraen09qt2wnzx","url":"//images.igdb.com/igdb/image/upload/t_thumb/nvlfikqraen09qt2wnzx.jpg","width":295,"checksum":"8671c566-4b41-0825-1e97-ca64259cdbcd"},{"id":15309,"game":13549,"height":480,"image_id":"pe4jf2bni94a5zv4ga22","url":"//images.igdb.com/igdb/image/upload/t_thumb/pe4jf2bni94a5zv4ga22.jpg","width":640,"checksum":"dbd48224-c6ca-f55e-c23d-c994ec8516f9"},{"id":15310,"game":13549,"height":163,"image_id":"wuqfgygaig2olld1ybb3","url":"//images.igdb.com/igdb/image/upload/t_thumb/wuqfgygaig2olld1ybb3.jpg","width":310,"checksum":"4c0dd4f4-a18d-a0f1-5b58-5916f76587cd"}],"slug":"enemy-zero","storyline":"Aboard the AKI space craft, a space station dedicated to biological research, Laura Lewis is in a deep cryogenic slumber. The jets of the chamber dissipate as the craft's emergency systems are activated. Laura is awakened by a large detonation on her deck. Outside a door marked with the letters E0, something of great strength is trying to break free. The door is thrown down, and the hallway is filled with a bright, incandescent light, followed by a horrific growl. Pipes and the remains of the steel door shift around, as if being stepped on. Laura, unaware of what is happening, uses the video phone located above her sleep chamber to contact one of her crewmates, Parker. Laura watches in confusion as Parker looks away from the monitor, to his room's entryway doors. A screech sends him backing up to reach for his gun. Laura watches as Parker is mutilated by an unseen enemy. \n \nGetting dressed and grabbing her gun, Laura heads out to learn what attacked Parker. As she ventures through the ship, Laura's earring-shaped \"guidance system\" gives her aural warnings of invisible enemies (seen escaping in the intro sequence) roaming the ship's corridors. Laura must fight these enemies, meet up with surviving crew members, and escape the AKI.","summary":"Enemy Zero was the second game to star the digital character Laura Lewis—the first being D. \n \nIn E0, gameplay sequences alternate between interactive FMV and real time exploration, both from a first person perspective. The interactive FMV component uses gameplay identical to an earlier Warp game, D. \n \nThe real time component of E0 is unique. Enemies are invisible, and location is only possible through the use of sound, with notes of different pitch helping the player find the distance and direction of enemies. Additionally, every gun in the game must be charged up immediately before each shot, and charging a shot for too long will cause the charge to dissipate, after which the charging must start over. Since all available guns have very limited range, this makes timing crucial; beginning to charge the gun too late or too soon will allow the enemy to reach Laura, resulting in an immediate game over. \n \nIn Enemy Zero, reloading the gun and moving the character around are mechanics that have been made intentionally slow,[4] which stimulates players to avoid combat and direct contact with the alien enemies as much as possible. In the early segments of the game, avoiding detection is not only recommended; it is required, since the player has no means to defend him or herself without a gun. Enemy Zero is an example of a game containing stealth elements[5] roughly two years before the release of Metal Gear Solid popularized the genre worldwide, though ten years after Metal Gear started the genre in 1987.","url":"https://www.igdb.com/games/enemy-zero","videos":[{"id":5881,"game":13549,"name":"Trailer","video_id":"45k0YrFXCeY","checksum":"2100533e-c483-150d-29c7-c771e6ac8684"},{"id":5882,"game":13549,"name":"Gameplay video","video_id":"1_ZSDTGDm1E","checksum":"9f1d59a3-f26d-352f-0858-971ec051932b"}]}