{"id":181670,"cover":{"id":197864,"alpha_channel":false,"animated":false,"game":181670,"height":906,"image_id":"co48o8","url":"//images.igdb.com/igdb/image/upload/t_thumb/co48o8.jpg","width":649,"checksum":"b658c30b-3149-18aa-4ea0-f6d71910fbf2"},"first_release_date":757296000,"involved_companies":[{"id":156459,"company":{"id":3694,"name":"NuFX"},"created_at":1637005250,"developer":true,"game":181670,"porting":false,"publisher":false,"supporting":false,"updated_at":1637009441,"checksum":"db28f586-2436-6e4e-585e-55b92aa2c391"},{"id":156460,"company":{"id":35643,"name":"SEGA of America, Inc."},"created_at":1637005250,"developer":false,"game":181670,"porting":false,"publisher":true,"supporting":false,"updated_at":1637009441,"checksum":"29ccd280-14f0-5858-7816-bdc768e213b9"}],"name":"Surf Ninjas","slug":"surf-ninjas--1","summary":"Surf Ninjas was created as a tie-on for the 1993 New Line Cinema movie of the same name and is loosely based on its content. The entire introduction of how the surfers discover they are the sons of a Patusani king is not mentioned and instead the player is thrown in the story as a ninja trainee right away. Colonel Chi wants to overthrow the kingdom and kill the last heirs, so he sends troops of ninjas to kill the two brothers.\n\nPlayers control one of the brothers as he travels through different locations such as the Palace restaurant, the docks at Venice (California), the island of Patu San and more. The 2D side-scrolling platforms missions contains platforms, enemies and ninjas and various hazards. One button is used to jump while the other, in combination with the D-pad, launches punches, kicks, throws and various combos. Attacks can also be performed from the air or using very high jumps.\n\nDuring gameplay an options screen can be accessed to review the statistics (health, strength, reflex and fight), get a hint through Adam's Game Gear, call the ninja Zatch to launch a powerful attack or select a weapon such as shurikens, fireballs, a knife and a sword. By defeating enemies coins are collected to be spent on bonus time on the clock, Zatch power-ups, a bonus life, complete regeneration, a hint, a weapon or a continue.","url":"https://www.igdb.com/games/surf-ninjas--1","videos":[{"id":59535,"game":181670,"name":"Gameplay Video","video_id":"boetFpIouTU","checksum":"5f28eb6b-e033-1a47-fbe5-25e063302db2"}]}