{"id":98269,"alternative_names":[{"id":54766,"name":"A-Train - Trains, Power, Money"}],"cover":{"id":129778,"alpha_channel":false,"animated":false,"game":98269,"height":988,"image_id":"co2s4y","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2s4y.jpg","width":1000,"checksum":"2ed1da77-78e0-6eba-e8d9-132d11a65973"},"first_release_date":820454400,"genres":[{"id":13,"name":"Simulator"}],"involved_companies":[{"id":118518,"company":{"id":1221,"name":"Artdink"},"created_at":1612483200,"developer":true,"game":98269,"porting":false,"publisher":false,"supporting":false,"updated_at":1612483200,"checksum":"31975f7d-4275-eb18-0c02-b74a7a0befb9"},{"id":118519,"company":{"id":22170,"name":"Maxis Software"},"created_at":1612483200,"developer":false,"game":98269,"porting":false,"publisher":true,"supporting":false,"updated_at":1612483200,"checksum":"1f28129c-3373-d030-46f7-09b86420ee01"}],"name":"A-Train: Trains, Power, Money","slug":"a-train-trains-power-money","summary":"Although trains are your primary source of income in the beginning of the game, A-Train is not about building trains exclusively. By utilizing the train industry as well as buses and subways, it is up to you to manage an efficient transportation system for passengers and freighting companies. Everything you do must be well thought out because you're out to make a profit. \n \nAs soon as you've earned the adequate funds, you have to start making investments. With your money you can buy and sell all types of land and businesses. If you think you're lucky enough, you may opt to play the stock market. Purchased land can be developed in a variety of ways, such as in the development of offices, apartments, hotels, factories, golf courses, and so on. It is up to you to build the largest financial empire humanly possible. \n \nAs the city develops, new businesses will spring up, such as stadiums, high rise office blocks, and ski resorts. You can also build your own businesses, the success of which will depend on the local population, the presence of competing businesses, and even the changes of the seasons, among other factors.","url":"https://www.igdb.com/games/a-train-trains-power-money"}