{"id":45097,"alternative_names":[{"id":51525,"name":"Army Men: Land, Sea, Air"}],"collection":{"id":529,"created_at":1374609947,"games":[2702,3417,3440,3441,5732,6307,6308,8498,22830,22833,26819,27454,43466,43554,43947,43948,43949,44994,45097,47694,47721,49314,49954,50582,72487,73898],"name":"Army Men","slug":"army-men","updated_at":1666966068,"url":"https://www.igdb.com/collections/army-men","checksum":"19aea6b7-5816-963a-b075-aa1cd6732d4d"},"cover":{"id":28355,"game":45097,"height":1409,"image_id":"aqzqfsenvyi0tqxpuwla","url":"//images.igdb.com/igdb/image/upload/t_thumb/aqzqfsenvyi0tqxpuwla.jpg","width":1417,"checksum":"975ec84a-cb09-2509-f5d2-c5817a53b743"},"first_release_date":972000000,"involved_companies":[{"id":111429,"company":{"id":99,"name":"The 3DO Company"},"created_at":1603584000,"developer":true,"game":45097,"porting":false,"publisher":true,"supporting":false,"updated_at":1603670400,"checksum":"e5702528-87e9-8c0e-a127-d9fca7fb282a"}],"name":"Army Men: World War - Land Sea Air","slug":"army-men-world-war-land-sea-air","storyline":"You saved the Green Nation from the Tan menace in Army Men: World War. Your commanders awarded you promotions and ribbons, and your face became known throughout the land. Overnight, you became a hero. \n \nBut the Tan have risen again. Their war machine has produced cast numbers of men and craft, and the Green Army is calling for recruits to blunt the efforts of the enemy. Once again, you are asked to serve your country, to push back and enemy intent on ruining the Green nation. \n \nThe Tan are now more determined than ever, seething from their earlier losses. The dangers you faced before were awful, but now you'll need to summon even more courage to beat back the angry Tan. Grabbing your rifle. you head back into familiar territory, the war front, waiting for the Tan storm that's approaching just over the horizon.","summary":"The war continues between the green and tan armies, with air, sea and land vehicles increasing the range of attacks. \n \nNew additions to your army include the ability to control both army men, land vehicles, ships, and aircraft (for example Helicopters, bombers, battleships, and tanks). The Army Men themselves have a larger arsenal to choose from, including the howitzer and mortars plus the usual machine guns, flamethrowers, and grenades. \n \nAs a PlayStation exclusive, a 2-player capture the flag game has been included. The single player campaigns all included multiple objectives, such as capturing an enemy base while destroying others or defending an area from intruders.","url":"https://www.igdb.com/games/army-men-world-war-land-sea-air","videos":[{"id":42173,"game":45097,"name":"Game Intro","video_id":"SKPjFexYdzw","checksum":"95921b54-3623-df97-03d1-eb205e787508"}]}