{"id":57848,"cover":{"id":35163,"game":57848,"height":640,"image_id":"i3uk8qayflc4om9oqixn","url":"//images.igdb.com/igdb/image/upload/t_thumb/i3uk8qayflc4om9oqixn.jpg","width":640,"checksum":"14beb7af-d63f-c852-b8d0-9c659e2c3293"},"first_release_date":1058918400,"genres":[{"id":10,"name":"Racing"}],"involved_companies":[{"id":118237,"company":{"id":1954,"name":"Deibus Studios"},"created_at":1612224000,"developer":true,"game":57848,"porting":false,"publisher":false,"supporting":false,"updated_at":1612224000,"checksum":"a6d41203-4768-1808-4823-bdf62bfdc6f8"},{"id":118238,"company":{"id":1936,"name":"Gotham Games"},"created_at":1612224000,"developer":false,"game":57848,"porting":false,"publisher":true,"supporting":false,"updated_at":1612224000,"checksum":"eb2132f4-c018-781e-b153-08bf5a7bac53"}],"name":"ATV Mania","slug":"atv-mania","summary":"ATV Mania is an all-terrain vehicle combat racing game. Modes include Championship, Single Race, and Time Attack. The main mode is the Championship mode which lets the player compete in an underground ATV championship circuit which is being held amongst the French Alps. The player's goal is to win the races by any means necessary. The player gets to choose to play as one of six different racers, with each racer having their own ATV to race with. Each vehicle has its own unique ratings in speed, grip, and armor. The player then races against 5 of the other racers on 6 different tracks. The higher the position the player gets in a race, the more points and cash they earn. The player with the most points after all 6 races are done wins the championship. Also, after each race, the racer is asked questions by another character, where they get to choose their answer from a list of responses. For example, an investigative news reporter trying to get a scoop on the illegal races, gives the player an interview, which can earn the player some extra cash depending on how cooperative they are. Any cash earned can then be spent on more weapon ammo for the player's vehicle. Examples of weapons included in the game are grenades, land mines and homing missiles.","url":"https://www.igdb.com/games/atv-mania"}