{"id":7894,"alternative_names":[{"id":35440,"name":"Kain the Vampire"},{"id":68828,"name":"Legacy of Kain: Blood Omen"},{"id":68829,"name":"Blood Omen"}],"collection":{"id":632,"created_at":1390144908,"games":[3823,4122,5627,5901,7893,7894,8289,50762,141216],"name":"Legacy of Kain","slug":"legacy-of-kain","updated_at":1668092864,"url":"https://www.igdb.com/collections/legacy-of-kain","checksum":"2f4e0263-038b-0e66-9a7a-485cd4310105"},"cover":{"id":241639,"alpha_channel":false,"animated":false,"game":7894,"height":1270,"image_id":"co56g7","url":"//images.igdb.com/igdb/image/upload/t_thumb/co56g7.jpg","width":953,"checksum":"9c289e65-50a4-33aa-480b-c41c9f29e408"},"first_release_date":846806400,"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":18459,"company":{"id":66,"name":"Activision"},"created_at":1414368000,"developer":false,"game":7894,"porting":false,"publisher":true,"supporting":false,"updated_at":1414368000,"checksum":"1aa8147a-6e27-3d78-7388-b4591c1bcc64"},{"id":100303,"company":{"id":1951,"name":"Silicon Knights"},"created_at":1590710400,"developer":true,"game":7894,"porting":false,"publisher":false,"supporting":false,"updated_at":1590710400,"checksum":"bfb3939c-e38e-63e9-f763-2b95ab053ca1"},{"id":100304,"company":{"id":552,"name":"Crystal Dynamics"},"created_at":1590710400,"developer":false,"game":7894,"porting":false,"publisher":true,"supporting":false,"updated_at":1590710400,"checksum":"4d7d1ced-3fa5-55cd-c9f2-595480c4c83e"},{"id":100305,"company":{"id":10198,"name":"Semi Logic Entertainments"},"created_at":1590710400,"developer":false,"game":7894,"porting":true,"publisher":false,"supporting":false,"updated_at":1590710400,"checksum":"f7f8c055-cb13-bcec-d1cb-589b9c9abe15"},{"id":100306,"company":{"id":45,"name":"Sony Computer Entertainment, Inc. (SCEI)"},"created_at":1590710400,"developer":false,"game":7894,"porting":false,"publisher":true,"supporting":false,"updated_at":1590710400,"checksum":"b6aef7c2-1ee1-b870-6fe7-0d0895bd5253"}],"name":"Blood Omen: Legacy of Kain","screenshots":[{"id":386333,"alpha_channel":false,"animated":false,"game":7894,"height":480,"image_id":"sc8a3h","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8a3h.jpg","width":640,"checksum":"9b46bab0-1378-cf61-4d9c-94f597f4e3a0"},{"id":386334,"alpha_channel":false,"animated":false,"game":7894,"height":900,"image_id":"sc8a3i","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8a3i.jpg","width":1600,"checksum":"7cf569c7-394d-d8ae-6d02-25bd49848d67"},{"id":386335,"alpha_channel":false,"animated":false,"game":7894,"height":360,"image_id":"sc8a3j","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8a3j.jpg","width":480,"checksum":"bc973d4a-9e80-cf51-59e2-4ccdd764a8a7"},{"id":386336,"alpha_channel":false,"animated":false,"game":7894,"height":480,"image_id":"sc8a3k","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8a3k.jpg","width":640,"checksum":"54089964-0d80-8772-6b4d-ba7ef6ed21e5"},{"id":386337,"alpha_channel":false,"animated":false,"game":7894,"height":450,"image_id":"sc8a3l","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8a3l.jpg","width":600,"checksum":"99de8e2d-6599-d376-7ea8-3dd0970e29a4"}],"slug":"blood-omen-legacy-of-kain","storyline":"During a journey, the human nobleman Kain is ambushed and killed by a band of assassins. Mortanius offers him the chance to exact revenge — Kain assents, heedless of the cost, and awakes as a vampire. Once he kills his attackers, Mortanius tells him that, while they were the instruments of his death, they were not the ultimate cause. In search of the truth, and a cure to his vampiric curse, Kain travels to the Pillars of Nosgoth. There, Ariel explains that he has to destroy the Circle of Nine before he can realize peace. Kain begins by tracking down and killing Nupraptor, and then confronts Malek, but their duel ends in a stalemate. To defeat Malek, Kain solicits the advice of the Oracle of Nosgoth. The Oracle forewarns him of the Legions of the Nemesis, and instructs him to seek out Vorador, Malek's old adversary. When the two meet, Vorador welcomes Kain, and offers his assistance, but urges the fledgling to embrace vampirism and refrain from interfering in the affairs of mankind.\n\nHaunted by the elder vampire, who serves as an example of what he will become if he fails to find a cure, Kain persists, and, in a decisive showdown, Vorador vanquishes Malek while Kain kills Bane the Druid and DeJoule the Energist. Later, after he slays Azimuth the Planer and recovers a time-streaming device, Ariel informs Kain that he must instead prioritize the war against The Nemesis, whose armies threaten to conquer Willendorf. Kain convinces King Ottmar to rally his troops against the Legions in a final stand, but the battle proves disastrous. Ottmar perishes, the Willendorf forces are overwhelmed, and Kain, cornered, uses the time-streaming device to escape. He emerges 50 years in the past, and kills the younger version of The Nemesis from this era—the beloved King William the Just—to trigger a temporal paradox which expunges the Legions from the timestream. However, when Kain returns to the present day, he discovers that William's murder has sparked a renewed vampire purge.\n\nThe Oracle of Nosgoth — revealed to be Moebius the Time Streamer, a member of the Circle — leads the genocidal crusade, and, having masterminded Kain's actions from the outset, consummates his trap by executing Vorador. Kain kills Moebius, but is left the last of his kind. At the Pillars, he witnesses Mortanius arguing with Anarcrothe the Alchemist, who reveals that Mortanius is a guardian, and culpable for both Ariel and Kain's deaths. Seduced by The Dark Entity, Mortanius was unwillingly controlled and forced to kill Ariel. To correct the imbalance, he created Kain, a creature potent enough to destroy the Circle. Mortanius slays Anarcrothe, and then succumbs to possession from The Dark Entity (the latter one being responsible behind everything that happened in Nosgoth) whom Kain defeats. With only one Pillar left unrestored, Kain reaches an epiphany: he himself is the final insane Circle member, Ariel's unwitting successor as guardian of balance, culled in the brief interval between her death and the Pillars' corruption. The \"cure\" to vampirism which he sought is his own death.\n\nPlayers can choose whether to heal the world — an ending in which Kain sacrifices his life, ensuring the extinction of the vampires and restoration of Nosgoth — or damn the world, in which case the Pillars collapse, leaving Nosgoth an irredeemable wasteland, with Kain fully embracing his curse and living on as the most powerful entity in the land. The latter choice is considered the canon ending leading to the rest of the series.","summary":"Blood Omen: Legacy of Kain is a top-down action-adventure video game with role-playing game elements. It is the first game in the Legacy of Kain series, and the only one developed by Silicon Knights and published by Crystal Dynamics. The game was first released in 1996 for the PlayStation, and later ported to Microsoft Windows. A Sega Saturn version was announced during production but later cancelled before release. It was followed by four sequels, which were all developed by Crystal Dynamics and published by Eidos Interactive.","total_rating":80.7304970110138,"total_rating_count":39,"url":"https://www.igdb.com/games/blood-omen-legacy-of-kain","videos":[{"id":74354,"game":7894,"name":"Game Intro","video_id":"a_uLGt6lc1A","checksum":"f3c6ed87-65a3-76e1-f83f-7a0a1f7d3bb7"}]}