{"id":8280,"cover":{"id":98216,"alpha_channel":false,"animated":false,"game":8280,"height":800,"image_id":"co23s8","url":"//images.igdb.com/igdb/image/upload/t_thumb/co23s8.jpg","width":600,"checksum":"96bf9b54-2136-2bc4-95e4-0c87217fe06c"},"first_release_date":878256000,"genres":[{"id":13,"name":"Simulator"}],"involved_companies":[{"id":20218,"company":{"id":764,"name":"Psygnosis"},"created_at":1418169600,"developer":true,"game":8280,"porting":false,"publisher":true,"supporting":false,"updated_at":1418169600,"checksum":"73a9520f-a78f-ed4d-35d4-df07245552e9"},{"id":20219,"company":{"id":1221,"name":"Artdink"},"created_at":1418169600,"developer":false,"game":8280,"porting":false,"publisher":true,"supporting":false,"updated_at":1418169600,"checksum":"20614e82-1009-e1e8-31ee-18fe8f1ce54c"}],"name":"Colony Wars","screenshots":[{"id":41018,"game":8280,"height":600,"image_id":"o5y8lzlx7cals1hruiqi","url":"//images.igdb.com/igdb/image/upload/t_thumb/o5y8lzlx7cals1hruiqi.jpg","width":800,"checksum":"c7126d64-ec1d-0e7b-1e21-085817f9a97d"},{"id":41019,"game":8280,"height":768,"image_id":"b1italua1vs7lnn1yppj","url":"//images.igdb.com/igdb/image/upload/t_thumb/b1italua1vs7lnn1yppj.jpg","width":1024,"checksum":"34b876c9-656e-67d1-b7ca-95b5ac5b9177"},{"id":41020,"game":8280,"height":480,"image_id":"k5j1tthcimvub1avdgk7","url":"//images.igdb.com/igdb/image/upload/t_thumb/k5j1tthcimvub1avdgk7.jpg","width":640,"checksum":"837c1f21-8dbd-253b-fccd-5c3577876e09"},{"id":41021,"game":8280,"height":930,"image_id":"mioh9lesi21dp9bstbbq","url":"//images.igdb.com/igdb/image/upload/t_thumb/mioh9lesi21dp9bstbbq.jpg","width":1278,"checksum":"fd4245db-2a23-193c-ea81-019fbdb6f843"},{"id":41022,"game":8280,"height":450,"image_id":"buaepexjsbdvn62w9bc2","url":"//images.igdb.com/igdb/image/upload/t_thumb/buaepexjsbdvn62w9bc2.jpg","width":600,"checksum":"4e0ce8c9-d61b-bd8c-2402-90b945fa726c"}],"slug":"colony-wars","storyline":"The Earth is fully stripped of natural resources by the fifth millennium. As a result, the Earth Empire sends out expeditionary sleeper ships to distant planets found to have abundant natural resources and harvest them. The discovery of hyperspace technology accelerates the Empire's interstellar expansion. As the colonies become more prosperous, the inhabitants bceome discontent as most of their mined resources are used to benefit Earth. A peaceful insurrection in the 47th century only results in the Earth Empire's leader, the Tzar, personally leading the destruction of a rebellious planet. Stunned by the carnage, the other colonies band together as the League of Free Worlds, with a man known as the Father leading the fight. \n \nThe Empire's Colonial Navy sends a fleet to attack League forces in the Gallonigher system, but the League executes hit-and-run strikes as they fall back to the main capital planet, Bennay. When the Navy overextends its forces for the assault on Bennay, the League lures them into a trap inside a nearby asteroid belt, where the Navy strike fleet is destroyed. \n \nThe game picks up several months after what is now known as the Battle of Bennay, when the player character signs up for combat duty with the League as it fully mobilizes for war. If the player succeeds in Gallonigher, the League will proceed to the Draco system. If the player is defeated in Gallonigher, the League will survive, but will retreat to resupply bases in the Diomedes system before launching an attack on Alpha Centauri. It is also possible to be sent to Alpha Centauri by performing poorly during the Draco campaign.","summary":"Colony Wars is a combat fighter game set in space. You, as the player, join as a recruit in the League's fleet. Missions take place in various fighters, from a 1st person view inside the cockpit, or a 3rd person view from behind your ship. Ships have separate meters for shields and armor, and the player must cycle between weapons designed specifically to damage each. At the most basic, purple lasers must drain a target's shields, followed by switching to red lasers to destroy them. \n \nThe game features advanced lighting and particle effects for the Playstation, as well as a basic simulation of Newtonian physics. Thrusters are only active for as long as the accelerate button is held down. The player can burst fire their thrusters and drift, allowing for some advanced maneuvers. The campaign also features multiple endings and branching missions/storylines, based on your performance in the previous operations.","url":"https://www.igdb.com/games/colony-wars","videos":[{"id":13036,"game":8280,"name":"Gameplay video","video_id":"KLlwfYwKBm0","checksum":"4104039e-4402-d8e6-5f17-b77fb3c27760"}]}