{"id":8600,"alternative_names":[{"id":4454,"name":"Fear Factor"}],"cover":{"id":126644,"alpha_channel":false,"animated":false,"game":8600,"height":1716,"image_id":"co2ppw","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ppw.jpg","width":1287,"checksum":"a75a0b9f-91bc-ca99-c741-41f60ec90bc0"},"first_release_date":951350400,"genres":[{"id":5,"name":"Shooter"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":24064,"company":{"id":343,"name":"Kronos Digital Entertainment"},"created_at":1433203200,"developer":true,"game":8600,"porting":false,"publisher":false,"supporting":false,"updated_at":1433203200,"checksum":"2ee64e71-e103-f137-8230-b9868f20f565"},{"id":24065,"company":{"id":4,"name":"Eidos Interactive"},"created_at":1433203200,"developer":false,"game":8600,"porting":false,"publisher":true,"supporting":false,"updated_at":1433203200,"checksum":"cc4724a4-0138-4e51-4c78-4aba421cd5e8"},{"id":24066,"company":{"id":26,"name":"Square Enix"},"created_at":1433203200,"developer":false,"game":8600,"porting":false,"publisher":true,"supporting":false,"updated_at":1433203200,"checksum":"574a6631-46e1-3db4-f61c-e46851f9c65b"}],"name":"Fear Effect","screenshots":[{"id":704976,"alpha_channel":false,"animated":false,"game":8600,"height":1080,"image_id":"scf3yo","url":"//images.igdb.com/igdb/image/upload/t_thumb/scf3yo.jpg","width":1920,"checksum":"4075b55d-4b39-596c-bc3c-08f1367f1629"},{"id":704977,"alpha_channel":false,"animated":false,"game":8600,"height":1080,"image_id":"scf3yp","url":"//images.igdb.com/igdb/image/upload/t_thumb/scf3yp.jpg","width":1920,"checksum":"c8f20568-c301-02ef-f6ce-416f310b7681"},{"id":704978,"alpha_channel":false,"animated":false,"game":8600,"height":1080,"image_id":"scf3yq","url":"//images.igdb.com/igdb/image/upload/t_thumb/scf3yq.jpg","width":1920,"checksum":"8aa662f8-072e-3161-20ff-f2a4ad0ecfc4"},{"id":704979,"alpha_channel":false,"animated":false,"game":8600,"height":1080,"image_id":"scf3yr","url":"//images.igdb.com/igdb/image/upload/t_thumb/scf3yr.jpg","width":1920,"checksum":"c27b3da7-b7a2-2983-addc-d87a4b557135"}],"slug":"fear-effect","storyline":"Set around the year 2050. When Wee Ming, the daughter of a powerful Hong Kong Triad boss disappears, a trio of mercenaries search for her in the city. They have not been hired to find her, but they intend to kidnap the girl before her father's men locate her and hold her for ransom. Wee Ming has vanished into the fictional Shan Xi protectorate; Hana Tsu-Vachel, the lead character and femme fatale of the group, used to work in a brothel somewhere in that region.\n\nHana arrives in Hong Kong accompanied by her partners, Royce Glas and Jacob \"Deke\" DeCourt. What begins as a simple snatch and grab turns into a fiasco: The father of the runaway, Mr. Lam, attributes his fortune and power to a pact he made with demons long ago. Wee Ming, who is a paper doll given life, has been scheduled to serve as a sacrifice to Yim Lau Wong, the mythical \"King of Hell\". Hana's contact inside Mr. Lam's organization, Jin, is discovered, tortured, and left to die with a bomb strapped to his chest. Hana frees him, but he is killed shortly after. Meanwhile, Glas is attacked by a VTOL jet and forced to flee into Mr. Lam's building. After avenging Jin, Hana is captured and beaten by Mr. Lam and his thugs. Glas is able to rescue Hana, and the duo make their escape where they meet Deke in front of the hotel they are staying at. While listening to Jin's last message for Hana, the trio are forced off a bridge but are able to swim to a junk. While sailing down a river, Deke spots Wee Ming amongst a burning village. Deke and Glas give chase while Hana gets dressed, but all three are separated by the undead villagers.\n\nThey stumble upon a military train where the hostile soldiers shoot anyone on sight for fear of the villagers. Hana and Deke wreck the train trying to steal it, but Glas is able to find a jeep with Wee Ming sitting inside. She asks to be taken to a Madam Chen's restaurant, which doubles as a brothel, hoping to find answers about her existence. When Glas is caught sneaking in the brothel, Mr. Lam surprises him, cutting off his left arm. At the same time, Deke is murdered while trying to infiltrate the brothel from upstairs. Hana sneaks in by dressing up like one of the prostitutes, where she runs into Wee Ming again after she had been dragged off by Madam Chen, who is working for Mr. Lam. Wee Ming's powers activate, after being splashed with Deke's blood, transforming the working girls and Madam Chen's thugs into demons.\n\nThe one-armed Glas reawakens in a meat locker, surprised to find he is still alive; he surmises that Mr. Lam must be planning a slow death for him. Wee Ming arrives and tries her best to aid him. When Hana storms in to confront her former boss, Madam Chen, she learns that Chen is actually a demon in disguise. In the ensuing fight, Chen and her minions are killed, but Mr. Lam disappears with his daughter into a portal to Hell. Determined to save Wee Ming from whatever fate Mr. Lam has in store for her, Hana follows them into the portal, with Glas reawakening, and frees himself to give chase.\n\nIn a surreal journey through Hell, Hana meets the Black and White Guards of Impermanence who give her cryptic messages about her fate. Glas encounters the reanimated corpse of Deke, who is being tortured for the many murders he has committed. Deke takes on a grotesque demonic form and attacks Glas. After he is victorious, Glas promises to avenge Deke. Meanwhile, Hana confronts Yim Lau Wong, who explains that Hell has become overburdened with the souls of the guilty. Once Wee Ming is returned to the netherworld, Yim Lau Wong will be able to expand the reaches of Hell and consume Earth. Hana was chosen to look after Wee Ming because Yim Lau Wong desired someone \"ruthless\" to be her guardian.\n\nGlas reappears and tries to kill Wee Ming, believing her to be the root of the chaos. During the tense standoff between Hana and Glas, the player is given a choice over which of them should die. This decision will determine the final boss as well as the subsequent ending. On the \"Hard\" difficulty setting, a third option will become available: spare the lives of both Glas and Hana. In this ending, the pair emerge from the smoldering wreckage of the brothel, where they find a befuddled Deke sitting on a toilet. Deke has no memory of being killed, believing he has taken a bump to the head, and asks how they made out on the \"deal\". As he hoists himself out of the pit, Glas is stunned to realize that his left arm has been completely restored. The three partners walk off into the sunrise to continue their exploits.","summary":"Fear Effect is an action adventure waiting to unfold! Wee Ming Lam disappears a few days before her 18th birthday under mysterious circumstances. Three ruthless mercenaries conspire to track her down and ransom her off to her father, Mr. Lam, a powerful Triad leader in Hong Kong. An extortion mission to retrieve Wee Ming Lam becomes a lesson in survival against the most unimaginable of enemies.","total_rating":75.9615909096996,"total_rating_count":23,"url":"https://www.igdb.com/games/fear-effect","videos":[{"id":23264,"game":8600,"name":"Trailer","video_id":"XlklLjJHglo","checksum":"213f93e7-8bfa-91b8-c701-df4290a068fa"},{"id":62830,"game":8600,"name":"Gameplay Trailer","video_id":"viHihoLu3G8","checksum":"1c65abac-f2ff-f8b4-894f-0f7cd3ea118f"}]}