{"id":12895,"collection":{"id":1971,"created_at":1450954093,"games":[2751,12895,15535,25188,58309,58475,60329,84558,218364,218365],"name":"Galaga","slug":"galaga","updated_at":1667463188,"url":"https://www.igdb.com/collections/galaga","checksum":"cb13c646-a726-bbab-9235-0e75712b8d64"},"cover":{"id":187135,"alpha_channel":false,"animated":false,"game":12895,"height":697,"image_id":"co40e7","url":"//images.igdb.com/igdb/image/upload/t_thumb/co40e7.jpg","width":715,"checksum":"d8e20cc7-8606-8642-dbc5-fa09bebb4b81"},"first_release_date":969667200,"genres":[{"id":5,"name":"Shooter"}],"involved_companies":[{"id":181643,"company":{"id":183,"name":"Hasbro Interactive"},"created_at":1659661172,"developer":false,"game":12895,"porting":false,"publisher":true,"supporting":false,"updated_at":1659663849,"checksum":"b8ed48d6-3aa6-2bdf-95f9-473fac9f4eca"},{"id":181644,"company":{"id":1959,"name":"King of the Jungle"},"created_at":1659661172,"developer":true,"game":12895,"porting":false,"publisher":false,"supporting":false,"updated_at":1659663849,"checksum":"a6b59abb-e4c0-f91f-20d7-cc4bb2893aad"}],"name":"Galaga: Destination Earth","slug":"galaga-destination-earth","summary":"Galaga, the \"slide-and-shoot\" arcade classic from 1981, has been updated with nine new worlds, 3D graphics, futuristic backgrounds and more in GALAGA -- Destination: Earth.\n\nIt is late in the 22nd century, and the insect-like Galaga are back. Humans have terraformed and colonized most habitable places in our solar system, but the Galaga have only one thing in mind: destruction. The Galaga are mutated nanites that were inadvertently created during the terraforming process. They are deadly, autonomous and great in number, and you must blast them into oblivion. In addition to shooting Galaga, you must perform various mission objectives, such as collecting life pods and activating water turbines.\n\nLike in the original game, you begin this enhanced version of Galaga controlling a ship that moves horizontally along the bottom of the playfield and fires upward at wave after wave of diving, swirling aliens that eventually fly into formation. However, unlike the original, this game, depending on what mission you are playing, features a number of other viewpoints, including over the shoulder, top down and side on. You can fire just two shots at a time, but you can gain the ability to have three shots onscreen at once.\n\nAlso like the original game, GALAGA -- Destination: Earth features challenge waves in which you blast streams of enemies for points while not having to worry about your own safety. And, of course, you can let a Galaga capture your ship, then shoot your ship's captor, letting the captured ship fall to you, enabling you to double your firepower. Similar to Gaplus, the sequel to classic Galaga, this game also lets you collect beam power-ups that enable you to capture enemies, place them by your side and use their weapons.","url":"https://www.igdb.com/games/galaga-destination-earth"}