{"id":5525,"alternative_names":[{"id":9141,"name":"Populous 3: The beginning"},{"id":15970,"name":"Populous 3"}],"collection":{"id":1207,"created_at":1422788171,"games":[248,5525,8893,8894,8895,8896,8897,8898],"name":"Populous","slug":"populous","updated_at":1662343662,"url":"https://www.igdb.com/collections/populous","checksum":"c051c5ef-a077-b5ac-21e2-fa66951ded2d"},"cover":{"id":100323,"alpha_channel":false,"animated":false,"game":5525,"height":1008,"image_id":"co25er","url":"//images.igdb.com/igdb/image/upload/t_thumb/co25er.jpg","width":756,"checksum":"f7fe04e8-27b1-de44-1985-3f82b372aae0"},"first_release_date":912384000,"genres":[{"id":11,"name":"Real Time Strategy (RTS)"},{"id":15,"name":"Strategy"}],"involved_companies":[{"id":13382,"company":{"id":14,"name":"Bullfrog Productions"},"created_at":1394064000,"developer":true,"game":5525,"porting":false,"publisher":false,"supporting":false,"updated_at":1394064000,"checksum":"b5895411-d5b4-f8b6-bef2-08d1dcc2fcfb"},{"id":13383,"company":{"id":1,"name":"Electronic Arts"},"created_at":1394064000,"developer":false,"game":5525,"porting":false,"publisher":true,"supporting":false,"updated_at":1394064000,"checksum":"399a08fe-bb28-e37c-3fd0-eccd0d10a326"}],"name":"Populous: The Beginning","screenshots":[{"id":4352,"game":5525,"height":768,"image_id":"jz4wrwlvitlsuszlsco9","url":"//images.igdb.com/igdb/image/upload/t_thumb/jz4wrwlvitlsuszlsco9.jpg","width":1024,"checksum":"ba4e4ec1-3f67-d757-7906-5891ccb2f3cd"},{"id":4353,"game":5525,"height":480,"image_id":"ixtkcvt2qvjgdusz48jr","url":"//images.igdb.com/igdb/image/upload/t_thumb/ixtkcvt2qvjgdusz48jr.jpg","width":640,"checksum":"f6c75f9f-d154-c631-4b75-958ca879135a"},{"id":4354,"game":5525,"height":900,"image_id":"dpzacdekxiutdxmeadaz","url":"//images.igdb.com/igdb/image/upload/t_thumb/dpzacdekxiutdxmeadaz.jpg","width":1440,"checksum":"fe0ea687-8dcc-0ee3-8ec9-2d8ba073e07c"},{"id":4355,"game":5525,"height":270,"image_id":"ssho7fnd0thtxvsnxhwa","url":"//images.igdb.com/igdb/image/upload/t_thumb/ssho7fnd0thtxvsnxhwa.jpg","width":386,"checksum":"cbc2b501-3d02-d109-a209-d70325f9362c"},{"id":4356,"game":5525,"height":261,"image_id":"fqx2lfwpz30kv8rolu6o","url":"//images.igdb.com/igdb/image/upload/t_thumb/fqx2lfwpz30kv8rolu6o.jpg","width":400,"checksum":"30c0239a-fbbc-0c0a-7047-8b3687c2845c"}],"slug":"populous-the-beginning","storyline":"Populous: The Beginning takes place before the first two games in the series. The player controls the Blue tribe, pitted against the three enemy tribes which control most of the solar system. The player's destiny as Shaman is to become a deity; only by defeating all the enemies in the system can the player's shaman become omnipotent. The player begins on the planet furthest from the sun, and attacks each planet in sequence. Along the way, the Shaman can learn new skills and magic to defeat her (usually) much more powerful enemies. Victory requires the player to either destroy the opposition, or on occasion perform special actions. The player loses if his or her Shaman is killed and there are no remaining followers, if the Shaman is killed and there is no circle of reincarnation, or the player runs out of time on timed levels.[16] Upon beating back the other tribes, the Shaman ascends to godhood, and further helps her people conquer the Matak, Chumara and Dakini in one final conflict.","summary":"Populous: The Beginning is a strategy and god-style video game. It is the third entry in the Populous video game series, developed by Bullfrog Productions in 1998. The PC version of the game was released November 30, 1998 and a PlayStation version was later developed and released on April 2, 1999. \n \nUnlike earlier games in the series, which cast the player in the role of a god influencing loyal followers, The Beginning took a radical departure and placed the player in the role of a shaman, who directly leads her tribe against opponents. Throughout the twenty-five missions of the campaign, the player leads their tribe across a solar system, dominating enemy tribes and tapping new sources of magic, with the ultimate goal of the shaman attaining godhood herself. \n \nPopulous: The Beginning was the first entry in the series to use true 3D computer graphics; Bullfrog waited four years after Populous II: Trials of the Olympian Gods so that the graphics technology could catch up to their vision for a new and different game in the series. The developers considered the addition of terrain deformation and manipulation, combined with \"smart\" villagers who automatically attended to tasks, to add an entirely new dimension to the series. The game's original title was Populous: The Third Coming before being changed prior to the beta release. \nPopulous: The Beginning plays very differently from earlier titles and received mixed reviews. Reviewers positively noted the excellent graphics, while complaints were directed at the artificial intelligence and the indecision in game design between being a real time strategy title and a god game. GamePro's Peter Olafson wrote that Populous: The Beginning was not a bad game, in fact a good one; \"but it's a different game—one without a quintessential quality that defined Populous.\"","total_rating":76.5302209380586,"total_rating_count":24,"url":"https://www.igdb.com/games/populous-the-beginning","videos":[{"id":1961,"game":5525,"name":"Game intro","video_id":"plX4VzG9_g4","checksum":"b83b161d-c81e-941a-e9fb-77ffaf87ba6b"}]}