{"id":18699,"alternative_names":[{"id":23268,"name":"R4: Ridge Racer Type 4"},{"id":27936,"name":"R4"}],"collection":{"id":946,"created_at":1400770612,"games":[541,3588,6871,7160,7441,8546,10386,18696,18698,18699,18787,20201,21572,23127,25144,60881,62345,62371,225743],"name":"Ridge Racer","slug":"ridge-racer","updated_at":1668474074,"url":"https://www.igdb.com/collections/ridge-racer","checksum":"e33ad063-12eb-ea63-6dd7-a6af2f805ec3"},"cover":{"id":168639,"alpha_channel":false,"animated":false,"game":18699,"height":1896,"image_id":"co3m4f","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3m4f.jpg","width":1422,"checksum":"35ddb229-8490-88e2-d9f0-e276a8fe198b"},"first_release_date":912643200,"genres":[{"id":10,"name":"Racing"}],"involved_companies":[{"id":34536,"company":{"id":263,"name":"Namco"},"created_at":1460160000,"developer":true,"game":18699,"porting":false,"publisher":true,"supporting":false,"updated_at":1460160000,"checksum":"260a9f93-6193-2ff5-12f9-58feaf7b4b3b"}],"name":"Ridge Racer Type 4","screenshots":[{"id":33457,"game":18699,"height":360,"image_id":"d3xnuodxff0sbznsgwzj","url":"//images.igdb.com/igdb/image/upload/t_thumb/d3xnuodxff0sbznsgwzj.jpg","width":480,"checksum":"abe05f85-dc18-bafb-bca1-ea63d555f336"},{"id":33458,"game":18699,"height":360,"image_id":"kqyuvatuz6tg938kh1ty","url":"//images.igdb.com/igdb/image/upload/t_thumb/kqyuvatuz6tg938kh1ty.jpg","width":480,"checksum":"92e85ced-2b5a-9b6d-2bd3-f4b1de383c8e"},{"id":572123,"alpha_channel":false,"animated":false,"game":18699,"height":256,"image_id":"scc9gb","url":"//images.igdb.com/igdb/image/upload/t_thumb/scc9gb.jpg","width":320,"checksum":"f1d702e4-0825-ca3d-620a-7ec58dd2b8fd"},{"id":572124,"alpha_channel":false,"animated":false,"game":18699,"height":600,"image_id":"scc9gc","url":"//images.igdb.com/igdb/image/upload/t_thumb/scc9gc.jpg","width":800,"checksum":"3f965f29-3235-88c9-ee96-cee71bf53a92"},{"id":572125,"alpha_channel":false,"animated":false,"game":18699,"height":675,"image_id":"scc9gd","url":"//images.igdb.com/igdb/image/upload/t_thumb/scc9gd.jpg","width":900,"checksum":"54484f21-e477-d25a-f6a8-10e2df6c30d4"}],"slug":"ridge-racer-type-4","storyline":"R4: Ridge Racer Type 4 is an arcade-style racing game with a strong emphasis on powersliding around corners. Vehicles use one of two styles of powersliding depending on the make of car they select: Drift and Grip. Drift cars require players to tap the brake once while turning to break into a smooth powerslide while Grip cars requires players to alternate between brakes and gas while turning to powerslide.\nVehicles are earned by playing through the game's Grand Prix mode. Players select one of four teams; R.C Micro Mouse Mappy, Pac Racing Club, Racing Team Solvalou and Dig Racing Team, who each have varying difficulties, and one of four manufacturers; Age Solo, Lizard, Assoluto and Terrazi, which determines the style of car and powerslide type the player will use. In each race, the player must attempt to reach a qualifying position, with later stages requiring players to place in higher positions to qualify. Depending on the qualifying position in each race, players will be awarded a new vehicle, or an upgrade to their current one, based on their team and manufacturer, with better cars earned for reaching consistently higher positions (i.e. the best cars are earned by placing 1st in each match while the least impressive cars are earned by just clearing the minimum qualifying positions). There are a total of 320 vehicles earned by racing with every combination of team, manufacturer and qualifying position. If the players unlock all 320 cars, they will unlock an additional one modelled after Pac-Man, for a total of 321 vehicles.\nThe game also features Time Attack mode, in which players can attempt to get the fastest time on each course, and VS. Battle, a split-screen mode for two players (the first to appear in the home console series) and an undocumented PlayStation Link Cable mode, allowing four players to play simultaneously. Players can also create them our car decors and participate in Extra Trials against powerful prototype cars. The game is also compatible with the JogCon peripheral and the PocketStation device, which allows players to trade cars with friends.\nA further new feature was the Decal Edit, which allowed players to design their own logo for use on cars.","summary":"R4: Ridge Racer Type 4 (Ridge Racer Type 4 in Europe) is a racing video game developed and published by Namco for the PlayStation. It is the fourth title in the Ridge Racer series and the last to be released for the PlayStation. It was later re-released on the PlayStation Network in 2011. It is the first Ridge Racer series game on the PlayStation to use Gouraud shading on polygons.","total_rating":89.85765697346591,"total_rating_count":22,"url":"https://www.igdb.com/games/ridge-racer-type-4","videos":[{"id":7735,"game":18699,"name":"Gameplay video","video_id":"cnjie2G7_gQ","checksum":"8a452384-3534-35a0-2419-c04e62916387"}]}