{"id":1356,"alternative_names":[{"id":2943,"name":"シルエットミラージュ"},{"id":2944,"name":"Silhouette Mirage: Reprogrammed Hope"}],"cover":{"id":157413,"alpha_channel":false,"animated":false,"game":1356,"height":800,"image_id":"co3dgl","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3dgl.jpg","width":600,"checksum":"b4ec5a24-75a9-0ba5-bf53-47daa6e85adc"},"first_release_date":873849600,"genres":[{"id":5,"name":"Shooter"},{"id":8,"name":"Platform"}],"involved_companies":[{"id":19553,"company":{"id":861,"name":"Treasure"},"created_at":1415664000,"developer":true,"game":1356,"porting":false,"publisher":false,"supporting":false,"updated_at":1415664000,"checksum":"69d3417c-64c9-3dbb-22f0-7b1c5b339564"},{"id":19554,"company":{"id":1964,"name":"ESP Software"},"created_at":1415664000,"developer":false,"game":1356,"porting":false,"publisher":true,"supporting":false,"updated_at":1415664000,"checksum":"b8c33ac0-fb13-6aaf-bb10-54f5d54e5e39"},{"id":19555,"company":{"id":820,"name":"Working Designs"},"created_at":1415664000,"developer":false,"game":1356,"porting":false,"publisher":true,"supporting":false,"updated_at":1415664000,"checksum":"60164b7a-d136-7dfb-4a37-087d22d98539"},{"id":55014,"company":{"id":5346,"name":"HAMSTER Corporation"},"created_at":1506556800,"developer":false,"game":1356,"porting":false,"publisher":true,"supporting":false,"updated_at":1506556800,"checksum":"d9e2e436-bd49-93cd-4be0-d89b1a7e7a24"}],"name":"Silhouette Mirage","slug":"silhouette-mirage","storyline":"Silhouette Mirage takes place after a catastrophic event that causes a massive explosion and everyone in the world to split into two beings. Silhouette and Mirage. In case such an event happened humans created the \"Edo System\" to restore peace to the world, if the message was received. That Messenger is Shyna Nera Shyna known as the \"Messenger of Destruction\". Unfortunately, Shyna's memory has been mostly erased and she cannot remember where Edo is and has to find her way there. However, once she begins her journey she learns that the Silhouettes and Mirages are at war with one another, and to make matters worse is that both of them agree on thing and that is to eliminate Shyna.","summary":"Following genetic experiments conducted by a group of scientists at the turn of the millennium, a biological explosion contaminated the genetic structure of life on Earth. Two attributes emerged from the ruins, known as Silhouette and Mirage; like Yin and Yang, they cannot exist without each other, but are fundamentally opposed in their nature and ideology. Only a Messenger, one who contains both attributes in a balance, is able to get to the Edo facility and reverse back the genetic disaster, destroying both Silhouette and Mirage. This messenger is a young girl named Shyna Nera Shyna.\n\nSilhouette Mirage is a side-scrolling action game. The basic gameplay is somewhat similar to that of Gunstar Heroes. The game's standout feature is the concept of the two attributes. Depending on the enemy's attributes and the type of attack used by Shyna, damage can be increased, and spirit (equivalent to magic power) can be absorbed from enemies. Shyna can dash, jump, crouch, slide, and grab enemies, executing combo attacks. It is also possible to master moves, acquire money, and purchase special creatures called \"parasites\", which teach Shyna various types of attacks.","total_rating":77.0093457943925,"total_rating_count":5,"url":"https://www.igdb.com/games/silhouette-mirage","videos":[{"id":22927,"game":1356,"name":"Game intro","video_id":"-EijBZeeKwc","checksum":"ad254813-756f-4daf-a9d2-d7240bbaf3fa"}]}