{"id":4330,"collection":{"id":947,"created_at":1400787932,"games":[4330,6879,12770,17732,23579,74199],"name":"Space Hulk","slug":"space-hulk","updated_at":1667789593,"url":"https://www.igdb.com/collections/space-hulk","checksum":"7cd13433-3bf3-05ed-4db4-7b55cf7e8cbf"},"cover":{"id":151710,"alpha_channel":false,"animated":false,"game":4330,"height":800,"image_id":"co3926","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3926.jpg","width":600,"checksum":"b9f92564-2898-7eef-57a0-a7d08e91a54f"},"first_release_date":820368000,"franchise":{"id":6,"name":"Warhammer 40,000"},"genres":[{"id":11,"name":"Real Time Strategy (RTS)"},{"id":15,"name":"Strategy"},{"id":24,"name":"Tactical"}],"involved_companies":[{"id":13452,"company":{"id":1,"name":"Electronic Arts"},"created_at":1394496000,"developer":false,"game":4330,"porting":false,"publisher":true,"supporting":false,"updated_at":1394582400,"checksum":"a01cccb3-68b5-cb10-a9e9-77d18b7f2c82"},{"id":25809,"company":{"id":2467,"name":"Key Game"},"created_at":1440979200,"developer":true,"game":4330,"porting":false,"publisher":false,"supporting":false,"updated_at":1440979200,"checksum":"e3bd172a-5a89-24b9-6c60-25ef50ebec6d"}],"name":"Space Hulk: Vengeance of the Blood Angels","screenshots":[{"id":12965,"game":4330,"height":480,"image_id":"pjratxu1uwzuwuxtg533","url":"//images.igdb.com/igdb/image/upload/t_thumb/pjratxu1uwzuwuxtg533.jpg","width":640,"checksum":"6310e63a-6d05-7a46-288e-8c08b1b0e62a"},{"id":12966,"game":4330,"height":480,"image_id":"pj3dhjqromjbubtlwmre","url":"//images.igdb.com/igdb/image/upload/t_thumb/pj3dhjqromjbubtlwmre.jpg","width":640,"checksum":"05c2d98c-3102-b6cb-f883-924ac1091267"},{"id":43260,"game":4330,"height":480,"image_id":"hqctrjoenrkvee0abdnr","url":"//images.igdb.com/igdb/image/upload/t_thumb/hqctrjoenrkvee0abdnr.jpg","width":640,"checksum":"edd076e6-9224-7012-e01c-e532e85f9e2d"},{"id":43261,"game":4330,"height":480,"image_id":"glxlsaxdcvqhbji7ylip","url":"//images.igdb.com/igdb/image/upload/t_thumb/glxlsaxdcvqhbji7ylip.jpg","width":640,"checksum":"c035a6e1-d457-9019-5b46-b2e6c8ebd5b6"},{"id":43262,"game":4330,"height":480,"image_id":"nfomjdsvkp90qglaipws","url":"//images.igdb.com/igdb/image/upload/t_thumb/nfomjdsvkp90qglaipws.jpg","width":640,"checksum":"0e7fea56-a46a-13c0-43f9-8a19f8eb3410"}],"slug":"space-hulk-vengeance-of-the-blood-angels","storyline":"It's the 41st Millennium. For 20,000 years mankind has expanded forth throughout the galaxy aided by a phenomenal invention known as the Warp Drive, which allows huge spatial distances to be traversed in a matter of hours. Under the auspices of the Emperor; a psychic so powerful he is essentially immortal, a pan-galactic Imperium has been established in which mankind has spread and prospered. The defenders of the Imperium are the Adeptus Astartes, or Space Marines, bio-genetically engineered warriors of superhuman prowess, ever vigilant to destroy the many threats that face mankind across the cosmos.\nThe player is one such Space Marine, belonging to one of the oldest and most honourable Chapters known as the Blood Angels, whose battle honours date back as long as the Imperium has existed. You have acquitted yourself well even among such heroic company, and it is thus that the player finds him/herself assigned to the Terminator company. Among the thousand warriors that compose a Space Marine Chapter, only the hundred most valorous and gifted brothers are deemed worthy enough of this honour. Terminators are the Chapter's ultimate warriors. Protected by this suit that makes them all but impervious to conventional weaponry, and armed with the most devastating weaponry available, Terminators stand in fear of no foe, no matter how potent.\nAmong the most insidious of mankind's enemies are Genestealers, a strange and terrifying alien race, reptilian in appearance, they are huge armoured six-limbed beasts, preternaturally swift and unbelievably ferocious in combat. A genestealer knows no fear, charging into combat irrespective of any threat to its life. Incredibly hard to kill and all too capable of inflicting death themselves, it is no surprise that Genestealers are considered one of the foremost threats to mankind's survival. However, there is another more frightening element to their nature: Genestealers are incapable of reproducing amongst themselves, and must rely on other races to expand their population.\nThe method they employ for this purpose is terrifying upon encountering a suitable host, such as a human being, a Genestealer will fix its piercing eyes upon it, mesmerising it much like a Terran snake does its prey. While the host is thus hypnotised, the Genestealer will extend its tongue, which contains a hollow, pointed tube known as the ovipositor in a gruesome parody of a kiss, depositing a small egg-like cell that contains the Genestealer's genetic profile. This cell behaves like a cancer, malignantly coursing through the host's system and altering its genetic profile. The victim shows little outward sign of the infection - in fact, he gains some of the 'Stealer's remarkable strength, resilience and longevity, becoming healthier than he was before. The effect is only really evident once the victim comes to reproduce.\nOnce they come to mate, the offspring of any victim is born as a Hybrid, a corrupt creature exhibiting characteristics of both Genestealer and host species. The Hybrid itself is equipped with an ovipositor, which it uses in a similar manner to its Purestrain parent. This cycle continues, with each new generation of Hybrid resembling the host species more closely. By the fourth generation, the offspring is barely detectable as alien save for a few give-away signs such as unnaturally sharp teeth and a purplish tinge to the skin. The offspring of this fourth generation is procreated in the conventional manner, and can result in either a Hybrid, a normal member of the host species or a Purestrain Genestealer, the only manner in which Purestrains can be produced. All the generations are linked in a psychic community, so Purestrains, Hybrids, and hosts all conceive of themselves as constituents of the same brood.\nThe manner in which Genestealers carry out their reproductive process is of exceptional danger to the Imperium, as whole planets can fall to the Genestealer threat; the affected humans look and act no different from normal, and the hosts are extremely secretive about the insidious curse they bear. Indeed the first an external agency may know about the presence of Genestealers is once a whole planet has been affected by the curse, requiring total cleansing and repopulation. Imperial authorities are thus extremely keen to terminate the Genestealer menace at source, before it has a chance to affect any nearby planet.\nThe prime manner in which Genestealer came into contact with humanity is through the use of Space Hulks. These are spaceships of human origin which have become lost in Warpspace, either through a malfunction of the ship's Warp Drive, or just as a consequence of travelling in a medium as uncertain as Warpspace. The human occupants having died, Genestealers and their Hybrid brood move in, settling down to hibernation until the drifting Space Hulk comes into contact with a species riper for infiltration and domination.\nSo thus, it is that whenever a Space Hulk is detected in the proximity of a human planet, the stalwart warriors of the Space Marines are detached to rid the Hulk of its Genestealer cargo, preventing any chance of another planet falling victim to the Genestealer curse. Such is the combat prowess of the Genestealer that only the Terminator squads have met with any success. That is the player's status and this is the player's mission: rid the galaxy of the Genestealer menace once and for all.","summary":"Space Hulk: Vengeance of the Blood Angels is a mix of a First-Person-Shooter and a tactical fighting game. It is placed in the Warhammer 40k background of the Games Workshop table top games. It is the successor of the PC game Space Hulk from 1993 and it tells of the fight between the imperial Terminator Chapters and the Tyranid Gene Stealers.\n\nYou control up to ten Terminators. You give them orders in a tactical screen and/or take over one of them and then move in a 3D environment and fight the Gene Stealers just as in a First- Person-Shooter. So the game includes tactical planning and fighting in a good balance.","url":"https://www.igdb.com/games/space-hulk-vengeance-of-the-blood-angels","videos":[{"id":2001,"game":4330,"name":"Game intro","video_id":"FxB7Xl2r3aY","checksum":"f77c008c-8605-c154-1d04-a5bdc9da8cd4"}]}