{"id":4118,"cover":{"id":120899,"alpha_channel":false,"animated":false,"game":4118,"height":800,"image_id":"co2lab","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2lab.jpg","width":600,"checksum":"5c65bbb3-dd91-7088-faa8-f9050092ad1c"},"first_release_date":1003449600,"franchise":{"id":151,"name":"Spider-Man"},"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":10678,"company":{"id":72,"name":"Vicarious Visions"},"created_at":1390521600,"developer":true,"game":4118,"porting":false,"publisher":false,"supporting":false,"updated_at":1390521600,"checksum":"8095bc5a-82a2-13a7-8117-e8008e861813"},{"id":10679,"company":{"id":66,"name":"Activision"},"created_at":1390521600,"developer":false,"game":4118,"porting":false,"publisher":true,"supporting":false,"updated_at":1390521600,"checksum":"5a48b717-7d0d-7c18-616b-4a1e17977cdd"}],"name":"Spider-Man 2: Enter Electro","screenshots":[{"id":385963,"alpha_channel":false,"animated":false,"game":4118,"height":997,"image_id":"sc89t7","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc89t7.jpg","width":1215,"checksum":"2e2d76d9-297b-af05-2126-e6ff9c7947e1"},{"id":385964,"alpha_channel":false,"animated":false,"game":4118,"height":997,"image_id":"sc89t8","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc89t8.jpg","width":1215,"checksum":"5eb9afa9-f661-2434-50fd-2bdd09c494ad"},{"id":385965,"alpha_channel":false,"animated":false,"game":4118,"height":997,"image_id":"sc89t9","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc89t9.jpg","width":1215,"checksum":"e18d7f1e-9be4-a23e-3ecc-55b2494d6c93"},{"id":385966,"alpha_channel":false,"animated":false,"game":4118,"height":997,"image_id":"sc89ta","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc89ta.jpg","width":1215,"checksum":"b5e7d811-fccd-c3e1-a8d8-1aa1cbcb5e0c"},{"id":385967,"alpha_channel":false,"animated":false,"game":4118,"height":997,"image_id":"sc89tb","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc89tb.jpg","width":1215,"checksum":"c73aec6e-6d7c-1520-0114-9adc5e2bfcfb"},{"id":385968,"alpha_channel":false,"animated":false,"game":4118,"height":997,"image_id":"sc89tc","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc89tc.jpg","width":1215,"checksum":"9d2a3e30-fb79-5686-93df-aeb7856b4836"}],"slug":"spider-man-2-enter-electro","storyline":"Shortly after the Symbiote Invasion, a series of robberies led by Electro have taken place throughout New York City. While out on patrol, Spider-Man spots one of the robberies taking place at a building owned by BioTech. Planting a Spider-Tracer on the head thief's motorcycle, Spider-Man follows it to an abandoned warehouse where the thief is passing off a stolen briefcase to a contact. Spider-Man takes out the thugs and interrogates one of them, but is then attacked by the head thief: Shocker.\n\nAfter defeating Shocker, Spider-Man follows the thug's tip and heads for the airfield, where the contact is heading towards. Along the way, Spider-Man is forced to disable a bomb threat, take out a machine-gun nest, and stop a runaway airplane from crashing. As the contact escapes via helicopter, Spider-Man is able to plant another tracer on it and track it to a trainyard owned by Hammerhead. Fighting through the mob-employed night staff and Sandman, Spider-Man races to catch a fleeing train and meets with the contact, who is revealed as The Beetle. The masked villain escapes with his briefcase, but he unknowingly leaves Spider-Man a clue: an invitation to the Science and Industry Ball.\n\nElsewhere, Electro explains his plan to the other villains. He and his partners have stolen the parts to the Bio-Nexus Device, which can amplify one's bio-energy to power a city block, and Electro plans to use it to increase his own powers. The device is currently incomplete, and only its creator Dr. Watts knows how to finish it. Hammerhead and his goons are sent to the Science and Industry Ball to take Dr. Watts hostage.\n\nThough Spider-Man arrives at the Ball and manages to defeat Hammerhead, Sandman secretly escapes with the good doctor. Spider-Man decides to call Dr. Curt Conners at BioTech for some answers, but hears the sounds of a battle on the line. Spider-Man immediately infiltrates BioTech and reaches Dr. Connors's lab, where his alter-ego The Lizard is on an uncontrolled rampage. After being changed back to normal, Conners explains Electro's goal to become a god with the Bio-Nexus Device. He instructs Spider-Man to go and check out Dr. Watts' lab. Following a rooftop chase, Spider-Man eventually arrives at the lab and learns of the device's main power source, only to be caught in another battle with Sandman. After defeating Sandman by flushing him down the sewer grate with water, Spider-Man subsequently sees a newspaper article about the power source - a sapphire named Zeus's Tear - being on display at the museum. Electro is also informed of the jewel when one of his thugs brings him the same news article.\n\nAt the museum, Spider-Man catches up to Electro, who is still holding Dr. Watts as his hostage. He offers to give her up if Spider-Man gives him the Zeus's Tear. Spider-Man reluctantly obeys, and Electro tosses the doctor as Spider-Man throws the jewel. When Spider-Man attempts to snag the jewel back in midair with a web, Dr. Watts accidentally throws off his aim and he misses, allowing Electro to catch it. The Bio-Nexus Device complete, Electro activates it and flies off in an electrifying flash of lightning bolt. Spider-Man follows the villain to a massive conductor at a tower, where he supercharges himself into Hyper-Electro, a being of pure electrical energy. Unable to directly attack Electro, Spider-Man instead uses the tower's generators to overload and destroy the Bio-Nexus Device, ending Electro's power play for good.\n\nThe next day, The Mighty Thor is credited in the Daily Bugle as having saved New York from Electro, much to Spider-Man's disappointment. In prison, Electro sits in his cell moaning over his defeat while Hammerhead and Shocker play Poker. In a nearby cell, Doctor Octopus and the rest of the villains from the previous game are still locked up, and Shocker attempts to ask them if they know how to play Go Fish.","summary":"Spider-Man 2: Enter Electro is an action-adventure video game developed by Vicarious Visions and published by Activision for the PlayStation in 2001. It is the sequel to Neversoft's Spider-Man title, which was released the previous year. The game follows Spider-Man as he attempts to stop another old nemesis Electro from obtaining a source of power known as the Bio-Nexus Device. Game bosses include Shocker, Hammerhead, Lizard, Sandman and the exclusive charged-up Hyper-Electro.","total_rating":56.730782113897,"total_rating_count":62,"url":"https://www.igdb.com/games/spider-man-2-enter-electro","videos":[{"id":36468,"game":4118,"name":"Game Intro","video_id":"9igetlZR1OA","checksum":"3b4fda0d-3df5-142a-492f-150b50d0238b"}]}