{"id":4116,"alternative_names":[{"id":107188,"name":"Syphon Filter 2: Conspiración mortal"}],"cover":{"id":114617,"alpha_channel":false,"animated":false,"game":4116,"height":952,"image_id":"co2gft","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gft.jpg","width":714,"checksum":"8d1f05b7-7a8a-d3d6-99bf-c3670e36f04d"},"first_release_date":952992000,"genres":[{"id":5,"name":"Shooter"}],"involved_companies":[{"id":108182,"company":{"id":2024,"name":"Eidetic"},"created_at":1600041600,"developer":true,"game":4116,"porting":false,"publisher":false,"supporting":false,"updated_at":1600041600,"checksum":"ef0b57f3-ca36-2245-c834-70cf112f2496"},{"id":108183,"company":{"id":241,"name":"989 Studios"},"created_at":1600041600,"developer":false,"game":4116,"porting":false,"publisher":true,"supporting":false,"updated_at":1600041600,"checksum":"7681c515-3aa2-ddeb-155d-79d77f7e1ef2"}],"name":"Syphon Filter 2","screenshots":[{"id":438794,"alpha_channel":false,"animated":false,"game":4116,"height":540,"image_id":"sc9ekq","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc9ekq.jpg","width":960,"checksum":"b1d7265b-d2bf-281f-99f3-b234227b4f63"},{"id":438795,"alpha_channel":false,"animated":false,"game":4116,"height":720,"image_id":"sc9ekr","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc9ekr.jpg","width":1280,"checksum":"e92406de-57fe-9df9-73dd-a4329114aa7c"}],"slug":"syphon-filter-2","storyline":"Hours after the events of the first game, Gabriel Logan and Lian Xing are enemies of the state to the Agency after uncovering its connection to Syphon Filter, labeled as terrorists to the general public. Agency operative Dillon Morgan captures Lian at the PharCom warehouses, forcing Gabe and the CBDC soldiers to rendezvous with ex-Agency operative Teresa Lipan in Arizona. Simultaneously, the Agency scrambles a squadron of F-22 Raptors to intercept their transport over the Colorado Rockies, so Gabe and CBDC Lieutenant Jason Chance head down the mountain in search of their plane and a box of PharCom data disks. Agency operative Steven Archer attempts to stop them at all costs.\n\nA group of conspirators, including Mara Aramov and Agency director Lyle Stevens, make a deal to deliver the virus to a rogue Chinese general named Shi-Hao. Meanwhile, Lian recovers in a U.S. Air Force base where Morgan, Derek Falkan, and Thomas Holman are working with Dr. Elsa Weissinger of PharCom to extract infected plasma from test subjects. Lian learns that the other subject was PharCom CEO Jonathan Phagan, who survived his gunshot wound long enough for the Agency to take the plasma. Weissinger protests that Phagan is useful and should be kept alive for further research, but Morgan, not intending that the U.S. government find Pharcom's CEO infected with an unknown virus, deactivates his life support, tying up a loose end.\n\nLian escapes the medical building and interrogates Holman to learn that Morgan is planning another operation to the PharCom Expo Center to find an encryption disk. She leaves the base in a helicopter after killing Falkan and teams up with Gabe to battle Archer's forces. Gabe shoots Archer during his escape, and recovers the PharCom data.\n\nThe protagonists follow Holman's lead to the Expo Center and kill Morgan before he can recover the disk he sought. After decrypting the PharCom data, Teresa realises that some information is missing. The other half must be with Russian SVR director Uri Gregorov, who appeared at the warehouses before Gabe left. Since Lian and Uri know each other, they agree to meet in Moscow.\n\nAramov instigates a gunfight while they meet and Lian pursues Gregorov. Lian later learns he is an impostor working for Mara and trying to find the other half of the data. The man admits that the real Gregorov is in a Russian gulag, Aljir Prison, which once held Lian captive. Gregorov uncovered a plot to sell the virus to Shi-Hao, so Aramov intervened. Lian stops Gregorov's execution, but is almost killed by the virus and collapses. Gabe takes her back to the States, while Gregorov promises to handle Shi-Hao.\n\nGabe and Teresa arrive back at the Virginia safehouse overseen by Lawrence Mujari, a freelance pathologist. They decide to trade the PharCom data to the Agency for Lian's vaccine. Director Stevens double-crosses Gabe in the Agency's New York City labs, but Logan escapes and forces Dr. Weissinger to give him the vaccine. Gabe also finds out that Chance survived the mission in Colorado, and sets him free.\n\nPursued by NYPD SWAT cops and Agency personnel, Gabe hurries back to their helicopter. Along the way, Logan is forced to provide cover for a SWAT officer whose partner is wounded. He does so, but Stevens, who later takes the cop hostage, orders him to drop his weapons. Despite Logan complying in surrender, Stevens kills the officer anyway. Before he can get shot, Gabe is thrown into the sewers by an explosion that Teresa sets off. Gabe assumes that Chance was killed in the labs since Teresa says he never made it to the helicopter. Gabe and Teresa eventually corner Stevens and Gabe shoots him in cold blood.\n\nGabe and Teresa reach the helicopter to find Chance waiting in impenetrable Agency-issued body armor. He was really working for them, and he shoots Teresa. Gabe suspected it since the Agency always knew where he was in Colorado. Both men fight, and Gabe kills the man he trusted with an assault shotgun that drives Chance into the helicopter blades, decapitating him.\n\nA news report reveals that the Agency's existence is now public, and U.S. Secretary of State Vincent Hadden promises that the government will investigate. Gabe cures Lian and demarcates a grave for Teresa. He, Lian, and Lawrence hold a small memorial and promise to keep fighting, while soldiers watch them from a distance. In a post-credits scene, Hadden and Aramov emerge from a helicopter, with Aramov saying that the Administration will soon fall allowing Hadden to become President. Although a team of soldiers requests for permission to kill Gabe and his team, Hadden calls off the operation, telling Mara he has other plans for Gabe. Aramov laughs as the screen fades to black.","summary":"Syphon Filter 2 is a third-person shooter stealth video game developed by Eidetic and published by 989 Studios exclusively for PlayStation. Hours after the events of the first game, Gabriel Logan and Lian Xing are enemies of the state to the Agency after uncovering its connection to Syphon Filter, labeled as terrorists to the general public.","total_rating":79.6910662102768,"total_rating_count":59,"url":"https://www.igdb.com/games/syphon-filter-2","videos":[{"id":48864,"game":4116,"name":"Trailer","video_id":"Ujeu0ghqRZI","checksum":"ce08e579-b4b3-bbfe-d467-2a9573e6f147"},{"id":48865,"game":4116,"name":"Gameplay Video","video_id":"bOmL4W8NttE","checksum":"b5f9bac1-e317-ba4c-12cc-d4a0f1daf566"},{"id":48866,"game":4116,"name":"Gameplay Video","video_id":"5KdN-0m5jLk","checksum":"f7074e62-31a3-3980-87a0-aec4a29bd9a3"}]}