{"id":4100,"alternative_names":[{"id":83702,"name":"Tomba! 2"},{"id":99418,"name":"Tombi! 2"},{"id":99419,"name":"Tomba: The Wild Adventures"}],"collection":{"id":808,"created_at":1393775851,"games":[4097,4100],"name":"Tomba!","slug":"tomba","updated_at":1662309933,"url":"https://www.igdb.com/collections/tomba","checksum":"70dc6793-ab30-3c2b-08b4-812c8b50f7d8"},"cover":{"id":240795,"alpha_channel":false,"animated":false,"game":4100,"height":1333,"image_id":"co55sr","url":"//images.igdb.com/igdb/image/upload/t_thumb/co55sr.jpg","width":1000,"checksum":"1d6605b0-f151-8e3e-5440-c95510af9ac7"},"first_release_date":941068800,"genres":[{"id":8,"name":"Platform"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":186008,"company":{"id":13634,"name":"Sony Computer Entertainment"},"created_at":1662319768,"developer":false,"game":4100,"porting":false,"publisher":true,"supporting":false,"updated_at":1662337544,"checksum":"ebc9f762-2856-350d-5039-c5b11f29f1e7"},{"id":186009,"company":{"id":2015,"name":"Whoopee Camp"},"created_at":1662319768,"developer":true,"game":4100,"porting":false,"publisher":false,"supporting":false,"updated_at":1662337544,"checksum":"2252b039-5f90-b444-d655-888a6e228176"},{"id":186010,"company":{"id":2017,"name":"MonkeyPaw Games"},"created_at":1662319768,"developer":false,"game":4100,"porting":true,"publisher":false,"supporting":false,"updated_at":1662337544,"checksum":"7345307b-b79a-d11b-9909-8136e3031957"}],"name":"Tomba! 2: The Evil Swine Return","screenshots":[{"id":24032,"game":4100,"height":480,"image_id":"vexkkb48oo2u5uhti7q5","url":"//images.igdb.com/igdb/image/upload/t_thumb/vexkkb48oo2u5uhti7q5.jpg","width":640,"checksum":"07498346-5446-5e62-f678-c684648afbfc"},{"id":24033,"game":4100,"height":480,"image_id":"fb9k45rdftbdlixt7hra","url":"//images.igdb.com/igdb/image/upload/t_thumb/fb9k45rdftbdlixt7hra.jpg","width":640,"checksum":"2e9a5248-1a5e-86ac-1793-096130fbf40a"},{"id":24034,"game":4100,"height":500,"image_id":"inp8qwcz9diggydatdxl","url":"//images.igdb.com/igdb/image/upload/t_thumb/inp8qwcz9diggydatdxl.jpg","width":850,"checksum":"23eb57c5-5e0e-2595-6724-8ad7a77c2aa5"},{"id":24035,"game":4100,"height":283,"image_id":"h7fpymcfep7sijp8q1qa","url":"//images.igdb.com/igdb/image/upload/t_thumb/h7fpymcfep7sijp8q1qa.jpg","width":400,"checksum":"8a3705e9-bb35-b42b-7d22-0b987ac5f795"},{"id":24036,"game":4100,"height":480,"image_id":"hjobodmwwtrajfyix3on","url":"//images.igdb.com/igdb/image/upload/t_thumb/hjobodmwwtrajfyix3on.jpg","width":640,"checksum":"07fc21ae-bf64-917e-b107-fd55a368fa7a"}],"slug":"tomba-2-the-evil-swine-return","storyline":"A young feral boy named Tomba lives peacefully in his home country until his friend Zippo finds a mysterious letter addressed to Tomba. According to the letter, Tabby, Tomba's childhood friend, has disappeared. Wracked with anxiety, Tomba leaps into the sea in search of her. Tomba and Zippo wind up in a fisherman village where they meet an old man named Kainen. From there they move on to the Coal-Mining Town where Tabby's house is, but discover that she is unavailable. Gran, a denizen of the Coal-Mining Town, mentions seeing Tabby travel to the Kujara Ranch by trolley, but the trolley she used to travel there returns empty. A panicking trolley worker reveals that the Evil Pigs kidnapped Tabby when she tried to protect a penchant that was given to her by Tomba as a gift. Gran explains that the Evil Pigs have cursed the entire continent, and gives Tomba a red Pig Bag that is capable of capturing the Flame Pig that has cast his spell on the mines.\n\nTomba ventures throughout the continent gathering the rest of the Pig Bags. He cures the Coal-Mining Town of its inferno by capturing the Evil Flame Pig, cures the Kujara Ranch of its perpetual snowfall by capturing the Evil Ice Pig, cures the Donglin Forest's gloominess by capturing the Evil Ghost Pig, lifts the Circus Town's curse (which has turned its citizens into pigs) by capturing the Evil Earth Pig and cures the Water Temple of its perpetual rainfall by capturing the Evil Water Pig. When all of these Evil Pigs have been captured, their leader, the Last Evil Pig, reveals himself to Tomba and tempts him to find his lair. Tomba and Zippo locate the Last Evil Pig in an underground area underneath the Coal-Mining Town, where the Last Evil Pig freezes time in a last-ditch effort to stop Tomba. A final battle against the Last Evil Pig ends with his capture, but he promises his eventual return. Tomba and Zippo find Tabby in the Last Evil Pig's lair and escape the collapsing area on the back of the flying dog Baron. Following a feast at Tabby's home, Kainen appears and gives Tomba a monkey suit for him to wear as a reward for going on every adventure possible (if the player completed 133 events, it'll be black but if they completed those along with the 4 extra events, it'll be red). Tomba is allowed to pilot the local windmill owner's new boat to return home. However, Tomba gets involved in an accident on the boat's maiden voyage.","summary":"Tomba! 2: The Evil Swine Return is a side-scrolling platformer in which the titular character, Tomba, moves on predetermined linear paths until he reaches an intersection point where a flashing arrow appears over his head. At that point Tomba can move in either direction the arrow points. Some areas in the game enable the player to explore them in a top-down view, allowing Tomba to move around freely. The main goal of the game is to complete all 137 objectives (133 make the regular ones, while the other four are obtained from a Tomba 1 save file) which range from retrieving a fishing hook for a fisherman to helping Santa Claus find his \"sack\". Completing a task earns the player \"Adventure Points\", which can be used to unlock specific boxes scattered around the game's world. As the game progresses, Tomba can obtain suits that give him special abilities. For example, the flying squirrel suit allows Tomba to glide long distances while the pig suit allows Tomba to communicate with friendly pigs. Scattered throughout the levels are magical feathers that can instantly transport Tomba to any area that has previously been visited.","total_rating":74.9418352764705,"total_rating_count":21,"url":"https://www.igdb.com/games/tomba-2-the-evil-swine-return","videos":[{"id":8206,"game":4100,"name":"Trailer","video_id":"hKVA6nnAKWc","checksum":"b8e4ffee-7cbc-eea9-83f0-c0738beb2ac3"}]}