{"id":103203,"cover":{"id":130211,"alpha_channel":false,"animated":false,"game":103203,"height":800,"image_id":"co2sgz","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2sgz.jpg","width":600,"checksum":"55a21ad7-c9fd-b79c-d3ae-322b1c825248"},"first_release_date":896572800,"genres":[{"id":2,"name":"Point-and-click"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":65323,"company":{"id":15636,"name":"HyperBole Studios"},"created_at":1528070400,"developer":true,"game":103203,"porting":false,"publisher":false,"supporting":false,"updated_at":1528156800,"checksum":"a5e1e13f-3c28-2421-cfc4-43b03ff32002"},{"id":65324,"company":{"id":461,"name":"Fox Interactive"},"created_at":1528070400,"developer":false,"game":103203,"porting":false,"publisher":true,"supporting":false,"updated_at":1528156800,"checksum":"ed948573-c3b1-80f7-3d89-cbc23db4416b"},{"id":65325,"company":{"id":334,"name":"Sony Computer Entertainment Europe"},"created_at":1528070400,"developer":false,"game":103203,"porting":false,"publisher":true,"supporting":false,"updated_at":1528156800,"checksum":"33d4e82d-7317-8426-5175-a143b08ea3b4"}],"name":"The X-Files","screenshots":[{"id":213483,"game":103203,"height":480,"image_id":"fyffaxqq71olfzkhzksj","url":"//images.igdb.com/igdb/image/upload/t_thumb/fyffaxqq71olfzkhzksj.jpg","width":640,"checksum":"38dee8b7-46c9-4652-16f5-23d06b63892f"},{"id":213484,"game":103203,"height":210,"image_id":"x3q4wkjeosq2q2ywntny","url":"//images.igdb.com/igdb/image/upload/t_thumb/x3q4wkjeosq2q2ywntny.jpg","width":280,"checksum":"eaac99a6-2db2-2c8f-3ef5-ebf8b45f0274"},{"id":213485,"game":103203,"height":300,"image_id":"d5woocbequwnunaphigo","url":"//images.igdb.com/igdb/image/upload/t_thumb/d5woocbequwnunaphigo.jpg","width":400,"checksum":"0fae6cc4-d06c-f647-ad25-38b67b8a9763"}],"slug":"the-x-files--1","storyline":"The game takes place somewhere within the timeline of the third season of The X-Files series. The story follows a young Seattle-based FBI agent named Craig Willmore (played by Jordan Lee Williams) who is assigned by Assistant Director Walter Skinner to investigate the disappearance of agents Fox Mulder and Dana Scully, who were last seen in the Everett, Washington area. Agent Willmore must use his state-of-the-art spy tools: night vision goggles, a digital camera, PDA (an Apple Newton), lock picks, evidence kit, a standard issue handgun, a pair of handcuffs, and a badge to follow their trail. Along the way, he is partnered with a Seattle Police Department detective named Mary Astadourian (played by Paige Witte) and a minor subplot involves a relationship developing between the two. \n \nSeveral of the actors from the TV series reprise their roles in the game, including David Duchovny (Mulder), Gillian Anderson (Scully), Mitch Pileggi (Skinner), Steven Williams (X), Bruce Harwood, Tom Braidwood and Dean Haglund (The Lone Gunmen) and—very briefly and depending upon the outcome of the game—William B. Davis (The Smoking Man). The game is set and was filmed in Seattle. The TV series actors filmed their relatively brief appearances in the game just before entering production on the feature film. The game's plotline involves aliens taking over the bodies of humans and contains many references to the show's extraterrestrial mythology. During the course of the game the \"present day\" date of April 1996 is displayed alongside certain locations, placing this \"episode\" after the season three episode \"Avatar\" and before \"Wetwired\" , which take place March 7 and April 27 respectively. This time is also after the first incident with the alien black oil in the episode \"Piper Maru\" of the third season. \n \nThe screenplay for X-Files The Game was written by Richard Dowdy, Greg Roach and Frank Spotnitz, from a story by Chris Carter and Frank Spotnitz.","summary":"The X-Files Game is an interactive movie point-and-click adventure video game developed by HyperBole Studios and first published by Fox Interactive. The game was released for Microsoft Windows, Mac OS and PlayStation in 1998, and is based on the television series The X-Files.","total_rating":68.5576189396296,"total_rating_count":13,"url":"https://www.igdb.com/games/the-x-files--1","videos":[{"id":20319,"game":103203,"name":"Game intro","video_id":"M7FPjcjxT38","checksum":"410a09c7-ec33-87ab-58f6-3a84ee479530"}]}