{"id":42078,"alternative_names":[{"id":29223,"name":"Aldynes"},{"id":29224,"name":"オルディネス"}],"cover":{"id":168441,"alpha_channel":false,"animated":false,"game":42078,"height":565,"image_id":"co3lyx","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3lyx.jpg","width":640,"checksum":"119844f6-e821-8f56-483f-5579a0cd304b"},"first_release_date":667180800,"genres":[{"id":5,"name":"Shooter"}],"involved_companies":[{"id":91473,"company":{"id":864,"name":"Hudson Soft"},"created_at":1579910400,"developer":false,"game":42078,"porting":false,"publisher":true,"supporting":false,"updated_at":1579996800,"checksum":"9b91c869-a109-5133-a8dd-41c826693c58"},{"id":91474,"company":{"id":17174,"name":"Produce!"},"created_at":1579910400,"developer":true,"game":42078,"porting":false,"publisher":false,"supporting":false,"updated_at":1579996800,"checksum":"ce871a76-3485-9788-49bb-44c29300d5d1"}],"name":"Aldynes: The Mission Code for Rage Crisis","slug":"aldynes-the-mission-code-for-rage-crisis","summary":"Aldynes: The Mission Code for Rage Crisis, is a horizontal scrolling shoot 'em up game developed by Produce and released in July 22, 1991 for the SuperGrafx only for Japan. The game has a unique option-based combat and features levels with large scaling effects or parallax scrolling effects.\n\nNearing the year 2020, the societies of mankind fall into global depression just as an alien invasion suddenly comes down on Earth; coming from a large mechanical planetoid, the aliens attack the Earth without reason or communication. With all defenses annihilated, the United Nations corresponds with NASA to make a powerful space fighter known as The Ortega under project name Aldynes. During that time, a particular space fighter pilot - known only by his call sign Fox-A - was killed in action; his bereaved girlfriend Hiroko soon discovered Project Aldynes and its near complete fighter. As the invaders attack the air force housing Project Aldynes, she hijacks one of the ships and throws herself into battle in hopes of getting her revenge.","url":"https://www.igdb.com/games/aldynes-the-mission-code-for-rage-crisis"}