{"id":67666,"alternative_names":[{"id":54645,"name":"バステッド"},{"id":54646,"name":"Basuteddo"}],"cover":{"id":236025,"alpha_channel":false,"animated":false,"game":67666,"height":1152,"image_id":"co5249","url":"//images.igdb.com/igdb/image/upload/t_thumb/co5249.jpg","width":864,"checksum":"8d2212bf-07d3-e98b-1b87-f686da2fddd2"},"first_release_date":782697600,"genres":[{"id":12,"name":"Role-playing (RPG)"}],"involved_companies":[{"id":181795,"company":{"id":14082,"name":"NEC Avenue"},"created_at":1659717413,"developer":false,"game":67666,"porting":false,"publisher":true,"supporting":false,"updated_at":1659720213,"checksum":"73deb545-a018-33aa-af20-c312800b8987"},{"id":181796,"company":{"id":30525,"name":"JTS"},"created_at":1659717413,"developer":false,"game":67666,"porting":false,"publisher":false,"supporting":true,"updated_at":1659720213,"checksum":"28cfa368-75c0-2e5b-6805-6713c303293e"},{"id":181797,"company":{"id":30525,"name":"JTS"},"created_at":1659717507,"developer":true,"game":67666,"porting":false,"publisher":false,"supporting":false,"updated_at":1659720212,"checksum":"ad727213-4cb8-7126-6b16-89dfac398cc1"}],"name":"Basted","slug":"basted","summary":"Two young and lovely bounty huntresses, Ryeza and Anita, live in a village that is continuously attacked by monsters. One day, solving a little monster problem in the nearby forest, they encounter a mysterious masked man, who tells Ryeza she wields the power of the sacred jewel Basted. Soon the two girls join forces with a princess in exile, and work together to restore the throne to its rightful owners, persecuted by the ruthless Empire and its allies.\n\nThough Basted may look like an RPG at first sight (medieval setting, top-down world, game progression that alternates between towns and dungeons, etc.), it is in fact primarily an action game. Controlling Ryeza and Anita, the player explores the surroundings, talks to people and participates in battles to advance the story. There are no levels, items, equipment, money system, or other required RPG elements.\n\nMost battles occur as dictated by the plot, though some are optional. The battles take place on a separate screen. For most battles, the player is able to choose either Ryeza or Anita. Ryeza can jump, and Anita has a long-ranged fire attack. Regular attacks can be powered-up if executed when the attack power meter is at maximum. Both girls can also charge power to execute devastating special attacks (two unique attacks per girl). They are also able to dash and attack while dashing, inflicting more damage.\n\nThe game features a large amount of fully voiced anime-style cutscenes to advance the story.","url":"https://www.igdb.com/games/basted"}