{"id":38078,"alternative_names":[{"id":59194,"name":"ダライアス プラス"},{"id":59195,"name":"Daraiasu Purasu"},{"id":59196,"name":"Darius PC-Engine SuperGrafx TurboGrafx-16 HuCard"}],"cover":{"id":137257,"alpha_channel":true,"animated":false,"game":38078,"height":952,"image_id":"co2xwp","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2xwp.jpg","width":714,"checksum":"522bf180-2ea9-eec2-9d28-cdd9bbdd0871"},"first_release_date":640224000,"genres":[{"id":5,"name":"Shooter"},{"id":33,"name":"Arcade"}],"involved_companies":[{"id":124325,"company":{"id":2810,"name":"Bits Laboratory"},"created_at":1618462807,"developer":true,"game":38078,"porting":false,"publisher":false,"supporting":false,"updated_at":1618473818,"checksum":"a27b56e1-55ed-dc16-a7d3-7feb9a67f8fd"},{"id":124326,"company":{"id":14082,"name":"NEC Avenue"},"created_at":1618462807,"developer":false,"game":38078,"porting":false,"publisher":true,"supporting":false,"updated_at":1618473818,"checksum":"bab9fc42-37fb-5954-cd03-1c6e764cf419"},{"id":180733,"company":{"id":817,"name":"Taito"},"created_at":1658889434,"developer":false,"game":38078,"porting":false,"publisher":true,"supporting":false,"updated_at":1658890275,"checksum":"a0465955-8540-d556-c0e4-9ba9319e32dc"}],"name":"Darius Plus","screenshots":[{"id":431964,"alpha_channel":false,"animated":false,"game":38078,"height":225,"image_id":"sc99b0","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc99b0.jpg","width":256,"checksum":"fab2bb1c-af4d-fd9d-4088-2457c9017976"},{"id":431965,"alpha_channel":false,"animated":false,"game":38078,"height":225,"image_id":"sc99b1","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc99b1.jpg","width":256,"checksum":"ba188ea4-84ab-4647-be20-60a3a502677b"},{"id":431966,"alpha_channel":false,"animated":false,"game":38078,"height":225,"image_id":"sc99b2","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc99b2.jpg","width":256,"checksum":"353d86e9-e41a-4bb3-bea4-a4b4d979ca1b"},{"id":431967,"alpha_channel":false,"animated":false,"game":38078,"height":225,"image_id":"sc99b3","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc99b3.jpg","width":256,"checksum":"166d9e78-975b-3406-57eb-61064661cdc7"},{"id":431968,"alpha_channel":false,"animated":false,"game":38078,"height":225,"image_id":"sc99b4","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc99b4.jpg","width":256,"checksum":"3534dd9d-b099-16b5-8ca9-821e3066f190"}],"slug":"darius-plus","storyline":"Darius, Year 201. Invasion!\n\nThe vicious Belsar have attacked the peaceful Darius system, which now faces absolute devastation at their abominable hands! Darius' defense fighters proved no match for the overwhelming firepower of the alien forces, which wiped out their entire fleet in one fell swoop!\n\nWith nothing left to protect them, the people could only sit and wait for the icy embrace of death as the satellite bombardments continued unopposed. The scent of despair hung thickly in the air, all hope of survival having been quashed.\n\nBut then, from out of the darkness of the mourning clouds came a single bright light in the sky.\n\n\"Silverhawk.........\"\n\nLike a phoenix brought forth from the embers of a burning world, the bird shaped visage became a beacon of the planet's last fight for survival! Perhaps the end is not as nigh as it first appeared.","summary":"NOTE: \"Darius Plus\" is the TurboGrafx-16 PC-Engine port of the original Darius produced by Bits Laboratory and NEC Avenue. This is a different port than the title \"Darius+\", which was published by The Edge and developed by Softek for the Amiga, Atart ST, and ZX Spectrum.\n\nAmidst the clutter of arcade shooters in the late 1980s, companies needed to make their games stand out in some way. Simply flying a ship into outer space simply wasn't going to cut it anymore. Taito had an idea. Yes, there was still a spaceship. And yeah, that \"outer space\" part was still there too. But instead of the usual aliens, you fought fish.\n\nYes, fish.\n\nNot even regular, aquatic fish, but robotic fish with lasers equipped to their fins, giant metal teeth and missiles firing from their gills. And not just fish either. There are squid, snails, and other undersea variations out for your blood as well.\n\nThe requisite plot is about the people of the planet Darius, who are being terrorized by said intergalatic fish. Only the heroic pilots Proco Jr and Tiat Young can save the day. The constant star of the Darius series is the Silver Hawk. Much like Gradius, it has a primary, forward firing weapon, along with bombs that can be used to attack vertically, and the usual shield.\n\nThe arcade game Darius games also used a unique system that attached three monitors together to create one massive horizontal playing field (also used in Taito's Ninja Warriors.) Naturally, this couldn't quite be replicated on the console system, so that nifty little gimmick is lost, but emulators can still replicate the dimensions of the screen, even if you end up looking at a tiny picture.\n\nLooking to further set itself apart from the crowd, every Darius game has multiple levels, with several branching paths throughout the game. It adds tremendously to the replay value, especially since there are usual multiple endings, depending on which final zone you end up at.\n\nDarius is a two-dimensional horizontally scrolling shoot 'em up set in a fictional future. Uniquely among shoot 'em ups, the game's screen was three times wider than conventional size, and the arcade cabinet used an arrangement of three screens to accommodate it. The player controls an ornate fighter spacecraft, named the Silver Hawk, and must navigate through scrolling terrain while battling a variety of fighter craft, ground vehicles, turrets, and other obstacles throughout the game's stages (referred to as zones in the game). The ship's arsenal consists of forward-firing missiles, aerial bombs and a protective force field, all of which can be upgraded by power-ups (in the form of large, colored orbs) that are dropped by specially-colored enemies throughout the game's zones. When the player reaches the end of a zone, a boss appears, which must be defeated to proceed. Once the boss of a zone is destroyed, the player is given a choice of which zone to play next via a branching path. While there are 28 zones in total, only seven can be played in a single run.\n\nWhen various ports of it were made for different consoles, Taito (and others) were forced to shrink the playfield to fit on one screen.\n\nThe PC Engine saw three releases:\n- Darius Alpha (1990): A very rare beta release. This is one of the rarest Hu-Cards ever published. You could only get a copy of this hardcore shoot-em-up by buying Darius Plus and Super Darius and then mailing coupons to the publisher. 800 copies were made available, and names were drawn from those who mailed their info in. Some copies of the game were also given away as prizes by PC Engine Gekken and Marakatsu magazines.\n\n- Darius Plus (1990): The full game itself, again a PC Engine HuCard. The bosses that were removed in Alpha do not return here. Both Alpha and Plus were actually written for the PC Engine SuperGrafx and playing them on that console results in slightly improved graphics (less flicker and slowdown).\n\n- Super Darius (1990): A conversion of Darius for the PC Engine's Super CD-ROM, very close to the original arcade version other than being single-screen. Features new bosses, as well as a \"boss rush\" mode.","url":"https://www.igdb.com/games/darius-plus","videos":[{"id":47922,"game":38078,"name":"Gameplay Video","video_id":"DMfjdKKZjeA","checksum":"677e429a-b024-758b-f183-eafa9510c4e6"}]}