{"id":37675,"alternative_names":[{"id":76617,"name":"魔界八犬伝シャダ"}],"cover":{"id":190685,"alpha_channel":false,"animated":false,"game":37675,"height":805,"image_id":"co434t","url":"//images.igdb.com/igdb/image/upload/t_thumb/co434t.jpg","width":800,"checksum":"4746ca46-ff60-51a1-8dd9-679127ebe6ae"},"first_release_date":609984000,"genres":[{"id":12,"name":"Role-playing (RPG)"}],"involved_companies":[{"id":180576,"company":{"id":2678,"name":"Data East"},"created_at":1658843854,"developer":true,"game":37675,"porting":false,"publisher":true,"supporting":false,"updated_at":1658844933,"checksum":"f9ef3aee-a9da-20c9-d3f1-ef0d5961dec3"},{"id":180577,"company":{"id":23895,"name":"G-mode"},"created_at":1658843854,"developer":false,"game":37675,"porting":false,"publisher":true,"supporting":false,"updated_at":1658844933,"checksum":"3031d21d-2026-b516-37ea-03435bc9937d"}],"name":"Makai Hakkenden Shada","slug":"makai-hakkenden-shada","summary":"A PC Engine Action-RPG based on the famous Japanese novel series Nansou Satomi Hakkenden. The gameplay is at least partly inspired by Falcom's Ys series.\n\nMakai Hakkenden Shada is an action-RPG from Data East that was released on the PC Engine (the Japanese TurboGrafx-16) in 1989. The game bears more than a close resemblance to Falcom's Ys: specifically the first game in the series, The Vanished Omens, which was a huge success for the PC Engine a few months prior as well as being a generally well-regarded computer RPG before then. As well as having a similar nude female figure in the opening intro, the game also borrows Ys's combat system: fighting occurs by walking into enemies at a slight angle, causing them to collide with the player character's weapon (which hurts them) rather than the player character himself (which hurts the player character). The various gauges for health and experience are also similar.\n\nMakai Hakkenden Shada is based on a centuries-old Japanese novel series called Nansou Satomi Hakkenden, or \"Eight Dog Chronicles\", that features eight half-brother samurai who are all descended from the same dog and have the Japanese word for \"dog\" somewhere in their names. While these books have been referenced or adapted many times in other media such as manga and film, Makai Hakkenden Shada and the Famicom RPGs Satomi Hakkenden and Shin Satomi Hakkenden: Hikari to Yami no Tatakai are the only direct video game adaptations. Okami also contained an oblique reference to the novels.\n\nUnlike Satomi Hakkenden, which eventually allowed the player to recruit all eight of the central characters of the novel series, Makai Hakkenden Shada only has the one playable character. Instead, other characters from the novels occasionally appear to help the player.","url":"https://www.igdb.com/games/makai-hakkenden-shada"}