{"id":37598,"cover":{"id":24878,"game":37598,"height":945,"image_id":"oychapch4pxkilkzbc6s","url":"//images.igdb.com/igdb/image/upload/t_thumb/oychapch4pxkilkzbc6s.jpg","width":1060,"checksum":"f6b86709-78fa-ae5a-e17c-39d4de96e248"},"first_release_date":751248000,"genres":[{"id":5,"name":"Shooter"}],"involved_companies":[{"id":169261,"company":{"id":1831,"name":"Compile"},"created_at":1651115107,"developer":true,"game":37598,"porting":false,"publisher":false,"supporting":false,"updated_at":1651121800,"checksum":"8d76f1db-d04f-8830-818f-bcdffc4b9c74"},{"id":169262,"company":{"id":3702,"name":"Tonkin House"},"created_at":1651115107,"developer":false,"game":37598,"porting":false,"publisher":true,"supporting":false,"updated_at":1651121800,"checksum":"b8ab80c2-36d7-1bce-9e86-d7e0a4d5c3df"}],"name":"Sylphia","slug":"sylphia","summary":"Sylphia is a vertical shooter published by Tonkin House. The game draws from Greek mythology and tells the story of Sylphia, a female warrior with a tragic destiny. Her tale starts as she lays fatally wounded in the temple of Athena - merciless monsters have taken over the city and she perished as she desperately tried to protect innocent villagers. The gods, touched by the sincerity of the young woman's devotion and love, decide to give Sylphia another chance... Now turned into a Sylphid with tremendous powers, the female warrior embarks on a long journey of revenge, ready to fight for her homeland. Sylphia starts equipped with a fairly basic fire weapon that can be upgraded in various ways - four different types based on the four basic elements are available throughout the game, from Fire (Red), Air (Green), Water (Blue) and Earth (Brown). Each weapon type is associated with an additional sub-weapon which range from Homing Fireballs (Red), Reverse Fire (Blue), Ring Blades (Green) and Rotating Rocks (Brown). Sylphia can also trigger a devastative special attack that deals great damage to on-screen enemies - this power is obviously available in limited quantities and may only be be used in desperate situations. Various other items are available for the taking, such as extra lives, Mirrors/Gems (slowly increase a health bar located at the bottom of the screen that gives the player an extra life when full) and Green Orbs (increase the active weapon's power level). Sylphia consists of eight stages and is single player only.","url":"https://www.igdb.com/games/sylphia"}