{"id":843,"alternative_names":[{"id":84364,"name":"Rayman 2"},{"id":84382,"name":"Rayman 2 N64"},{"id":84383,"name":"Rayman 2 Nintendo 64"},{"id":94974,"name":"레이맨 2: 대탈출"}],"cover":{"id":212096,"alpha_channel":false,"animated":false,"game":843,"height":1056,"image_id":"co4jnk","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4jnk.jpg","width":794,"checksum":"0172e94e-a97c-5766-c759-91d1462cf366"},"first_release_date":940550400,"genres":[{"id":8,"name":"Platform"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":165022,"company":{"id":702,"name":"Ubisoft Montpellier"},"created_at":1646448920,"developer":true,"game":843,"porting":false,"publisher":false,"supporting":false,"updated_at":1646648518,"checksum":"3ecfedaa-5f21-d635-60f0-41cb336fee1e"}],"name":"Rayman 2: The Great Escape","screenshots":[{"id":40692,"game":843,"height":443,"image_id":"tfsd0jextrgamwam6uic","url":"//images.igdb.com/igdb/image/upload/t_thumb/tfsd0jextrgamwam6uic.jpg","width":710,"checksum":"10be0b28-4340-5e31-35dd-f7017d51c028"},{"id":40693,"game":843,"height":443,"image_id":"ubysryri3h4ve9gtlqde","url":"//images.igdb.com/igdb/image/upload/t_thumb/ubysryri3h4ve9gtlqde.jpg","width":710,"checksum":"8f78bf46-421d-6f0d-3c8f-3fb479fa0deb"},{"id":40694,"game":843,"height":443,"image_id":"rchshoav4tqwwhq6wxei","url":"//images.igdb.com/igdb/image/upload/t_thumb/rchshoav4tqwwhq6wxei.jpg","width":710,"checksum":"0b1c2839-e709-0718-9135-9e889e2344af"},{"id":40695,"game":843,"height":443,"image_id":"p5f6jjdumqgwkdczoqgv","url":"//images.igdb.com/igdb/image/upload/t_thumb/p5f6jjdumqgwkdczoqgv.jpg","width":710,"checksum":"2d9b4368-d597-e60d-6405-368239f2fa81"}],"slug":"rayman-2-the-great-escape","storyline":"Rayman 2 takes place in a world called the Glade of Dreams. An army of Robot Pirates, led by Admiral Razorbeard, invades this world and destroys the Heart of the World, the world core. This greatly weakens the resistance's power and disables Rayman's powers, leading to his capture.[9]\n\nGlobox, a friend of Rayman, is later also captured and put in the same cell as Rayman aboard the Pirates' prison ship. Globox gives Rayman a silver lum given to him by Ly the fairy, which restores his powers. Rayman escapes the prison ship, and is separated from Globox again. He learns that to stand a chance against the Pirates, he needs to find four ancient magic masks to awaken Polokus, the spirit of the world, hidden in secret and mysterious sanctuaries consisting of the four elements water/ice, earth/stone, fire, and air.[10] He travels through the Glade of Dreams via the Hall of Doors, a magical place linked to various locations in the world, controlled by the ancient Teensies.[10]\n\nIn the course of the game, Rayman frees Globox who had been captured again, and they continue together for a short while until Globox departs again to go find his family. Later, Rayman finds Globox's wife Uglette and learns that he has been imprisoned on the Prison Ship. Rayman also encounters his friend Clark, a strongman who has stomach problems due to eating rusty pirates; to continue through the level, Rayman has to cure Clark by means of an elixir.\n\nEventually, Rayman recovers the four masks and awakens Polokus, who makes quick work of the pirates on land. In the air however, he has no power, and Rayman is tasked to dispose of the Pirates' flying Prison Ship, where Admiral Razorbeard also has his headquarters. In a final battle Rayman fights Razorbeard, who is controlling a giant robot, the Grolgoth. Eventually Rayman destroys the robot and while Razorbeard escapes in a small escape pod, the Prison Ship explodes. Rayman is presumed dead and only one of his shoes is found, but during his funeral, he appears again, walking on a crutch.","summary":"With its enchanted storybook look beautifully translated into 3D, lush, vibrant colors, funny enemy designs, and clever jumping puzzles, Rayman 2 is platforming perfection. Michel Ancel's platformer shines the brightest on Dreamcast, but every version is a charm. No arms, no legs, no problem for the little French creation that could.","total_rating":85.3356393821196,"total_rating_count":158,"url":"https://www.igdb.com/games/rayman-2-the-great-escape","videos":[{"id":12933,"game":843,"name":"Gameplay video","video_id":"7AGhi-s2zD8","checksum":"3ede705f-559a-bbcb-88af-396b147a07b2"}]}