{"id":3341,"alternative_names":[{"id":333,"name":"Super Computer Animal Racing Simulator"},{"id":6078,"name":"SCARS"},{"id":17520,"name":"Super Computer Animal Racing Simulation"},{"id":42040,"name":"Super Computer Animal Racing Simulation"}],"cover":{"id":100377,"alpha_channel":false,"animated":false,"game":3341,"height":800,"image_id":"co25g9","url":"//images.igdb.com/igdb/image/upload/t_thumb/co25g9.jpg","width":600,"checksum":"d9adca86-0c01-9289-52f7-5acde3612bb8"},"first_release_date":912729600,"genres":[{"id":10,"name":"Racing"}],"involved_companies":[{"id":8734,"company":{"id":1750,"name":"Vivid Image"},"created_at":1388620800,"developer":true,"game":3341,"porting":false,"publisher":false,"supporting":false,"updated_at":1388707200,"checksum":"65e2b63c-cb3b-4fd9-b908-31ac0779697b"}],"name":"S.C.A.R.S.","screenshots":[{"id":109180,"game":3341,"height":768,"image_id":"ylvd7ltsevel3bpne0kr","url":"//images.igdb.com/igdb/image/upload/t_thumb/ylvd7ltsevel3bpne0kr.jpg","width":1024,"checksum":"8c491c3c-af90-5cff-eda3-512aab74a346"}],"slug":"s-c-a-r-s","summary":"In this game players take control of cars that take the shape of different animals. The game itself takes the role as a combat racing game as it features weapons to use against your opposition while racing, and the computers can do the same to you. The game has four modes: Grand Prix, Challenge and Time Attack. \n \nThe object of this game is to compete in the Grand Prix and to unlock new tracks and cars. The difficulty of each tournament is determined by which cup you choose to race for. The first cup you race for is the Carbon cup, and once you've beaten that you will unlock other cups that are based on elements like crystal, and diamond. Once you have won a tournament you will unlock a new cup to compete for, new levels to race in, and the chance to challenge other cars to gain access to them for use in Grand Prix races and vs mode. \n \nWhile Racing you can acquire weapons located around the tracks to help you finish the race quicker or to slow down your opponents so you can overtake them. The combat system is different from many games, except for having health and being destroyed for a limited amount of time, if you or an enemy is hit by a weapon you will be temporarily be slowed downed which gives your opponent time to overtake you. They're some weapons that can be avoided by using your cars jump jets; all cars have jump jets and can be used to avoid certain weapons, however not all weapons can be avoided even with the Jump Jets. \n \nThe weapons are: turbo boost, magnets, seeker-style missiles, a boomerang, time bombs, stingers, stoppers, rounds of bullets, and a shield.","total_rating":72,"total_rating_count":1,"url":"https://www.igdb.com/games/s-c-a-r-s","videos":[{"id":1833,"game":3341,"name":"Gameplay video","video_id":"8k-Zr6XQgzo","checksum":"b8e04b51-4eb4-3cc0-0c18-c7f4eafa67b1"}]}