{"id":144507,"alternative_names":[{"id":56341,"name":"007: TWINE"},{"id":77954,"name":"007: O Mundo Não é o Bastante"}],"collection":{"id":326,"created_at":1351020746,"games":[1630,1631,1632,1633,1636,1637,1638,1639,1640,1641,1642,1643,1644,1645,1646,1647,1648,1649,1650,1651,2371,11249,44099,52679,57293,72009,73053,110398,141114,143406,144507,146882,156069,156079,158962],"name":"James Bond","slug":"james-bond","updated_at":1668146735,"url":"https://www.igdb.com/collections/james-bond","checksum":"52c25fd8-9449-4ec8-1d7e-cb9eed885cc3"},"cover":{"id":154609,"alpha_channel":false,"animated":false,"game":144507,"height":800,"image_id":"co3bap","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3bap.jpg","width":600,"checksum":"c12be98b-6770-c548-4c39-3affd26098d5"},"first_release_date":971740800,"genres":[{"id":5,"name":"Shooter"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":121204,"company":{"id":425,"name":"Eurocom Entertainment Software"},"created_at":1615485601,"developer":true,"game":144507,"porting":false,"publisher":false,"supporting":false,"updated_at":1615817660,"checksum":"c9bd42eb-8a05-0404-b307-f0b981cc86b3"},{"id":121205,"company":{"id":25048,"name":"EA"},"created_at":1615485601,"developer":false,"game":144507,"porting":false,"publisher":true,"supporting":false,"updated_at":1615817660,"checksum":"46a37707-949f-719e-6401-5a5b8048b5c1"}],"name":"James Bond 007: The World Is Not Enough","screenshots":[{"id":425982,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94ou","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94ou.jpg","width":1920,"checksum":"9868ee23-e838-519d-7f7a-dc8a5780a363"},{"id":425983,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94ov","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94ov.jpg","width":1920,"checksum":"653f9ffe-4289-2be9-1705-748642fe40f5"},{"id":425984,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94ow","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94ow.jpg","width":1920,"checksum":"8b58a518-cfd0-a7c3-f332-ceff748a079b"},{"id":425985,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94ox","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94ox.jpg","width":1920,"checksum":"80e84620-64c0-402f-68b0-3921dbf4d341"},{"id":425986,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94oy","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94oy.jpg","width":1920,"checksum":"c3709233-f183-bb4e-a0a0-62bba909f0b0"},{"id":425987,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94oz","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94oz.jpg","width":1920,"checksum":"abfb6459-ab42-9dde-4976-bac7d341989b"},{"id":425988,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94p0","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94p0.jpg","width":1920,"checksum":"1a81539c-86f0-66ea-5151-0745eb8f7d27"},{"id":425989,"alpha_channel":false,"animated":false,"game":144507,"height":1080,"image_id":"sc94p1","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc94p1.jpg","width":1920,"checksum":"6e45ed34-cade-24bd-33c1-dfca386a8549"}],"slug":"james-bond-007-the-world-is-not-enough--1","storyline":"The game closely follows the plot of the film. MI6 agent James Bond is sent to Bilbao, Spain to meet a Swiss banker and retrieve money for Robert King, a friend of M who purchased a classified report from the Russian Atomic Energy Department. The report, which was taken from a dead MI6 agent, is believed to contain information about terrorists who have attacked King's oil pipeline in Kazakhstan. Bond asks the banker who killed the MI6 agent, but he is unexpectedly killed by an assassin. Bond escapes with the money and takes it to the MI6 headquarters in London. A terrorist group then launches an attack on the MI6 headquarters, prompting Bond to pursue the assassin through a London Underground station. Bond offers her protection, but she ultimately kills herself by exploding a hot air balloon. The MI6 traces the recovered money to a KGB agent-turned-terrorist known as Renard, who previously kidnapped King's daughter, Elektra. M assigns Bond to protect Elektra, who is about to oversee the construction of an oil pipeline in Azerbaijan.\n\nDuring a tour of the pipeline's proposed route in the mountains, Bond and Elektra are attacked by a hit squad in armed, paraglider-equipped snowmobiles. Bond suspects the attack was caused by Elektra's head of security, Davidov, and decides to kill him before taking his place on a flight to a Russian ICBM base in Kazakhstan. There, Bond meets nuclear physicist Christmas Jones and learns that Renard managed to steal plutonium from a nuclear warhead. To get a lead on where Renard might be hiding, Bond visits a former Russian mafia adversary, Valentin Zukovsky, who reveals that Elektra was in exchange for the use of a submarine currently being captained by his nephew. Jones realises that if Renard were to insert the stolen plutonium into the submarine's nuclear reactor, the resulting nuclear explosion would destroy Istanbul, sabotaging the Russians' oil pipeline in the Bosphorus. In Istanbul, Bond and Jones are captured by Elektra's henchmen. Jones is taken aboard the submarine, while Bond is taken to the Maiden's Tower. With the help of Zukovsky, Bond kills Elektra and boards the submarine. Ultimately, Bond finds Renard in the submarine's reactor and kills him before escaping with Jones.","summary":"The World Is Not Enough is a first-person shooter video game developed by Eurocom and based on the 1999 James Bond film of the same name. It was published by Electronic Arts and released for the Nintendo 64 on October 17, 2000, shortly before the release of its PlayStation counterpart. The game features a single-player campaign in which players assume the role of MI6 agent James Bond as he fights to stop a terrorist from triggering a nuclear meltdown in the waters of Istanbul. It includes a split-screen multiplayer mode where up to four players can compete in different types of deathmatch and objective-based games.\n\nThe game runs on an engine that was adapted to take advantage of the Nintendo 64 strengths. Although Eurocom used original production material to recreate the environments of the film, the company added elements to help the game design, including a mission which takes place in the London Underground. The game supports the Nintendo 64 Expansion Pak, which provides enhanced graphics and visual effects, but a Controller Pak is required to save the player's progress through the game.\n\nThe World Is Not Enough received generally positive reviews from critics and was frequently compared to Rare's Nintendo 64 first-person shooters GoldenEye 007 and Perfect Dark. It was also considered superior to its PlayStation counterpart because of its level design and inclusion of a multiplayer mode. Critics generally praised the game's graphics and smooth frame rate, but criticized its weak and inconsistent enemy artificial intelligence. In the United States, the game sold more than one million copies.","url":"https://www.igdb.com/games/james-bond-007-the-world-is-not-enough--1","videos":[{"id":46456,"game":144507,"name":"Trailer","video_id":"hSwyofrAZqY","checksum":"b31cd9f3-e038-e2f5-0bd8-0beb81c3a0a6"}]}