{"id":3071,"alternative_names":[{"id":89540,"name":"Comix Zone Classic"}],"cover":{"id":95649,"alpha_channel":true,"animated":false,"game":3071,"height":1000,"image_id":"co21sx","url":"//images.igdb.com/igdb/image/upload/t_thumb/co21sx.jpg","width":750,"checksum":"80279709-1f41-8992-12fc-376daa04c409"},"first_release_date":807235200,"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"},{"id":33,"name":"Arcade"}],"involved_companies":[{"id":7784,"company":{"id":112,"name":"Sega"},"created_at":1382227200,"developer":false,"game":3071,"porting":false,"publisher":true,"supporting":false,"updated_at":1382313600,"checksum":"a00de252-eb8a-326e-8439-f9bc7f1b5404"},{"id":7785,"company":{"id":1444,"name":"Sega Technical Institute"},"created_at":1382227200,"developer":true,"game":3071,"porting":false,"publisher":false,"supporting":false,"updated_at":1382313600,"checksum":"36b7e557-00c2-8be5-41f8-b254cb638277"},{"id":99603,"company":{"id":889,"name":"Virtucraft"},"created_at":1590105600,"developer":false,"game":3071,"porting":true,"publisher":false,"supporting":false,"updated_at":1590192000,"checksum":"09902cda-a7d9-2871-2622-49ace9057889"}],"name":"Comix Zone","screenshots":[{"id":113319,"game":3071,"height":370,"image_id":"pl6jkn2dpp7x3nopv3my","url":"//images.igdb.com/igdb/image/upload/t_thumb/pl6jkn2dpp7x3nopv3my.jpg","width":500,"checksum":"6c0f727b-f68e-eaf2-2653-27597c315822"},{"id":113320,"game":3071,"height":370,"image_id":"t4sjyva2gwt7uzaftvaj","url":"//images.igdb.com/igdb/image/upload/t_thumb/t4sjyva2gwt7uzaftvaj.jpg","width":500,"checksum":"dda4fbc1-8db0-b8c6-4dc6-e6c10ee415cd"},{"id":113321,"game":3071,"height":370,"image_id":"xscxlzwjyxn8wuj4d2gf","url":"//images.igdb.com/igdb/image/upload/t_thumb/xscxlzwjyxn8wuj4d2gf.jpg","width":500,"checksum":"496b9d30-c5cb-f810-8348-2f51861cf7f2"},{"id":113322,"game":3071,"height":370,"image_id":"yyzzcbgk8hg1vufsltud","url":"//images.igdb.com/igdb/image/upload/t_thumb/yyzzcbgk8hg1vufsltud.jpg","width":500,"checksum":"ed1c199e-74e4-978f-36cb-6df21995a989"},{"id":155279,"game":3071,"height":240,"image_id":"hvhcmftwg8ymu6qncrpy","url":"//images.igdb.com/igdb/image/upload/t_thumb/hvhcmftwg8ymu6qncrpy.jpg","width":320,"checksum":"6a980388-c93f-795d-7164-32a89eac6cd4"},{"id":155280,"game":3071,"height":240,"image_id":"btmgykr2dtdssjxyuu9h","url":"//images.igdb.com/igdb/image/upload/t_thumb/btmgykr2dtdssjxyuu9h.jpg","width":320,"checksum":"48ddbe06-4928-6188-c342-573f02c365a0"},{"id":155281,"game":3071,"height":240,"image_id":"ywgidrjcoqkaierni1pj","url":"//images.igdb.com/igdb/image/upload/t_thumb/ywgidrjcoqkaierni1pj.jpg","width":320,"checksum":"94304258-cc12-a73d-8f86-be583640ef88"},{"id":155282,"game":3071,"height":240,"image_id":"rcsqxb3nauevi7tjqifr","url":"//images.igdb.com/igdb/image/upload/t_thumb/rcsqxb3nauevi7tjqifr.jpg","width":320,"checksum":"106e5e6a-b95e-3371-22ab-52a7b7370752"},{"id":155283,"game":3071,"height":240,"image_id":"a5zi5jso739sg3tfhenh","url":"//images.igdb.com/igdb/image/upload/t_thumb/a5zi5jso739sg3tfhenh.jpg","width":320,"checksum":"2c4b2722-7d34-defe-edce-125ec55d0f75"},{"id":155284,"game":3071,"height":240,"image_id":"mbeylvot0jjwdjrtpfwq","url":"//images.igdb.com/igdb/image/upload/t_thumb/mbeylvot0jjwdjrtpfwq.jpg","width":320,"checksum":"b8fe9408-4cac-5cf4-8e3f-e9216ed9e4f4"}],"slug":"comix-zone","storyline":"Sketch Turner, a \"starving artist\" and freelance rock musician living in New York City, is working on his newest comic book, Comix Zone. It is the story of the New World Empire's attempt to defend Earth from an invasion of alien renegades, with inspiration coming from Sketch's oddly vivid dreams and nightmares. One night, while Sketch is working on Comix Zone during a thunderstorm, a lightning bolt strikes a panel of his comic. In this instant, its main villain, a powerful mutant named Mortus, escapes the comic book's pages, desiring to kill Sketch so he can become flesh and blood and take over the real world. Because he does not possess any power in reality, Mortus sends Sketch into the world of his own comic, freely drawing in enemies attempting to kill him.\n\nInside the comic book, Sketch meets General Alissa Cyan, who believes he is \"the chosen one\" who came to save their post-apocalyptic world from the evil of Mortus and the alien invaders. Ignoring Sketch's protests, Alissa sends him on his mission, keeping in touch with instructions and hints via radio. It is up to Sketch to stop Mortus's evil plans and find a way out of this comic world.\n\nThe game has two possible endings. At the end of the game, Alissa attempts to defuse a nuclear weapon that Mortus and the Mutants plan on using to wipe out the New World Empire and humanity, when Mortus comes back into the comic and throws her into the chamber, which starts to fill up with liquid. Mortus then battles Sketch personally. If the player defeats Mortus and the Kreeps he summons as he takes damage quickly enough to drain the liquid and save Alissa before the nuke self-destructs, an ending occurs where Alissa comes to the real world with Sketch and Roadkill and joins the army, eventually becoming Chief of Security for the United States. Roadkill is given a vast amount of mozzarella cheese, and spends a lot of time exploring the city's new sewer system when not sleeping under a pile of Sketch's dirty socks. Comix Zone becomes an instant sensation, selling out on the first day, making Sketch famous as it becomes the best-selling comic book ever.\n\nDefeating Mortus after the chamber fills with liquid, Alissa dies as the nuke self-destructs. Sketch and Roadkill come out, but Sketch's comic is destroyed, leaving him devastated at having saved the New World Empire, but failed to save Alissa.","summary":"Sketch Turner, a \"starving artist\" and freelance rock musician, is working on his newest comic book, named the \"Comix Zone.\" Comix Zone is the story of the New World Empire's attempt to defend Earth from an invasion of alien renegades, with inspiration coming from Sketch's (oddly vivid) dreams and nightmares. One night, while Sketch is working on Comix Zone during a thunderstorm, a lightning bolt strikes a panel of his comic. In this instant, the main villain of Comix Zone - a powerful mutant named Mortus - manages to escape the comic book's pages, desiring to kill Sketch so he can become flesh and blood and take over the real world. Because he does not possess any power in reality, Mortus sends Sketch into the world of his own comic, freely drawing in enemies to try and kill him.\n\nInside the comic book, Sketch meets General Alissa Cyan, who believes he is a superhero (\"the chosen one\") who came to save their post-apocalyptic world from the evil of Mortus and the alien invaders. Ignoring Sketch's protests, Alissa sends him on his mission, keeping in touch with instructions and hints via radio. It is up to Sketch to stop Mortus' evil plans and find a way out of this comic world before his own creations erase him for good.\n\nThe game has two possible endings. At the end of the game, Alissa attempts to defuse a Nuke, when Mortus comes into the comic and throws her into the chamber, which starts to fill up with liquid. Mortus then battles Sketch. If the player defeats Mortus and the Kreeps he summons quickly enough to drain the liquid and save Alissa, an ending occurs where Alissa comes to the real world with Sketch. Comix Zone is a huge success, being sold out on its first day, and Alissa joins the army, eventually becoming Chief of Security for the United States. Roadkill is given a vast amount of mozzarella cheese, and spends a lot of time exploring the city's new sewer system when not sleeping under a pile of Sketch's dirty socks.\n\nIf the player defeats Mortus after the chamber fills with liquid, Alissa dies. Sketch comes out, but his comic is destroyed. The last sentence in the cutscene says \"Will Sketch recreate his adventure for a happier ending?\"","total_rating":77.5705449635611,"total_rating_count":87,"url":"https://www.igdb.com/games/comix-zone","videos":[{"id":1626,"game":3071,"name":"Gameplay video","video_id":"TcTyoF8Adbk","checksum":"6ffbf214-0f88-9fa8-6ac8-bf589ff4e256"}]}