{"id":15739,"alternative_names":[{"id":98494,"name":"Lego Island: Xtreme Stunts"}],"cover":{"id":206655,"alpha_channel":false,"animated":false,"game":15739,"height":373,"image_id":"co4fgf","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4fgf.jpg","width":267,"checksum":"98702e4c-81bf-708d-55d2-3a15db49d1f2"},"first_release_date":1037577600,"genres":[{"id":14,"name":"Sport"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":29732,"company":{"id":1775,"name":"Silicon Dreams Studios"},"created_at":1451952000,"developer":true,"game":15739,"porting":false,"publisher":false,"supporting":false,"updated_at":1452038400,"checksum":"d7a1f27f-07c1-1670-b11f-5d5d5ce8d0e2"},{"id":29733,"company":{"id":2503,"name":"Lego Software"},"created_at":1451952000,"developer":false,"game":15739,"porting":false,"publisher":true,"supporting":false,"updated_at":1452038400,"checksum":"56bb6b49-e181-7a9e-cb6e-4a505a45277d"}],"name":"Island Xtreme Stunts","screenshots":[{"id":726472,"alpha_channel":false,"animated":false,"game":15739,"height":480,"image_id":"scfkjs","url":"//images.igdb.com/igdb/image/upload/t_thumb/scfkjs.jpg","width":640,"checksum":"b64a5735-47a5-45a3-f4e2-be126960d12c"}],"slug":"island-xtreme-stunts","storyline":"Pepper Roni has been cast as the lead in an action movie being filmed on Lego Island (appropriately titled \"Xtreme Stunts\") and the Brickster (who had somehow made it back to Lego Island) has been released from jail after he claimed to have reformed and is now playing a part of the film. After performing a motorbike jump through a large poster as a publicity stunt, he is then taken to the first scene where he performs a high-speed freeway car chase after the Brickster, who has been ironically cast as the main villain of the film. Upon completion, Pepper is given free roam of Lego Island, allowing him to explore and complete side missions as he continues the film in other locations throughout the island. As the player makes more progress in missions, it becomes more and more apparent that the Brickster has plans of his own, and later he kidnaps the Infomaniac and reveals his tower that his Brickster-Bots have built and has made a supercomputer that will disassemble the entire world. Pepper naturally comes to the rescue while the host tries to shut down the supercomputer. He once again outwits and imprisons the Brickster while the supercomputer was instead reprogrammed to disassemble the tower, allowing the film to be completed and released on schedule (which the player is able to view upon completion of the game). In the end Pepper has access to all areas of the island, allowing him to redo scenes of the movie and different tasks.\n\nThe game also gives a bit more canon (e.g. explaining why the Legondos broke up).","summary":"Island Xtreme Stunts is a mixture of different genres in a single game. The player explores a LEGO-based environment in an open world format: ride a skateboard, drive, fly and pilot a range of vehicles all whilst performing stunts and tricks while taking on the bad guy, Brickster. The player is cast as Pepper Roni, a lead stuntman in a big movie production set on LEGO Island.\n\nEven though the player is free to go wherever he wants, there is a story behind the game divided over 25 missions. All the missions are stunt-based. Running around the world in 3rd-person view, the controls are pretty basic and do not offer the trick combinations of other stunt/trick-based games. It is easy to pick up and play, even for the younger players, without worrying too much about what button combination will do what trick. Instead the player can focus on the missions by only having to complete basic tricks with a few button presses.","url":"https://www.igdb.com/games/island-xtreme-stunts"}