{"id":4183,"cover":{"id":79112,"alpha_channel":false,"animated":false,"game":4183,"height":1887,"image_id":"co1p1k","url":"//images.igdb.com/igdb/image/upload/t_thumb/co1p1k.jpg","width":1415,"checksum":"fab505dd-d482-b8bc-0332-e51cf841e8bf"},"first_release_date":1056067200,"franchise":{"id":244,"name":"Starsky & Hutch"},"genres":[{"id":10,"name":"Racing"}],"involved_companies":[{"id":10862,"company":{"id":340,"name":"Empire Interactive"},"created_at":1390608000,"developer":false,"game":4183,"porting":false,"publisher":true,"supporting":false,"updated_at":1390608000,"checksum":"d329c133-fdd8-9ffb-b74b-1b749835cd40"},{"id":10863,"company":{"id":1691,"name":"Mind's Eye"},"created_at":1390608000,"developer":true,"game":4183,"porting":false,"publisher":false,"supporting":false,"updated_at":1390608000,"checksum":"ac00d81b-88b7-0fa4-53d1-19bdc3773ede"}],"name":"Starsky & Hutch","slug":"starsky-hutch","summary":"Starsky & Hutch is an arcade racing game based on the popular TV series from the 70s, released to tie in with the film. The game includes 18 missions, each based on an episode of the TV show and introduced by Antonio 'Huggy Bear' Fargas. There is also a free roaming mode, in which the player explores the GTA-esque environment looking for action and trouble. \n \nLike the film, the game does not entirely play it straight. Starsky & Hutch are actually shooting a TV show, and the scoring for each mission reflects how ratings-friendly your driving is. You are awarded gold, silver or bronze medals for each mission depending on performance, and must get at least 1 gold and 2 silvers on season 1 for a second season to be commissioned, and 3 golds and 2 silvers in season 2 for there to be a third for you to play through. \n \nThe overall goal in each mission is usually to chase and destroy a criminal's car. There is always a secondary target as well. In addition, the player will gain viewers by hitting the bad guy, pulling off elaborate jumps and skids, nearly hitting civilians, and hitting the bonus targets such as canisters which are strewn through the levels. Hitting civilians will lose viewers.","total_rating":65.47280714631995,"total_rating_count":7,"url":"https://www.igdb.com/games/starsky-hutch"}