{"id":77336,"alternative_names":[{"id":39006,"name":"The Legend of Zelda: A Link to the Past and Four Swords"},{"id":39007,"name":"Zelda: Link to the Past + 4 Swords"},{"id":71665,"name":"Zelda no Densetsu: Kamigami no Triforce & Yottsu no Tsurugi"},{"id":71666,"name":"ゼルダの伝説 神々のトライフォース&4つの剣"}],"cover":{"id":170801,"alpha_channel":false,"animated":false,"game":77336,"height":800,"image_id":"co3nsh","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3nsh.jpg","width":600,"checksum":"552ede9a-ce76-10bd-5a7e-07e9291b5b4f"},"first_release_date":1038787200,"genres":[{"id":12,"name":"Role-playing (RPG)"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":184341,"company":{"id":70,"name":"Nintendo"},"created_at":1661300138,"developer":false,"game":77336,"porting":false,"publisher":true,"supporting":false,"updated_at":1661302138,"checksum":"77196d7a-c9a5-57ed-6ed5-c18f000778fa"},{"id":184342,"company":{"id":1246,"name":"Nintendo EAD Group No. 2"},"created_at":1661300138,"developer":false,"game":77336,"porting":false,"publisher":false,"supporting":true,"updated_at":1661302138,"checksum":"62fd0a27-103f-9255-c70e-54bc36418a03"},{"id":184343,"company":{"id":37,"name":"Capcom"},"created_at":1661300138,"developer":true,"game":77336,"porting":false,"publisher":false,"supporting":false,"updated_at":1661302138,"checksum":"4d545803-c9ff-effd-93a9-6aaa5a4f079c"}],"name":"The Legend of Zelda: A Link to the Past & Four Swords","screenshots":[{"id":396202,"alpha_channel":false,"animated":false,"game":77336,"height":640,"image_id":"sc8hpm","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8hpm.jpg","width":960,"checksum":"32200770-199e-7d57-4a3c-283f89726c4d"},{"id":396203,"alpha_channel":false,"animated":false,"game":77336,"height":160,"image_id":"sc8hpn","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8hpn.jpg","width":240,"checksum":"e6fdced8-c61b-1b4b-e007-323999272eb7"},{"id":396204,"alpha_channel":false,"animated":false,"game":77336,"height":220,"image_id":"sc8hpo","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8hpo.jpg","width":300,"checksum":"9fad9f9f-2ed8-1ca3-841e-1cc795efb8e9"},{"id":396205,"alpha_channel":false,"animated":false,"game":77336,"height":640,"image_id":"sc8hpp","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8hpp.jpg","width":960,"checksum":"0516a1ac-c06d-50ab-a3a9-a516e7fe4653"},{"id":396206,"alpha_channel":false,"animated":false,"game":77336,"height":262,"image_id":"sc8hpq","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8hpq.jpg","width":300,"checksum":"24ac8c8f-de39-9972-a7fb-8598957e4a33"},{"id":396207,"alpha_channel":false,"animated":false,"game":77336,"height":333,"image_id":"sc8hpr","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8hpr.jpg","width":500,"checksum":"d8d506b8-d2fc-f3ce-57ad-82692589b3e4"},{"id":396208,"alpha_channel":false,"animated":false,"game":77336,"height":500,"image_id":"sc8hps","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8hps.jpg","width":900,"checksum":"b6221f49-f502-a24b-6a7f-6a7403010eeb"}],"slug":"the-legend-of-zelda-a-link-to-the-past-and-four-swords","storyline":"In A Link to the Past\nThe intro to A Link to the Past reveals the back story of the game, showing that series antagonist Ganon was sealed away after his bid for the Triforce. However, the seal has grown weak, and a wizard named Agahnim has taken over the throne of Hyrule, and is kidnapping the seven descendants of the Sages who sealed away Ganon, which includes Princess Zelda. The game opens with series protagonist Link receiving a message from Zelda, telling him to come save her. Following his Uncle, he finds him near death, and is tasked by his Uncle to find and rescue Zelda, giving him his sword and shield before dying. After Link reaches the dungeons, he frees Zelda from her cage, and takes her through a hidden sewer into a Sanctuary, where she remains hidden. The man in the Sanctuary tells Link of Agahnim's plan to break the seal the Sages placed, requiring Link to obtain the Master Sword. Link travels across Hyrule, aided by a man named Sahasrahla, collecting three pendants from the three dungeons, using them to unseal the Master Sword in the Lost Woods. Link returns to Hyrule Castle with the Master Sword after Zelda is kidnapped. When he meets Agahnim, he finds that he is too late, as Agahnim teleports her away.\n\nAfter battling and defeating Agahnim, he takes Link into the Sacred Realm, which has been corrupted and transformed into the Dark World by Ganon. He is tasked with rescuing the seven Maidens who have been sealed away in crystals, as well as finding magical items called the Silver Arrows. Link eventually rescues Zelda, and uses the Maidens' power to break into Ganon's Tower. After fighting and defeating Agahnim for the second time, Ganon flies from Agahnim's corpse into the Pyramid of Power. Link follows, doing battle with him. He eventually defeats Ganon, and finds the Triforce. After the Triforce speaks to Link, Link uses it to wish for Hyrule to return to normal. Afterward, he returns the Master Sword to where he found it. If the player has completed Four Swords, they may find an alternate ending by beating a secret dungeon. This dungeon features four Dark Links, in reference to the four Links in the Four Swords game. After defeating them, an ending showing the inhabitants of the Dark World and the various bosses is shown.\n\nIn Four Swords\nTaking place before the events of Ocarina of Time, the prologue shows Link and Zelda approaching a sword in a pedestal, called the Four Sword. After Zelda explains its history and the creature sealed within it, the creature named Vaati breaks free, capturing Zelda to marry her. Link is encountered by three fairies who instruct Link to pull the Four Sword out. Link pulls the Four Sword out, inadvertently creating three copies of himself that fight alongside him. As the game begins, the four Links are tasked with finding four Great Fairies, who together will grant them access to Vaati's palace. After finding the four Great Fairies and entering the palace the Links battle Vaati. After Vaati is thoroughly weakened, he is trapped in the Four Sword. Zelda and Link return the Four Sword back in its pedestal.","summary":"Now you have a link to one of the greatest adventures in The Legend of Zelda series. The Legend of Zelda: A Link to the Past revives the classic SNES game on the Game Boy Advance and adds a new multiplayer mode. In a Link to the Past, Link travels between the light world and the dark world, conquering fierce monsters and uncovering Hyrule's deepest secrets along the way. Also included is Four Swords, which lets you play with up to three other players, slashing through dungeons and collecting rupees. Whether you choose solo or competitive play, The Legend of Zelda will keep you occupied with its brain-bending puzzles and fun swashbuckling action.","total_rating":93.04900175869085,"total_rating_count":17,"url":"https://www.igdb.com/games/the-legend-of-zelda-a-link-to-the-past-and-four-swords","videos":[{"id":39533,"game":77336,"name":"Trailer","video_id":"SbSaka9DGFw","checksum":"d488b767-a462-c2a4-f893-2286f1394b9c"},{"id":39534,"game":77336,"name":"Gameplay Video","video_id":"vBUv85g3o84","checksum":"56b52c66-137d-ac4c-1319-45f3aeea6b15"},{"id":39535,"game":77336,"name":"Gameplay Video","video_id":"44F5vWWk0kE","checksum":"ab8276b0-3da0-e412-2669-fa28ee52f891"}]}