{"id":1035,"alternative_names":[{"id":71668,"name":"Zelda no Densetsu: Fushigi no Bōshi"},{"id":71669,"name":"ゼルダの伝説 ふしぎのぼうし"}],"cover":{"id":170804,"alpha_channel":false,"animated":false,"game":1035,"height":800,"image_id":"co3nsk","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3nsk.jpg","width":600,"checksum":"518735c5-5a97-81bd-385f-1595d81803aa"},"first_release_date":1099526400,"genres":[{"id":12,"name":"Role-playing (RPG)"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":167543,"company":{"id":70,"name":"Nintendo"},"created_at":1649683319,"developer":true,"game":1035,"porting":false,"publisher":true,"supporting":false,"updated_at":1649683393,"checksum":"481776ed-65dc-a6d9-c500-1060d894dd8a"},{"id":167544,"company":{"id":37,"name":"Capcom"},"created_at":1649683319,"developer":true,"game":1035,"porting":false,"publisher":false,"supporting":false,"updated_at":1649683393,"checksum":"31c783ae-640c-7097-86f0-a5dfec95efe9"},{"id":171305,"company":{"id":41283,"name":"Flagship"},"created_at":1652629953,"developer":true,"game":1035,"porting":false,"publisher":false,"supporting":false,"updated_at":1652667717,"checksum":"a588a651-fa59-ef9e-e9bb-30ad5b77527c"}],"name":"The Legend of Zelda: The Minish Cap","screenshots":[{"id":118763,"game":1035,"height":319,"image_id":"wximjt3wxeenu6zvy01u","url":"//images.igdb.com/igdb/image/upload/t_thumb/wximjt3wxeenu6zvy01u.jpg","width":479,"checksum":"f5f3064d-c297-6284-612d-bad7020fe67d"},{"id":118765,"game":1035,"height":319,"image_id":"mtnzk1jgzt2c5szhlhg0","url":"//images.igdb.com/igdb/image/upload/t_thumb/mtnzk1jgzt2c5szhlhg0.jpg","width":480,"checksum":"9267bf8b-5009-6f8e-35c3-623b8ab593a1"},{"id":118766,"game":1035,"height":318,"image_id":"kotltnj3n1cao6fsntf1","url":"//images.igdb.com/igdb/image/upload/t_thumb/kotltnj3n1cao6fsntf1.jpg","width":479,"checksum":"12f39468-5400-2103-4baa-376cf6febc13"},{"id":176343,"game":1035,"height":160,"image_id":"p8xoi64fixyy0xyviz9o","url":"//images.igdb.com/igdb/image/upload/t_thumb/p8xoi64fixyy0xyviz9o.jpg","width":240,"checksum":"9519ea5d-f69d-b06c-a90e-7c8a7b0e084d"},{"id":176344,"game":1035,"height":160,"image_id":"kmhexy6lfqjdzaer5f2d","url":"//images.igdb.com/igdb/image/upload/t_thumb/kmhexy6lfqjdzaer5f2d.jpg","width":240,"checksum":"381ee5c4-7920-ae29-b944-60cda853b27e"},{"id":176345,"game":1035,"height":160,"image_id":"qeumtencqatxe9zq2icf","url":"//images.igdb.com/igdb/image/upload/t_thumb/qeumtencqatxe9zq2icf.jpg","width":240,"checksum":"17a1de7e-a2e4-8df3-a70e-e3ad73a6dbb0"},{"id":176346,"game":1035,"height":160,"image_id":"b5hhixmlvoyt6djvwac2","url":"//images.igdb.com/igdb/image/upload/t_thumb/b5hhixmlvoyt6djvwac2.jpg","width":240,"checksum":"bb778332-1ee0-d17b-6a6b-21e98969c993"},{"id":176347,"game":1035,"height":160,"image_id":"ibtonrsxabw1jieipt2n","url":"//images.igdb.com/igdb/image/upload/t_thumb/ibtonrsxabw1jieipt2n.jpg","width":240,"checksum":"38e542ec-5bdb-cf72-7f7d-b863cd2b71a6"},{"id":176348,"game":1035,"height":160,"image_id":"pp9r7v7kse2oznergths","url":"//images.igdb.com/igdb/image/upload/t_thumb/pp9r7v7kse2oznergths.jpg","width":240,"checksum":"e218bcb4-10e8-6d27-b6c5-4c1fdf57074c"},{"id":176349,"game":1035,"height":160,"image_id":"ndvtdzhhxi7pg4ccaiab","url":"//images.igdb.com/igdb/image/upload/t_thumb/ndvtdzhhxi7pg4ccaiab.jpg","width":240,"checksum":"02284ff4-cdf2-152b-1c47-f0c5fdbbecdd"},{"id":176350,"game":1035,"height":160,"image_id":"g6cojraizqlsmuh3vbrm","url":"//images.igdb.com/igdb/image/upload/t_thumb/g6cojraizqlsmuh3vbrm.jpg","width":240,"checksum":"ea5e847a-ee92-012f-316f-50db3c670c23"}],"slug":"the-legend-of-zelda-the-minish-cap","storyline":"One year, in celebration of when the Picori last came to Hyrule 100 years ago to the day, the festival was unusually grand. Hyrule Castle was hosting a tournament of sword-fighting skill that calls to mind the heroes of legend. That year’s champion was a mysterious man by the name of Vaati. He won the tournament with an almost magical ease, and all of Hyrule was abuzz with rumors about this shadowy figure. The young Link, who attends the festival that year with his childhood friend, Princess Zelda, is charged by his grandfather, Smith, with delivering the sword that will be presented to the champion.\n\nDuring the ceremony following the sword competition, Vaati shatters the sacred Picori Blade and opens the Bound Chest, which, for an age, had been sealed by the Picori Blade, trapping evil monsters within. Vaati is after the Light Force, the golden light that was once wielded by the Hero of Men mentioned in the legends of the Picori. He subdues the castle guards and turns Princess Zelda to stone before departing. Vaati was once a Minish, an apprentice of the Minish sage Ezlo. Ezlo had made a magical Cap with the power to grant wishes, but Vaati had stolen it and used it to become a powerful sorcerer. He had transformed Ezlo into a hat himself, then proceeded to hunt down the Light Force. Link is asked by King Daltus to seek out the Picori and ask them to reforge the sacred blade, and he travels to the Minish Woods with the help of his Map.\n\nThere he meets Ezlo, a curious creature whom he rescues from a group of Red Octoroks. Ezlo hops onto his head and offers to help him find the Picori. He also helps Link shrink down to a minuscule size — the size of the Picori people, who call themselves the Minish. Link meets with Gentari, the elder of the Minish Village, who tells him that in order to reforge the sacred Picori Blade, he will need the Four Elements, the embodiment of the sacred powers of earth, fire, water, and wind. Vaati had learned from the legend of the Wind Tribe that when the Four Elements were collected, the path to the Light Force will open. Knowing that Link is collecting them, Vaati decides to wait until the task is complete.\n\nOnce Link has gathered the Four Elements, he brings the Picori Blade — renamed the White Sword by Melari, a Minish sword-smith — to the Elemental Sanctuary hidden within the courtyard of Hyrule Castle. There he infuses the White Sword with the Four Elements, fully restoring the sacred Four Sword — a legendary blade with the power to split one warrior into four. Link then gains access to a chamber with stained glass, where the location of the Light Force is revealed to be within Princess Zelda.\n\nMeanwhile, Vaati has brainwashed King Daltus and shrouded Hyrule Castle in darkness. He discovers from the stained glass of the chamber inside the Elemental Sanctuary that the sacred Light Force had actually been passed down through Hyrule’s princesses, and so he prepares to extract it from Princess Zelda. Link rushes to her rescue, and, after vanquishing Vaati, uses the Four Sword’s evil-banishing power to restore Princess Zelda.\n\nWith Vaati defeated, the Mage's Cap could be used to restore Hyrule. Princess Zelda puts on the cap and wishes with all her heart that Vaati’s cruelty might be undone. With her righteous wish and the power of the Light Force that still dwelt within her, many miracles happen as a result.\n\nNow that the land of the humans had been saved, Ezlo ventures back into the world of the Minish through the Minish Door, not to return until perhaps the next time, one hundred years later, when the doorway to their world would open once more.","summary":"When the sorcerer Vaati turns Princess Zelda to stone, the king of Hyrule sends Link on a quest to free Zelda from her curse. With the help of Ezlo, a Minish also cursed by Vaati, Link must travel through a fantastical world rife with new items, puzzles, and bosses. As Link, you can shrink down to battle large enemies from within, find or unlock secret items and solve puzzles by fusing together magic relics.","total_rating":87.12738621832925,"total_rating_count":287,"url":"https://www.igdb.com/games/the-legend-of-zelda-the-minish-cap","videos":[{"id":15521,"game":1035,"name":"Trailer","video_id":"cSIDghMWVMA","checksum":"db85b5c6-2220-71eb-f153-ed1b6085b5bb"}]}