{"id":49212,"alternative_names":[{"id":78007,"name":"Yoshi's Universal Gravitron"}],"cover":{"id":196429,"alpha_channel":false,"animated":false,"game":49212,"height":800,"image_id":"co47kd","url":"//images.igdb.com/igdb/image/upload/t_thumb/co47kd.jpg","width":600,"checksum":"85055f23-fa48-f279-9262-7cb87c159e90"},"first_release_date":1082592000,"genres":[{"id":8,"name":"Platform"}],"involved_companies":[{"id":78625,"company":{"id":70,"name":"Nintendo"},"created_at":1557014400,"developer":false,"game":49212,"porting":false,"publisher":true,"supporting":false,"updated_at":1557100800,"checksum":"4bb4726e-9a36-14bd-419d-9c2857553d67"}],"name":"Yoshi Topsy-Turvy","slug":"yoshi-topsy-turvy","summary":"In Yoshi Topsy-Turvy, Yoshi Island has been turned into a picture book. Yoshi will not stand for this outlandish attempt at flattening his world, and he heads off on an adventure to return things back to their original state. To help in on his quest, a group of spirits who like to surprise people give Yoshi the ability to rotate the world to his liking. The big catch with Yoshi Topsy-Turvy is its use of a motion sensor, similar to the one set to be featured in the second Wario Ware GBA game. The game cartridge includes a built in motion sensor which detects how you move the GBA system. By turning the system, you make the world rotate. A meter on the upper right corner of the screen shows which way the system is being held at any time. Rotate the system to help Yoshi stay on the path and make it past perils and through the varied stages.\nGo full tilt! By tilting your Game Boy Advance, you'll tilt the environment around Yoshi, knocking over enemies, swinging pendulums, and letting Yoshi run up walls and leap huge pits! Will this ending be happy? All of Yoshi's Island is trapped in a storybook, and only by meeting the challenges of each chapter will you succeed. Collect coins, defeat enemies, or race for the finish to satisfy each course's conditions","total_rating":60.0270803052094,"total_rating_count":7,"url":"https://www.igdb.com/games/yoshi-topsy-turvy"}