{"id":5434,"cover":{"id":118582,"alpha_channel":false,"animated":false,"game":5434,"height":800,"image_id":"co2jhy","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2jhy.jpg","width":600,"checksum":"68bd74dd-fcc4-a1e8-bf9b-8bf812fe0b29"},"first_release_date":631065600,"genres":[{"id":8,"name":"Platform"}],"involved_companies":[{"id":13176,"company":{"id":764,"name":"Psygnosis"},"created_at":1392854400,"developer":false,"game":5434,"porting":false,"publisher":true,"supporting":false,"updated_at":1392854400,"checksum":"9a5a6a97-b07b-9929-afca-6df87cc25c93"},{"id":13177,"company":{"id":650,"name":"Reflections Interactive"},"created_at":1392854400,"developer":true,"game":5434,"porting":false,"publisher":false,"supporting":false,"updated_at":1392854400,"checksum":"907167fe-b3b6-5c0f-6cad-7e515fdc0a99"},{"id":13178,"company":{"id":111,"name":"The Creative Assembly"},"created_at":1392854400,"developer":true,"game":5434,"porting":false,"publisher":false,"supporting":false,"updated_at":1392854400,"checksum":"7474a449-14d0-4b35-bd62-2e3f0bdc872d"}],"name":"Shadow of the Beast","screenshots":[{"id":12885,"game":5434,"height":256,"image_id":"z6oucpuiascrkvdorfqq","url":"//images.igdb.com/igdb/image/upload/t_thumb/z6oucpuiascrkvdorfqq.jpg","width":320,"checksum":"69fe3295-902b-e01d-291f-8d54353e2317"},{"id":12886,"game":5434,"height":256,"image_id":"arak1jmb6dgsqrbvts2e","url":"//images.igdb.com/igdb/image/upload/t_thumb/arak1jmb6dgsqrbvts2e.jpg","width":320,"checksum":"7108936b-5648-dd99-5e2b-7c67e329502e"}],"slug":"shadow-of-the-beast","summary":"A game that takes your computer into a totally new dimension.\n\nShadow of the Beast is the most stunning 16-bit game you've ever played- a game that pushes your computer's features further than you ever thought they could go. Shadow of the Beast boasts the most incredible high-speed parallax scrolling ever seen. It will confront you with 132 different and vicious monsters, all as arcade quality fully animated sprites. You will be dazzled by the 128 colors appearing simultaneously on screen and rocked by the 900K of atmospheric soundtrack. And you'll be completely hooked by Shadow of the Beast's 350 screens of fast and furious action. So prepare for an experience you will never forget.\n\nKidnapped as a child by the evil Beast Mages, you have been transformed into a creature of fearsome power, agility and strength. In this guise you faithfully serve the Beast and its cohorts for many years as their warrior-messenger. Until one day you discover an awful secret- the truth about your past... a truth that drives you wild with anger and leads you on a trail of bloody revenge against your masters. Now the time has come to enter the Shadow of the Beast!\n\nYour task is to fight your way through hostile country to the heart of the enemy's stronghold, where you will face your ultimate adversary. Along the way you will encounter an awesome array of monsters and traps. Be ruthless, be quick... for only the strongest and toughest can hope to survive.\n\nPrepare to live by your wits, relying on split-second reactions and ingenuity. Combat the diabolical creatures. Dodge the deadly plant life. Overcome the devious traps. Find and use the long-lost artifacts. Feel the adrenalin pumping through your joystick hand as the blood pounds in your heart and the tension becomes almost unbearable...\n\nPrepare to enter Shadow of the Beast.","total_rating":67.36261846055541,"total_rating_count":21,"url":"https://www.igdb.com/games/shadow-of-the-beast"}