{"id":3875,"cover":{"id":121204,"alpha_channel":false,"animated":false,"game":3875,"height":800,"image_id":"co2lis","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2lis.jpg","width":600,"checksum":"a1148eac-5828-b0fe-3b28-75c7803b4725"},"first_release_date":1095638400,"genres":[{"id":4,"name":"Fighting"},{"id":14,"name":"Sport"}],"involved_companies":[{"id":10069,"company":{"id":1,"name":"Electronic Arts"},"created_at":1390089600,"developer":false,"game":3875,"porting":false,"publisher":true,"supporting":false,"updated_at":1390089600,"checksum":"67f70680-dc61-9ee2-4df9-047eb663e245"},{"id":10070,"company":{"id":1408,"name":"AKI Corporation"},"created_at":1390089600,"developer":true,"game":3875,"porting":false,"publisher":false,"supporting":false,"updated_at":1390089600,"checksum":"6c0bb5c0-da20-1946-9e25-a4117b1dc408"},{"id":10071,"company":{"id":277,"name":"EA Canada"},"created_at":1390089600,"developer":true,"game":3875,"porting":false,"publisher":false,"supporting":false,"updated_at":1390089600,"checksum":"3ed5a995-a7ff-c339-57e4-3185ce5ea929"}],"name":"Def Jam: Fight for NY","screenshots":[{"id":32804,"game":3875,"height":480,"image_id":"nsxeemb8ahgf9sqvj3ex","url":"//images.igdb.com/igdb/image/upload/t_thumb/nsxeemb8ahgf9sqvj3ex.jpg","width":640,"checksum":"1536a9ef-aefa-5f48-1f0f-2ff57f0eb71b"},{"id":32805,"game":3875,"height":488,"image_id":"clmatpbcohkbu3uay4gy","url":"//images.igdb.com/igdb/image/upload/t_thumb/clmatpbcohkbu3uay4gy.jpg","width":650,"checksum":"3c56be7d-b243-bdc5-af73-d471a30315ea"},{"id":322266,"alpha_channel":false,"animated":false,"game":3875,"height":347,"image_id":"sc6wnu","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc6wnu.jpg","width":616,"checksum":"054dfceb-db3f-da45-7da3-14e723a1d5cb"}],"slug":"def-jam-fight-for-ny","summary":"The ultimate hip-hop fueled fighting game, Def Jam Fight For NY challenges players to step into the shoes of a ruthless street fighter battling for control of the hip-hop underground.\n\nThe game features an all-new fighting engine including weapons, interactive environments and five unique fighting styles that can be combined to form dozens of customized hybrid styles for the ultimate edge on the streets.\n\nDef Jam Fight For NY features more than 40 of the most well-known artists and personalities in hip-hop today, including Busta Rhymes, Carmen Electra, Lil' Kim, Ludacris, Method Man, Redman, Sean Paul, Slick Rick, Snoop Dogg, and many more.\n* New Fighting Engine -- A new fighting engine challenges you to master multiple fighting disciplines, take advantage of interactive environments, and utilize dozens of weapons to make a name for yourself. \n\n* Three Times the Length of the Original Def Jam VENDETTA -- It's going to take more than 90 fights in 20-plus venues to win control of the streets. \n\n* 40 of the Biggest Hip Hop Artists and Celebrites -- Starring and music by the hottest names in hip hop from Def Jam and beyond -- look for appearances by Busta Rhymes, Carmen Electra, Fat Joe, Flava Flav, Freeway, Ghostface, Ice T, Joe Budden, Kimora Lee Simmons, Lil' Kim, Ludacris, Method Man, Redman, Sean Paul, Slick Rick, Snoop Dogg, Xzibit, and many more. \n\n* Five Brutal Fighting Styles -- Master each fighting style: street fighting, kickboxing, martial arts, wrestling, and submission fighting. Combine up to three styles to create devastating hybrid-styles, complete with new \"blazin' moves\" to finish off your opponent. \n\n* 22 Interactive Venues -- From destructible environmental objects to rowdy spectators who like to \"get involved,\" the 22 venues are the ultimate weapon. \n\n* Create-A-Street Fighter -- Build your own street-ready fighter and outfit him with thousands of pieces of unlockable licensed gear, tattoos, and even bling from the Jeweler to the stars, Jacob the Jeweler. \n\n* Represent Your Crew Online -- Join a crew and own the mean streets of NYC. Move onto the international stage and take on all-comers with online play for the PlayStation 2.","total_rating":77.7309209402406,"total_rating_count":48,"url":"https://www.igdb.com/games/def-jam-fight-for-ny"}