{"id":3878,"alternative_names":[{"id":1349,"name":"Digimon World X"}],"cover":{"id":111418,"alpha_channel":true,"animated":false,"game":3878,"height":800,"image_id":"co2dyy","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2dyy.jpg","width":600,"checksum":"ae96c6fc-82cb-3761-dbbc-3c95b567d8b2"},"first_release_date":1104969600,"franchise":{"id":191,"name":"Digimon"},"genres":[{"id":12,"name":"Role-playing (RPG)"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":10077,"company":{"id":617,"name":"Bandai"},"created_at":1390089600,"developer":true,"game":3878,"porting":false,"publisher":true,"supporting":false,"updated_at":1390176000,"checksum":"e8edffbe-79be-5634-2c5f-341f9a7b6dda"}],"name":"Digimon World 4","slug":"digimon-world-4","storyline":"The Yamato Server disappears after the X-Virus attacks, and the Doom Server has taken it's place. It's up to the you and up to 3 of your friends, the Digital Security Guard (D.S.G.) to venture into the Doom Server, discover the source of the virus and deal with the infection before it can infect the Home server. \n \nYou will venture into the Dry Lands stop the virus from spreading, into the Venom Jungle to stop the Dread Note from launching and then the Machine Pit to destroy the final boss. \n \nAfter finishing the game for the first time, you unlock Hard mode, where the enemies are stronger, but you keep all of your levels, equipment and digivolutions. Do it again, and you unlock the hardest difficulty, Very Hard.","summary":"\"It's up to you to save the Digital World!\" \nDigimon World 4 is an action role-playing game which is loosely based on the movie, \"Digital Monster X-Evolution\" which only saw a release in Japanese. \nYou start as either Agumon, Veemon, DORUmon or Guilmon and can digivolve to 12 others by doing missions for the beings called \"Digi-Elves\" and recieving them as reward for your work for a total of 16 playable Digimon. Defeat enemies, earn bits and equip your Digimon for combat.","total_rating":40.0451625841289,"total_rating_count":13,"url":"https://www.igdb.com/games/digimon-world-4","videos":[{"id":17199,"game":3878,"name":"Trailer","video_id":"CIUX8BV-OXE","checksum":"12b9d16b-e9ea-f456-9fde-9e78962b7b2a"},{"id":17200,"game":3878,"name":"Game intro","video_id":"VrAQQwXrzCo","checksum":"81e1b11f-1ff4-3d94-074e-a226fb3c5446"}]}