{"id":3926,"alternative_names":[{"id":1437,"name":"KINGDOM OF CHAOS THE UNIVERSE"}],"cover":{"id":4151,"game":3926,"height":361,"image_id":"f96w7znryu1pubaxr2rp","url":"//images.igdb.com/igdb/image/upload/t_thumb/f96w7znryu1pubaxr2rp.jpg","width":256,"checksum":"15c10b4d-922b-ed70-fd1d-6e0008235e0d"},"first_release_date":1036022400,"genres":[{"id":12,"name":"Role-playing (RPG)"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":10182,"company":{"id":1956,"name":"Idea Factory"},"created_at":1390176000,"developer":true,"game":3926,"porting":false,"publisher":true,"supporting":false,"updated_at":1390176000,"checksum":"e2e288bf-bc24-8f8d-a797-aec4fad13fb6"}],"name":"Gakuen Toshi Vara Noir","slug":"gakuen-toshi-vara-noir","summary":"The threat of demonic invasion gives impetus to the fledgling Simba Empire to found a school of magic called Vara Noir. With the world recovering after a devastating war, the Empire uses the school to train students in the ways of battle and magic to prepare for any imminent and far-off threats. Enter 13-year old chimney sweeper Myu who cleans smokestacks and other debris laden orifices. One day, her grandpappy hands her a mighty sword and a few ducats and commands her to apply to Vara Noir for an education in the mystic arts. Myu takes the entrance examination and passes with flying colors. As such, she enters Vara Noir academy and goes on an adventure where she will eventually help save the kingdom. \n \nIdea Factory's latest game in the Kingdom of Chaos series features dungeon exploration, character interaction and an Megami-Tensei-esque item synthesis system where special items found in dungeons may be bonded with weapons to increase attack power, imbue properties, etc. Interaction sequences are of the point 'n click sort where questions and answers are rattled off in routine fashion. \n \nOriginally released on the PS2, Gakuen Toshi Vara Noir joins the Gamecube library with new animation sequences and graphical updates which freshen up the adventure for old and new gamers to enjoy.","total_rating":23,"total_rating_count":0,"url":"https://www.igdb.com/games/gakuen-toshi-vara-noir"}