{"id":4044,"cover":{"id":115162,"alpha_channel":false,"animated":false,"game":4044,"height":1833,"image_id":"co2guy","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2guy.jpg","width":1375,"checksum":"449c2312-9dad-520b-4dce-23cdf03018e5"},"first_release_date":1125964800,"genres":[{"id":13,"name":"Simulator"},{"id":14,"name":"Sport"}],"involved_companies":[{"id":10474,"company":{"id":454,"name":"EA Sports"},"created_at":1390348800,"developer":false,"game":4044,"porting":false,"publisher":true,"supporting":false,"updated_at":1390348800,"checksum":"1d6591c8-2cdd-1779-6c14-5ae5863fae5c"},{"id":10475,"company":{"id":277,"name":"EA Canada"},"created_at":1390348800,"developer":true,"game":4044,"porting":false,"publisher":false,"supporting":false,"updated_at":1390348800,"checksum":"de0878d5-ec34-56d1-baea-f8d92fe4cb78"}],"name":"NHL 06","slug":"nhl-06","summary":"Hit the ice with EA Sports' NHL 06 for the XBOX. This entry in the NHL series builds on the 2005 version by adding new rules and an up to date rooster that includes just about every big name in the National Hockey League. NHL 06 includes everything from NHL 05, including the revamped shooting controls. New to the 2006 version is the use of the left analog stick for deking, which in hockey terms means to dodge and fake out defenders. The right analog stick is used to pull off fancy moves like a spin or between the legs pass. These fancy moves will distract goalkeepers, giving the gamer an opening to shoot. The drawback to these moves is that only superstar characters can pull them off regularly. The game includes many of the traditional hockey game modes, including dynasty mode. In dynasty mode, gamers will control their own hockey team and have to deal with outside pressures, sponsors, and more while trying to meet the team philosophy, which is different for each team. Other modes include single season, leagues and tournaments, quick game, and online play. The graphics of NHL 06 are top notch. This time, they've been tweaked to accurately show character size differences. The defense players and goalkeepers, who are traditionally larger players, actually look larger, while the smaller and faster scorers are indeed a little thinner and smaller. This is just one small change that adds to the overall amazing gameplay of NHL 06.","total_rating":81.0564084255623,"total_rating_count":11,"url":"https://www.igdb.com/games/nhl-06","videos":[{"id":40785,"game":4044,"name":"Trailer","video_id":"dS2Uq2fbCrY","checksum":"e08b8282-cad7-0f4a-7ce3-36dc38c40ea7"}]}