{"id":79149,"alternative_names":[{"id":35140,"name":"PSO:Ep1&2+"},{"id":35141,"name":"PSO: Episode I&II Plus"},{"id":56141,"name":"ファンタシースターオンライン EPISODE I&II PLUS"}],"cover":{"id":133070,"alpha_channel":false,"animated":false,"game":79149,"height":1023,"image_id":"co2uoe","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2uoe.jpg","width":736,"checksum":"82675b9b-f3dc-ecf4-0daa-7d884d871fef"},"first_release_date":1072828800,"genres":[{"id":12,"name":"Role-playing (RPG)"},{"id":25,"name":"Hack and slash/Beat 'em up"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":99638,"company":{"id":395,"name":"Sonic Team"},"created_at":1590105600,"developer":true,"game":79149,"porting":true,"publisher":false,"supporting":false,"updated_at":1590192000,"checksum":"83bf56fc-e10e-a59e-03c1-ac3cc69c9003"},{"id":99639,"company":{"id":112,"name":"Sega"},"created_at":1590105600,"developer":false,"game":79149,"porting":false,"publisher":true,"supporting":false,"updated_at":1590192000,"checksum":"bc558e3f-c62d-60fe-66b8-c1f67af92f7e"}],"name":"Phantasy Star Online Episode I & II Plus","screenshots":[{"id":385217,"alpha_channel":false,"animated":false,"game":79149,"height":720,"image_id":"sc898h","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc898h.jpg","width":1280,"checksum":"2bd346cb-7849-6459-560c-74c05c618f8e"},{"id":385218,"alpha_channel":false,"animated":false,"game":79149,"height":720,"image_id":"sc898i","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc898i.jpg","width":1280,"checksum":"c41dbd7e-8671-489b-f9ce-0d3f1326e94a"}],"slug":"phantasy-star-online-episode-i-and-ii-plus","storyline":"Episode I begins as Pioneer II arrives at Ragol, attempting to land and begin colonizing the new planet. While preparing to land, a huge explosion rocks the surface of Ragol, causing all connection with the first colony down below, Pioneer I, to be lost. The Principal reaches out to the group of warriors called Hunters to go onto the surface and search for clues of what happened to Pioneer I, the colonists, and the Principal's daughter, Rico Tyrell. The player will make their way through four different areas of Ragol, Forest, Caves, Mines, and Ruins in search of what happened to Red Ring Rico and the cause of the mysterious explosion. \n \nAfter Episode I, the player is asked to help the government explore a recently found laboratory on Gal Da Val Island. After some training missions, you begin to explore the island, only to find mysterious voice capsules from Healthcliff Flowen, a military commander that the government had presumed dead. The player will travel through 7 different areas,Temple, Spaceship, Jungle, Mountain, Seaside, Central Control Area, and Seabed in search of the fate of Healthcliff Flowen and the mysterious plan begun by Dr. Osto.","summary":"SEGA re-released in 2003 an updated version of Phantasy Star Online Episode I & II for the Nintendo GameCube in 2003 called Phantasy Star Online Episode I & II Plus. \n \nEarly in the effort to run unsigned code on the GameCube, people found that when playing PSO and connecting to a server using the GameCube Broadband Adapter, a regular PC could be made to pretend it was a server which would fool the game. \n \nAfter making the connection, data could be streamed back to the GameCube, making it easy for hacking and false servers. Phantasy Star Online Episode I & II Plus was created in mind to fix this problem. Along with this problem, SEGA included extra content for offline with this game including: \n- Episode II Challenge Mode, which was perviously only online. \n- Perviously Online only quests, Seat of the Heart, West Tower and East Tower are now available offline. \n- Central Dome Fire Swirl, a downloadable quest for the Xbox, is now available offline. \n- The downloadable goods from Fake in Yellow quest are now available offline. \n \nAside from some extra cheat protection, Phantasy Star Online Episode I & II Plus ran exactly the same as the original version and all data from characters, items, ect, can be swapped between the two instantly.","total_rating":87,"total_rating_count":2,"url":"https://www.igdb.com/games/phantasy-star-online-episode-i-and-ii-plus","videos":[{"id":46361,"game":79149,"name":"Gameplay Video","video_id":"RWcvbjKusc4","checksum":"a53d7b01-bdfb-7202-294c-f6f540817505"}]}