{"id":836,"alternative_names":[{"id":28369,"name":"PoPSoT"},{"id":37415,"name":"Prince of Persia: Las Arenas del Tiempo"},{"id":90154,"name":"Prince of Persia: Le Sabbie del Tempo"},{"id":90155,"name":"Prince of Persia: Les Sables du Temps"},{"id":90156,"name":"PoP: SoT"},{"id":90157,"name":"Princ Persii: Peski Vremeni"},{"id":90158,"name":"Prince of Persia: Písky času"},{"id":90159,"name":"Prince of Persia: Piaski Czasu"},{"id":90160,"name":"Prince of Persia: Jikan no Suna"},{"id":90161,"name":"Bosi Wangzi: Shi zhi Sha"},{"id":95640,"name":"페르시아의 왕자: 시간의 모래"}],"cover":{"id":224517,"alpha_channel":false,"animated":false,"game":836,"height":1600,"image_id":"co4t8l","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4t8l.jpg","width":1200,"checksum":"8c840813-76df-b451-822e-193e5db3ed81"},"first_release_date":1068076800,"genres":[{"id":8,"name":"Platform"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":117443,"company":{"id":38,"name":"Ubisoft Montreal"},"created_at":1611100800,"developer":true,"game":836,"porting":false,"publisher":false,"supporting":false,"updated_at":1611100800,"checksum":"c699b07c-4718-d043-64f6-766444bf2fd7"},{"id":117444,"company":{"id":70,"name":"Nintendo"},"created_at":1611100800,"developer":false,"game":836,"porting":false,"publisher":true,"supporting":false,"updated_at":1611100800,"checksum":"87080879-33ce-e2c9-1ef7-fd35db12cb67"},{"id":185865,"company":{"id":13634,"name":"Sony Computer Entertainment"},"created_at":1662193183,"developer":false,"game":836,"porting":false,"publisher":true,"supporting":false,"updated_at":1662196733,"checksum":"86068ec0-322e-5eb6-16b8-2fc6034ef05f"}],"name":"Prince of Persia: The Sands of Time","screenshots":[{"id":818,"game":836,"height":600,"image_id":"u6rauppfnoluduuqjgwy","url":"//images.igdb.com/igdb/image/upload/t_thumb/u6rauppfnoluduuqjgwy.jpg","width":800,"checksum":"495c6300-9ba3-f53a-76d8-1afeb880f991"},{"id":819,"game":836,"height":600,"image_id":"j9d2pk3hffc1rhb1xj17","url":"//images.igdb.com/igdb/image/upload/t_thumb/j9d2pk3hffc1rhb1xj17.jpg","width":800,"checksum":"be354c62-764d-437c-bfb9-21e4752a82ad"},{"id":820,"game":836,"height":600,"image_id":"dupcvfbrc7ermbgqqxlm","url":"//images.igdb.com/igdb/image/upload/t_thumb/dupcvfbrc7ermbgqqxlm.jpg","width":800,"checksum":"349bd594-940d-f7fc-f590-fd7c36f6643d"},{"id":821,"game":836,"height":600,"image_id":"gzl9to1j0xzo2eq6nvek","url":"//images.igdb.com/igdb/image/upload/t_thumb/gzl9to1j0xzo2eq6nvek.jpg","width":800,"checksum":"0effe3ad-7447-9032-c4af-82a865fee12a"},{"id":822,"game":836,"height":600,"image_id":"cmqqfjoxeu9qtyzjxbli","url":"//images.igdb.com/igdb/image/upload/t_thumb/cmqqfjoxeu9qtyzjxbli.jpg","width":800,"checksum":"0abc7729-380a-dfc3-464e-8b2a6f4674c1"}],"slug":"prince-of-persia-the-sands-of-time","storyline":"King Sharaman of Persia and his son, known only as the Prince, pass through India en route to Azad and conquer a city with the aid of the local Maharajah's traitorous Vizier. During the battle the Prince seeks to win honour and glory in his first battle and heads straight to the Maharajah's treasure vaults, where he discovers the mythical Sands of Time safely contained within their Hourglass and the Dagger of Time, which he quickly learns can turn back time a short amount. When the Prince presents the dagger to his father, the traitorous Vizier demands it as payment, but is refused by King Sharaman. The Persians then continue on their journey to Azad with the wealth of prisoners taken from the Maharajah, among them the Maharajah's beautiful daughter, Princess Farah.\n\nIn Azad, the Vizier, now in the service of King Sharaman, tricks the Prince into using the Dagger to release the Sands of Time from the Hourglass. A horrific sandstorm engulfs the kingdom and the Sands of Time turn all the occupants of the palace into monsters. Only the Prince, Farah, and the Vizier remain unchanged due to their possessions; a dagger, a medallion, and a staff, respectively. Amid the catastrophe, the Vizier demands the dagger from the Prince, who refuses and manages to escape.\n\nThe Prince soon teams up with Farah in an attempt to return the Sands of Time to the Hourglass, which the Vizier moves to the top of the Tower of Dawn. As they progress through the palace the pair are constantly waylaid by Sand Monsters (including a sand-possessed King Sharaman) and the deadly network of traps set in motion in the hopes of killing the creatures. The Prince becomes steadily more worn until his princely armor is mere shreds and his body covered in bloody wounds.\n\nWhile initially the Prince does not trust Farah because of the Persians' mistreatment of her, the two begin to grow closer as time goes on After a terrific battle in the ascent of the Tower of Dawn, they reach the Hourglass and are about to complete their mission when the Prince hesitates, suddenly suspicious of what Farah's motives really are. Before Farah can convince the Prince otherwise, the Vizier confronts the pair and uses his magical powers to trap Farah and the Prince in a tomb.\n\nAs they wait to die in the tomb Farah tells the Prince, who similarly reveals his claustrophobia, a story she had never told anyone before, about a time when she was little, when her mother told her about a secret magic word which would help her escape anything that scared her: \"Kakolookia\".\n\nAs soon as the Prince repeats the word, as if by magic, the Prince finds himself in a mysterious tunnel which winds down into a dreamlike bathhouse that resembles the magic fountains that the Prince earlier used to increase his health. There he meets Farah inviting him to join her bath; as they bathe, the Prince and Farah finally make love and find comfort in each other amid their perilous situation. When the Prince awakens afterwards, he finds himself back in the tomb and discovers that the magical cavern was just a dream, but he believed that Farah had shared it as well. However Farah, the Dagger, and his sword are gone, leaving him with only Farah's medallion to protect him from the Sands of Time.\n\nThe Prince, having found a new sword which destroys the sand monsters on contact, pursues and catches up to Farah once more atop the Tower of Dawn, which he must climb from the outside. When the Prince finally reaches the top, he finds Farah being overwhelmed by the sand monsters and she dangles over a cliff by the Dagger, while the Prince grab the blade; and Farah, realizing that the Prince will die to save her, instead sacrifices herself and lets go of the Dagger; and true to the game's prophecy \"if you want to live, die in love\" she falls to her death in the Hourglass room below. The Prince then tries to use the dagger to save her, but finds the sand-tanks empty since Farah had used them all. Enraged by his lover's death, the Prince uses the Dagger to massacre the last of the sand monsters in the tower and descends to weep over Farah's body. As the Prince mourns, the Vizier emerges from the shadows and offers the Prince a partnership in his evil plan, promising him eternal life; however the Prince angrily refuses because those he loved had died, and before the Vizier can stop him, the Prince drives the Dagger of Time into the Hourglass, rewinding time to the night before the invasion of the Maharajah's kingdom. The Prince awakens, still with the Dagger of Time, and secretly finds his way to Farah's bedroom, where he tells her the whole story, which she does not remember as it had not happened yet. However, the Vizier discovers the Prince, and fearing his planned treachery already revealed, attempts to kill both Farah and the Prince, telling that he suffered from consumption and would die in any event and that his plan was to cure his imminent death with eternal life. In the ensuing battle the Prince kills the Vizier. He then returns the Dagger of Time to Farah, who asks why the Prince invented such an unbelievable story to prove the Vizier's treachery. The Prince then kisses Farah, hoping she'll remember; but she rebuffs his advance, and so the Prince uses the dagger to erase the kiss, and instead he falsely tells her that it was just a story. But when Farah asks the Prince his name, he replies, \"Just call me Kakolookia\", before departing, leaving Farah amazed.","summary":"Prince of Persia: The Sands of Time is a third-person puzzle-platformer and action-adventure computer and video game published by Ubisoft. It was released on November 21, 2003 and is a reboot of the landmark video game series Prince of Persia, created by Jordan Mechner in 1989.\n\nThe Sands of Time, developed internally at Ubisoft Montreal, successfully captures the mechanics of the original platformer and extends it to the 3D generation. An earlier attempt by The Learning Company to transfer the game to 3D (Prince of Persia 3D) was released in 1999, but despite its initial good reception failed to sell enough and the company responsible for the original trilogy was already closing doors. The game was praised for its visual design, finely tuned game mechanics and intriguing storyline, winning the game several awards.\n\nThe game was developed for the PC, PlayStation 2, GameCube, Xbox, and later a 2D-version for the Game Boy Advance and mobile phones. The success of The Sands of Time led to three followups, Prince of Persia: Warrior Within (2004), Prince of Persia: The Two Thrones (2005), and Prince of Persia: The Forgotten Sands (2010). A remastered, high-definition, version of The Sands of Time was released on the PlayStation Network for the PlayStation 3 on November 16, 2010.","total_rating":83.15389508637556,"total_rating_count":539,"url":"https://www.igdb.com/games/prince-of-persia-the-sands-of-time","videos":[{"id":32505,"game":836,"name":"Trailer","video_id":"P5XaqjHPPVQ","checksum":"758158fb-aee6-a2c7-98de-cbea660748a2"},{"id":32506,"game":836,"name":"Trailer","video_id":"eeoqc2d4CUM","checksum":"ad1ac765-50d9-57b5-01a4-c1dbe6534826"},{"id":32507,"game":836,"name":"Trailer","video_id":"8S5DVt_wo3g","checksum":"b6a819d6-48a6-c2f5-797f-f04b61944e95"}]}