{"id":2927,"alternative_names":[{"id":42064,"name":"SMB"}],"cover":{"id":104318,"alpha_channel":false,"animated":false,"game":2927,"height":1841,"image_id":"co28hq","url":"//images.igdb.com/igdb/image/upload/t_thumb/co28hq.jpg","width":1381,"checksum":"9e6ee9b4-23e0-bfbf-0706-397cf3c9cdb4"},"first_release_date":1000425600,"genres":[{"id":9,"name":"Puzzle"},{"id":10,"name":"Racing"},{"id":30,"name":"Pinball"}],"involved_companies":[{"id":101760,"company":{"id":1096,"name":"Amusement Vision"},"created_at":1592092800,"developer":true,"game":2927,"porting":false,"publisher":false,"supporting":false,"updated_at":1592092800,"checksum":"23d37900-8c83-b519-24ff-2aea52402071"},{"id":101761,"company":{"id":112,"name":"Sega"},"created_at":1592092800,"developer":false,"game":2927,"porting":false,"publisher":true,"supporting":false,"updated_at":1592092800,"checksum":"fc4c8fda-3c93-6f74-75bb-fe65aea35331"}],"name":"Super Monkey Ball","screenshots":[{"id":3069,"game":2927,"height":188,"image_id":"oixwk4rvrimsmrkasw6m","url":"//images.igdb.com/igdb/image/upload/t_thumb/oixwk4rvrimsmrkasw6m.jpg","width":268,"checksum":"f8d05aae-88e9-b29a-1260-e6750725c54e"},{"id":3070,"game":2927,"height":188,"image_id":"qhh1cdzffaco1x6onhyo","url":"//images.igdb.com/igdb/image/upload/t_thumb/qhh1cdzffaco1x6onhyo.jpg","width":268,"checksum":"14f273b9-5784-d348-fe3c-e6e18be4a6ce"},{"id":388426,"alpha_channel":false,"animated":false,"game":2927,"height":448,"image_id":"sc8bpm","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8bpm.jpg","width":640,"checksum":"3c7509c7-8180-1ad3-002c-fb9093698ac5"},{"id":388428,"alpha_channel":false,"animated":false,"game":2927,"height":448,"image_id":"sc8bpo","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8bpo.jpg","width":640,"checksum":"71097508-0472-2fce-496d-2985962b2b4d"}],"slug":"super-monkey-ball","storyline":"This game has a story that is only told in the Japanese version. Here is an excerpt, translated from Japanese: \n \nAiAi, MeeMee, and Baby are a good family and live peacefully in Jungle Island. One day, out of the distant islands, GonGon, leader of the Gorillas, brought in a raid to the island. They intend to hog all the bananas for themselves! AiAi escaped from the spot, and got tired and fell asleep. In his dreams, AiAi was told in his dreams there is a paradise called \"Banana Island\" in the sky from the \"Grand Monkey\". But in order to go there, you have to go through a couple of traps and gimmicks. But the Grand Monkey taught AiAi a magical spell: \"Ei Ei Poo!\" That protects him from any danger. AiAi wakes up quickly, and as he says \"Ei Ei Poo!\", A big ball flies out of the sky He gets insides of it and flies high above the sky. Now, survive several traps and tricks, and aim for it! Banana Island! \n \nWhen the player completes the Master Stages (in which the setting is above Banana Island), if they play as AiAi, MeeMee, or Baby, they will be able to go to Banana Island and enjoy all the bananas it has to offer. However, if you play as GonGon, he will be locked out of the place in which the bananas are kept while the other monkeys enjoy the bananas inside.","summary":"Super Monkey Ball is a 2001 platform party video game developed by Amusement Vision and published by Sega. The game debuted in Japan at the 2001 Amusement Operators Union trade show as Monkey Ball, an arcade cabinet running on Sega's NAOMI hardware and controlled with a distinctive banana-shaped analog stick. Due to the failure of Sega's Dreamcast home console and the company's subsequent restructuring, an enhanced port dubbed Super Monkey Ball was released as a launch title for the GameCube in late 2001, garnering interest as Sega's first game published for a Nintendo home console. \n \nConceived by Amusement Vision head Toshihiro Nagoshi, Super Monkey Ball involves guiding a transparent ball containing one of four monkeys—AiAi, MeeMee, Baby, and GonGon—across a series of maze-like platforms. The player must reach the goal without falling off or letting the timer reach zero to advance to the next stage. There are also several multiplayer modes: independent minigames as well as extensions of the main single-player game.","total_rating":56.7906796015647,"total_rating_count":36,"url":"https://www.igdb.com/games/super-monkey-ball","videos":[{"id":37152,"game":2927,"name":"Gameplay Video","video_id":"Uvt_d9LemKM","checksum":"f17a9575-2132-81a9-e075-4a4407a0adee"}]}