{"id":4197,"alternative_names":[{"id":59717,"name":"TMNT III: Mutant Nightmare DS"},{"id":59718,"name":"TMNT 2003 3 Mutant Nightmare DS"}],"cover":{"id":110694,"alpha_channel":true,"animated":false,"game":4197,"height":800,"image_id":"co2deu","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2deu.jpg","width":600,"checksum":"a30af4bf-a6f4-fe2e-43ef-34515289f6b4"},"first_release_date":1130803200,"franchise":{"id":77,"name":"Teenage Mutant Ninja Turtles"},"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"}],"involved_companies":[{"id":125568,"company":{"id":129,"name":"Konami"},"created_at":1618990253,"developer":true,"game":4197,"porting":false,"publisher":false,"supporting":false,"updated_at":1619000109,"checksum":"a2abe0a3-1d1f-3412-3919-92f58cbd3bf4"},{"id":125569,"company":{"id":161,"name":"Konami Digital Entertainment"},"created_at":1618990253,"developer":false,"game":4197,"porting":false,"publisher":true,"supporting":false,"updated_at":1619000109,"checksum":"9bcb2389-0608-8730-80a2-67efd19782d0"}],"name":"Teenage Mutant Ninja Turtles 3: Mutant Nightmare","screenshots":[{"id":353795,"alpha_channel":false,"animated":false,"game":4197,"height":448,"image_id":"sc7kzn","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzn.jpg","width":640,"checksum":"2cde82c5-095d-aa83-e7a0-b0c99dd3020e"},{"id":353796,"alpha_channel":false,"animated":false,"game":4197,"height":448,"image_id":"sc7kzo","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzo.jpg","width":640,"checksum":"127dbcf4-3f47-1a1d-e2fc-2bd7681b28d9"},{"id":353797,"alpha_channel":false,"animated":false,"game":4197,"height":480,"image_id":"sc7kzp","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzp.jpg","width":640,"checksum":"840f1809-5a6e-4840-1e8c-d204f2598cd8"},{"id":353798,"alpha_channel":false,"animated":false,"game":4197,"height":480,"image_id":"sc7kzq","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzq.jpg","width":640,"checksum":"ef27c30e-ddf9-b4bd-5d22-9d2ecd686064"},{"id":353799,"alpha_channel":false,"animated":false,"game":4197,"height":448,"image_id":"sc7kzr","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzr.jpg","width":640,"checksum":"e4079df1-8ef6-f9fd-0c8a-780c50d40fb7"},{"id":353800,"alpha_channel":false,"animated":false,"game":4197,"height":480,"image_id":"sc7kzs","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzs.jpg","width":640,"checksum":"4b78bf42-03f5-9ec4-f790-5cd9fbcd4c21"},{"id":353801,"alpha_channel":false,"animated":false,"game":4197,"height":540,"image_id":"sc7kzt","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzt.jpg","width":960,"checksum":"88a3ccb2-f192-4c9e-1c9a-75a66f539f67"},{"id":353802,"alpha_channel":false,"animated":false,"game":4197,"height":529,"image_id":"sc7kzu","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzu.jpg","width":756,"checksum":"27bf58de-e357-081d-7ce3-ce866f2c8ecc"},{"id":353803,"alpha_channel":false,"animated":false,"game":4197,"height":529,"image_id":"sc7kzv","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzv.jpg","width":756,"checksum":"9e85cab6-5f3d-3991-7170-bd1d6a8a0579"},{"id":353804,"alpha_channel":false,"animated":false,"game":4197,"height":1080,"image_id":"sc7kzw","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kzw.jpg","width":1920,"checksum":"689a4635-6004-9062-3609-7771bafc61e6"}],"slug":"teenage-mutant-ninja-turtles-3-mutant-nightmare","storyline":"In Episode 1, the turtles begin saving an old person in New York City from sadistic Triceratons. After destroying three carriers deploying the Triceraton army, the turtles go underground to reach the Central Park to rescue their friends Casey and April. While in the park, Leo Raph Mikey and Don defend against the Triceratons and Professor Honeycutt pegged as the Fugitoid saved from TMNT 2 Battle Nexus assists the turtles in finding where Casey Jones and April O'Neil are held captive. Breaking into the Triceraton's base, Zaranmon, commander in chief of the Triceraton's mobilizes a robot in effort of stopping the Turtles and Traximus. Zaranmon's attempt is a failure and Traximus destroys a chair to make change in their clan.\n\nIn Episode 2, the turtles discover new technology coming from Baxter Stockman as Mousers infiltrate the sewer causing intense pain to the ears of Master Splinter. While protecting their sensei, the ninja turtles are fending off the Mousers while staying close to him. However, Master Splinter ends up captured and the turtles use hovercraft to chase down a moving van. They are soon blocked by a tall and a small enemy duo for an ambush. Once passed them, the turtles resume in their rescue mission for Master Splinter eventually fighting with Bishop then having to use throwing stars to break a lock to free him.\n\nIn Episode 3, the Turtles encounter every member of the Foot Clan through the missions. Hun, Karai, and Oroku Saki, the human identity of Shredder all fall down to the turtles. Towards the final battle with Saki, he is upgraded as Mega Shredder. The ninja turtles defeat him and then are summoned upon the Utrom council for a tribunal. Scherel, the Utrom controlling Shredder's body is charged for devious crimes and is exiled to an icy planet while Karai and the others are turned into the authorities as the main game ends.\n\nIn the Nightmare chapter, each of the turtles have a dream and encounter various bosses. Clearing most of the missions in this chapter leads to the game's final boss, Ultimate Drako. To use the gembu scrolls to activate the Ultimate Turtle forms, the player must collect scrolls and other content in Free Battle mode.","summary":"TMNT3 puts more of a focus on teamwork, character development and control than any other console Turtles game to date. Gamers can play as their favorite Turtle alone or with up to three friends, earning experience points along the way as they slash and bash Foot Ninjas and powerful, well-known bosses from the TMNT universe. These experience points allow players to improve and evolve their Turtles' traits and abilities for more varied, powerful attacks and moves. The Ninja Scroll System is another new feature on TMMT3. Being able to select which ninja scrolls to use allows the Turtles to use various special abilities strategically. Cooperative play lies at the heart of TMNT3 and gamers who team up with friends for multiplayer action are rewarded with exclusive features such as Cooperative Attack for even more shell shocking damage to enemies. The effect of this attack changes depending on the number of players working together (between 2-4 players). For even greater control, TMNT3 features a new combat system called the Target Attack system that lets gamers play more instinctively and strategically. With the Target Attack system, players will be able to lock onto specific enemies and block, dodge or counter attack accordingly for smoother and more maneuverable combat. Story Mode can be played with 1-4 players. Even when you have less than 4 players to play, the other Turtles will be at your side, controlled through AI. All the Turtles can participate in Cooperative Attack to beat enemies and players can give commands to the AI.","total_rating":46.57201126189785,"total_rating_count":10,"url":"https://www.igdb.com/games/teenage-mutant-ninja-turtles-3-mutant-nightmare","videos":[{"id":48265,"game":4197,"name":"Gameplay video","video_id":"VyJ_8C_0ZiA","checksum":"650d60fd-ffc5-dd41-259c-e82654e5b835"}]}