{"id":4196,"alternative_names":[{"id":59714,"name":"TMNT 2: Battle Nexus"},{"id":59715,"name":"TMNT 2003 2 Battle Nexus"}],"cover":{"id":79137,"alpha_channel":false,"animated":false,"game":4196,"height":1844,"image_id":"co1p29","url":"//images.igdb.com/igdb/image/upload/t_thumb/co1p29.jpg","width":1383,"checksum":"fe9782d2-7f99-8ec9-f8a4-7caed6c597f6"},"first_release_date":1098144000,"franchise":{"id":77,"name":"Teenage Mutant Ninja Turtles"},"genres":[{"id":10,"name":"Racing"},{"id":25,"name":"Hack and slash/Beat 'em up"}],"involved_companies":[{"id":125563,"company":{"id":129,"name":"Konami"},"created_at":1618990080,"developer":false,"game":4196,"porting":false,"publisher":true,"supporting":false,"updated_at":1619000122,"checksum":"fc67b10a-f13c-8624-6520-5e9d7fc11919"},{"id":125564,"company":{"id":161,"name":"Konami Digital Entertainment"},"created_at":1618990080,"developer":true,"game":4196,"porting":false,"publisher":false,"supporting":false,"updated_at":1619000123,"checksum":"70128997-4748-a500-27c4-cc7640e66497"}],"name":"Teenage Mutant Ninja Turtles 2: Battle Nexus","screenshots":[{"id":353773,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz1","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz1.jpg","width":1024,"checksum":"5da8b08b-79e8-7f8f-6886-c6917457b505"},{"id":353774,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz2","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz2.jpg","width":1024,"checksum":"1604bb72-8a98-ce4d-a7dc-aff900e3751f"},{"id":353775,"alpha_channel":false,"animated":false,"game":4196,"height":600,"image_id":"sc7kz3","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz3.jpg","width":800,"checksum":"609c614f-b06d-ac31-4c6f-cb97ddc9fafe"},{"id":353776,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz4","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz4.jpg","width":1024,"checksum":"c76d56ea-c744-8cb3-6134-fb59556f546f"},{"id":353777,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz5","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz5.jpg","width":1024,"checksum":"2fbd333d-5e2d-52e1-6660-bd042d6064d5"},{"id":353778,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz6","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz6.jpg","width":1024,"checksum":"daede346-c5a5-ad4b-807f-240adcfde012"},{"id":353779,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz7","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz7.jpg","width":1024,"checksum":"21bdc524-ccdb-b293-efa7-bc4525613614"},{"id":353780,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz8","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz8.jpg","width":1024,"checksum":"e02182da-07bf-24c0-0225-0bf5684d6401"},{"id":353781,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kz9","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kz9.jpg","width":1024,"checksum":"2c1e6878-6f9f-2ec3-ab3f-2be36842065c"},{"id":353782,"alpha_channel":false,"animated":false,"game":4196,"height":768,"image_id":"sc7kza","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc7kza.jpg","width":1360,"checksum":"7563bf7e-4cbf-d123-d825-982cb27a5247"}],"slug":"teenage-mutant-ninja-turtles-2-battle-nexus","storyline":"The game begins with a battle with the Foot Clan and Hun in Oroku Saki's skyscraper. The Foot is defeated, and Master Splinter mysteriously disappears. The Turtles chase the trail down to a building marked \"T.C.R.I.\", which proves to hide a bizarre secret beneath its innocuous exterior: its employees are members of a brain-like alien race, the Utroms. Whilst battling these strange new foes, the Turtles are accidentally teleported to different points across the galaxy, meeting the Fugitoid Professor Honeycutt on D'Hoonib, and end up as crossfire in the war between the Triceratons and Federation - both sides are after the Fugitoid for his technology. Along the way, they come across an intergalactic bounty hunter named Slashuur. Said to be the most powerful bounty hunter in the universe, Honeycutt heard legends of him as a young child. Ironically, Honeycutt is who Slashuur is after, having been hired by the Triceratons to capture him. After the Turtles beat him, Slashuur reveals that he has knowledge of Hamato Yoshi before taking his leave. Before escaping the Triceraton Homeworld, the Turtles befriend and free a noble Triceraton warrior who had been forced to fight as a gladiator, Traximus.\n\nUpon returning to Earth and the T.C.R.I. building, it is revealed that the Utroms had rescued an injured Splinter and were caring for him. The Utroms place the TMNT and Splinter in a virtual reality machine to better explain their origins to them. Hundreds of years ago, the Utroms were traveling across the galaxy, transporting a murderous rogue of their species, Ch'rell. Their ship crashes on Earth in the country of Japan. Ch'rell escapes, while the Utroms are forced to wait for Earth technology to catch up with their own, so they can return home. Some time later, after the Utroms have enlisted the help of some humans as Guardian Ninja, the Utroms are ambushed by a heavily armored warlord known as The Shredder. Meanwhile, in the real world, Baxter Stockman sabotages the virtual reality machine, and the dangers within become presented as real to the Turtles and Splinter. After defeating Shredder and his Feudal Foot Ninja, the Turtle meet up with the Utrom Mortu, who gives them a device that allows them to return to the real world. Unfortunately, when they get there, they find Shredder and the Foot attacking the T.C.R.I. building. During their fight, an organic destruction device is planted, and the Utrom escape through their Transmat. The Turtles defeat Shredder before he can chase after them, and it is revealed that not only is this Shredder the same one they saw in Feudal Japan, but he also is the evil Utrom Ch'rell! The Turtles escape the building before the device goes off, but Ch'rell is not so lucky.\n\nThe Turtles later encounter a gigantic anthropomorphic alligator in the sewers by the name of Leatherhead. After a scuffle, Leatherhead realizes he and the Turtles are on the same side. He tells his own origin; that he was once a baby gator, found by an Utrom and adopted. Leatherhead came into contact with some Retromutagen Ooze, and became as he is currently, just as the Turtles had. He lived with the Utroms, considering them his family. When the T.C.R.I. building exploded, he fled to the sewers and took up residence in the Turtles' old lair, attempting to build a Transmat of his own to follow the Utroms. Unfortunately, it is revealed that his partner in this endeavor was none other than Baxter Stockman, feigning alliance with the Utroms. Baxter, realizing his jig was up, threw a chemical tank and fled, causing the ceiling of Leatherhead's lair to collapse. Leatherhead urges his new friends to escape while he held the collapsing rubble. The Turtles escaped just in time to see the ceiling collapse in its entirety on Leatherhead.","summary":"The sequel to 2003's updated beat 'em up, Teenage Mutant Ninja Turtles 2: Battle Nexus sets the turtle quartet on another adventure from the series' second season, this time allowing the entire team to work together via a 4-player multiplayer mode.\n\nEach turtle now has their own unique ability and special fighting moves that fit in with their personality: such as operating switches and computers, or moving or destroying stationary objects. In single-player mode, players can switch turtles on the fly in order to accomplish the various tasks. Throughout some levels, the turtles also have racing sections over various terrains.\n\nAs players progress through the game, they can find secret items, abilities, and power-ups, including the original late 1980's Teenage Mutant Ninja Turtles arcade game.","total_rating":59.34074036622635,"total_rating_count":15,"url":"https://www.igdb.com/games/teenage-mutant-ninja-turtles-2-battle-nexus","videos":[{"id":48263,"game":4196,"name":"Gameplay Video","video_id":"R4DzAGAmrcs","checksum":"cd010a71-4afb-2b23-7cbf-e0afb6159ef4"}]}