{"id":910,"alternative_names":[{"id":35705,"name":"Splinter Cell"},{"id":35706,"name":"SC1"},{"id":35707,"name":"Splinter Cell 1"},{"id":41784,"name":"Splinter Cell 1"},{"id":41785,"name":"SC1"}],"cover":{"id":138418,"alpha_channel":false,"animated":false,"game":910,"height":1600,"image_id":"co2ysy","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ysy.jpg","width":1200,"checksum":"fca48163-c39d-160e-bdee-a1e0f0421ff7"},"first_release_date":1037059200,"franchise":{"id":9,"name":"Tom Clancy"},"genres":[{"id":5,"name":"Shooter"},{"id":24,"name":"Tactical"}],"involved_companies":[{"id":100559,"company":{"id":38,"name":"Ubisoft Montreal"},"created_at":1591056000,"developer":true,"game":910,"porting":false,"publisher":false,"supporting":false,"updated_at":1591056000,"checksum":"6689a0eb-05d4-9b5e-290e-666ca3bbc8b1"},{"id":100560,"company":{"id":398,"name":"Ubisoft Shanghai"},"created_at":1591056000,"developer":false,"game":910,"porting":true,"publisher":false,"supporting":false,"updated_at":1591056000,"checksum":"17b47ad8-a549-85a8-76ae-a156e9ec9bf2"},{"id":100561,"company":{"id":73,"name":"Aspyr Media"},"created_at":1591056000,"developer":false,"game":910,"porting":true,"publisher":false,"supporting":false,"updated_at":1591056000,"checksum":"04892024-8c78-de30-b575-43654ba43962"}],"name":"Tom Clancy's Splinter Cell","screenshots":[{"id":161,"game":910,"height":819,"image_id":"osk9fgnqbkmvpy3uzdki","url":"//images.igdb.com/igdb/image/upload/t_thumb/osk9fgnqbkmvpy3uzdki.jpg","width":1024,"checksum":"da5a4f8f-fb6c-bdca-b20d-a8da24b9498f"},{"id":162,"game":910,"height":768,"image_id":"xlbfh15qbodwa4rhopua","url":"//images.igdb.com/igdb/image/upload/t_thumb/xlbfh15qbodwa4rhopua.jpg","width":1024,"checksum":"75a2bafa-9393-0910-930d-6a9c39ed5ecb"},{"id":833,"game":910,"height":600,"image_id":"lyloewxlqoe8vlvk3qvl","url":"//images.igdb.com/igdb/image/upload/t_thumb/lyloewxlqoe8vlvk3qvl.jpg","width":800,"checksum":"17b7d21c-53d5-d64f-ffba-996bf38a6bf9"},{"id":834,"game":910,"height":600,"image_id":"jlrcmjkzzfe4qzmizvc7","url":"//images.igdb.com/igdb/image/upload/t_thumb/jlrcmjkzzfe4qzmizvc7.jpg","width":800,"checksum":"dbfa0559-cf29-fbfc-f2d4-c079f8ab4705"},{"id":835,"game":910,"height":600,"image_id":"zylmk1vqs5naozsmj2tq","url":"//images.igdb.com/igdb/image/upload/t_thumb/zylmk1vqs5naozsmj2tq.jpg","width":800,"checksum":"64a36a5e-066d-c474-13d3-f32d4f0e5d47"}],"slug":"tom-clancy-s-splinter-cell","storyline":"In April 2004, the President of Georgia is assassinated, allowing Georgian billionaire Kombayn Nikoladze to seize power with a bloodless coup d'état. In August 2004, former U.S. Navy SEAL officer and Gulf War veteran Sam Fisher is recruited by the National Security Agency to work within its newly formed division, \"Third Echelon.\" Working with his old friend Irving Lambert, Fisher is introduced to technical expert Anna \"Grim\" Grimsdóttír, and field runner Vernon Wilkes Jr.\n\nIn October 2004, Fisher is dispatched to Tbilisi, Georgia to investigate the disappearance of two CIA officers. Fisher attempts to meet an informant, Thomas Gurgenidze, only to find him dying in a burning building. Gurgenidze warns that one agent's transmission mentioned proof that could cause a war. Finding the agents' corpses in a police morgue, Fisher learns that a former Spetsnaz agent, Vyacheslav Grinko, removed their subdermal tracking implants. Tracking Grinko's license plate number using CCTV, Third Echelon tracks him to the Georgian Ministry of Defense.\n\nFisher arrives at the Ministry, and records a meeting between Grinko and Canadian hacker Phillip Masse, through which he learns that Nikoladze is conducting an illegal operation in Azerbaijan. Fisher hacks Nikoladze's computer, and learns Nikoladze has been waging an ethnic cleansing campaign across Azerbaijan, by deploying Georgian commandos. In retaliation, NATO forces enter Azerbaijan, prompting Nikoladze to go underground.\n\nThird Echelon learns that Georgian soldiers stationed on a Caspian oil rig have been exchanging data with the Georgian Presidential Palace. Fisher infiltrates the rig during the middle of a NATO airstrike to apprehend a local technician, Lejava, and retrieve his laptop containing the rig's computer data. After interrogating the technician, Fisher learns that the data contains a file on \"The Ark\", Fisher recovers his laptop and encryption key and extracts.\n\nExamining Lejava's laptop, Grim reveals that the intel could have come from a CIA mole. Lambert then reveals that North America has just been hit by a massive cyber warfare attack, directed primarily against military targets. In a broadcast, Nikoladze claims responsibility for the attack and officially declares war on the United States and its allies. Fisher infiltrates the CIA headquarters and accesses the CIA computer mainframe, allowing Grim to trace the data leak to the computer of Mitchell Dougherty. Captured for interrogation, Dougherty claims ignorance of the leak, but the NSA learns that his obsessive–compulsive disorder caused him to back up data on an insecure laptop, which was exploited by a network owned by Kalinatek, Inc.\n\nGeorgia-hired mafiosos attempt to remove all traces of Nikoladze from the Kalinatek offices by destroying the building and murdering the staff. Intercepting a 911 call from a technician named Ivan, Fisher is deployed to the building and retrieves Ivan's encryption key while the FBI rescues Ivan. Fisher extracts with the help of Wilkes, who is mortally wounded in the process and later dies. Using the encryption key, the NSA discovers Nikoladze has been using a network of unconventional relays to communicate with Georgian military cells. The NSA traces the full relay network to the Chinese Embassy in Yangon, Myanmar. Worried Chinese support could cause World War III, Fisher sneaks into the embassy and eavesdrops on a conversation between Nikoladze and General Kong Feirong, and learns they are working together.\n\nFisher learns that captured U.S. Army soldiers and high-ranking Chinese officials are in a local slaughterhouse, so he delays interrogating Feirong to save the hostages, who are scheduled to be executed on a live broadcast. Fisher meets with a Chinese official among the hostages, and learns that Feirong is part of a rogue collective not backed by the Chinese government. Fisher is detected, and in a firefight, Fisher kills Grinko. Returning to the embassy, Fisher grabs a drunken Feirong before he can commit suicide, and forces him to share the information stored on his computer; the information reveals Nikoladze has fled back to Georgia, where he is trying to activate a suitcase nuke known as \"The Ark\".\n\nInfiltrating the Georgian Presidential Palace containing Nikoladze and new de facto Georgian president Varlam Cristavi, Fisher attempts to recover the key to the Ark, which has been placed somewhere in the United States. Fisher corners Nikoladze, who bargains to give the Ark key in exchange for safe passage out of Georgia; before Fisher can recover it, Cristavi soldiers take Nikoladze and the Ark key elsewhere. About to be executed, Fisher escapes when Lambert causes a brief blackout. Discovering Nikoladze is offering the Ark's location for protection, Fisher assassinates Nikoladze. Discovering the Ark, the U.S. Army evacuates an apartment complex in Hope Gate, Maryland on claims of a gas leak, and secretly recovers the Ark.\n\nDespite World War III being averted, Nikoladze's corpse sparks international backlash due to the suspicious circumstances around his death. Watching the Presidential broadcast on the crisis, Fisher then receives a secure phone call from Lambert for another assignment.\n\n[from Wikipedia.org]","summary":"Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace!\n\nYou are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyber terrorism and international tensions are about to explode into WWIII.","total_rating":84.05193288742475,"total_rating_count":300,"url":"https://www.igdb.com/games/tom-clancy-s-splinter-cell","videos":[{"id":656,"game":910,"name":"Splinter Cell Intro","video_id":"VlVxOhiKe-s","checksum":"d48cb14d-6608-cd9e-168c-c0837042bd79"}]}