{"id":4237,"cover":{"id":79282,"alpha_channel":false,"animated":false,"game":4237,"height":1672,"image_id":"co1p6a","url":"//images.igdb.com/igdb/image/upload/t_thumb/co1p6a.jpg","width":1254,"checksum":"855fdcde-39cc-be0f-f882-aa67bad569d3"},"first_release_date":788918400,"genres":[{"id":2,"name":"Point-and-click"},{"id":9,"name":"Puzzle"},{"id":15,"name":"Strategy"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":24711,"company":{"id":6013,"name":"Mechadeus"},"created_at":1436745600,"developer":true,"game":4237,"porting":false,"publisher":false,"supporting":false,"updated_at":1436832000,"checksum":"0f36edf9-a838-c3d6-2112-fa778649a96a"},{"id":24712,"company":{"id":6014,"name":"PalmSoft"},"created_at":1436745600,"developer":true,"game":4237,"porting":false,"publisher":false,"supporting":false,"updated_at":1436832000,"checksum":"ced7c5dc-a86a-dbd6-bc4a-e77d3331b5a3"},{"id":24713,"company":{"id":141,"name":"Virgin Interactive Entertainment (Europe) Ltd."},"created_at":1436745600,"developer":false,"game":4237,"porting":false,"publisher":true,"supporting":false,"updated_at":1436832000,"checksum":"8c025178-6401-c127-cc6c-2850edf7c6ca"},{"id":24714,"company":{"id":2420,"name":"Panasonic"},"created_at":1436745600,"developer":false,"game":4237,"porting":false,"publisher":true,"supporting":false,"updated_at":1436832000,"checksum":"90b05820-5702-4089-bf4e-d83e5755a512"}],"name":"The Daedalus Encounter","screenshots":[{"id":11017,"game":4237,"height":480,"image_id":"jefhiefdcc1avplktudn","url":"//images.igdb.com/igdb/image/upload/t_thumb/jefhiefdcc1avplktudn.jpg","width":640,"checksum":"933d66f1-b139-6c69-5101-27c2ff37f2fd"},{"id":11018,"game":4237,"height":480,"image_id":"wpetp7lhoshinb9tbfdd","url":"//images.igdb.com/igdb/image/upload/t_thumb/wpetp7lhoshinb9tbfdd.jpg","width":640,"checksum":"53e69ae6-0bf0-dffa-d324-e350c5998fac"},{"id":11019,"game":4237,"height":480,"image_id":"fighgkhl1hvsoz264n6i","url":"//images.igdb.com/igdb/image/upload/t_thumb/fighgkhl1hvsoz264n6i.jpg","width":640,"checksum":"57259857-ab36-b060-1718-25d1a2db9b2f"},{"id":11020,"game":4237,"height":479,"image_id":"lcahj6hv6g0sv4tof4ve","url":"//images.igdb.com/igdb/image/upload/t_thumb/lcahj6hv6g0sv4tof4ve.jpg","width":640,"checksum":"9a1fac1c-c587-78ca-3d1d-54252331441b"}],"slug":"the-daedalus-encounter","storyline":"The game follows a trio of space marines who fought in an interstellar war: Casey (the player character), Ari (Tia Carrere) and Zack (Christian Bocher). The game opens, and the story begins, just as Casey has been brought back to life by his partners. After being in a horrible space accident, Casey's body irreparably damaged, and he is now only a brain grafted in a life-support system on their spaceship. The player can interact with the world through a small remote controlled flying probe, which is launched from the ship shortly after the start of the game. In this new form, Casey possesses limited ability to interact with his environment, his only way to communicate being through a yes/no interface and by emitting light pulses. Upon awakening, Casey finds out that the war is over and that Ari and Zack have become pirates on board their ship, the Artemis, stealing salvage from the war to survive. During a salvage mission, the trio crash into and are stranded on a derelict alien spacecraft, which is on a collision course with the star. It is up to Casey to help his partners and explore the mystery of the Daedalus spaceship.\n\nIn order to save themselves, the trio must explore the huge alien ship and solve a large number of mind puzzles, such as connecting colored laser-beams with mirrors, unlock a door with rotating shapes, playing an advanced form of connect-the-dots with a computer interface, and one combat sequence, battling aliens called Krin. The puzzles are mixed with acting sequences from Carrere and Bocher, whose interaction with the player creates some light-hearted comedy. Numerous alternate scenes and clips were filmed and edited into game play. The alternate scenes appear depending on the player’s choice of game play.\n\nDuring the exploration of the alien ship, Ari and Zack enter a Central Hub containing six doors in the shape of hexagons. They explore areas of the ship behind each door but do not find any navigational controls. However, Casey finds six purple orbs (one in each of the six areas behind the six doors). The orbs cause the beam of blue light and fountain of white lights in the middle of the Central Hub to fade away as a diver’s suit shaped device with a cannon on top of it appears. Ari and Zack insert the orbs into it, Casey brings part of an alien’s hand from the ship’s Sick bay (which is behind one of the Central Hub doors) and places it on the device. It activates an elevator which takes Ari, Zack and Casey up and out of the Central Hub.\n\nThe alien ship approaches the Sun and temperature inside starts to rapidly increase. Outside, the remaining Krin flee the ship, but some of them are destroyed in the heat. The elevator brings Ari, Zack and Casey into a control room where the device (which the orbs were inserted into) vanishes, revealing a fish-shaped shell. Ari and Zack notice a live alien and Casey goes over to communicate with it.\n\nIt is noteworthy that three endings were filmed:\n\nThe alien ship reaches the Sun and the Artemis burns and explodes in the heat.\nThe alien doesn't respond to Casey and Zack shoots it with his laser gun. The alien knocks Zack aside and attacks Ari. Ari kills the alien and the shell hatches into the Queen alien. Ari kills it and Casey changes the course of the ship, steering it away from the Sun. Ari assumes that Zack is dead and cries over his body, telling Casey that he was wrong about there being no such thing as a hopeless situation.\nThe alien responds to Casey and as the alien ship reaches the star, a force field appears around the Artemis and protects it from the intense heat. The fish-shaped shell turns out to be an egg, which hatches into a giant red alien Queen. The live alien, Ari, Zack and Casey bow to it.\nIn a voice over, Ari explains that the force field created by the creatures which called themselves \"Seddy\" protected them and the ship from the intense heat. The Krin either fled or were destroyed and the new Queen possessed \"race memory\" and being able to speak and know; she helped Casey’s translation abilities, answered many of Ari’s and Zack’s questions and repaired the Artemis. Zack receives a transmission from the Daedalus, wishing them a safe voyage and may their paths cross again. Zack tells Casey that he was right about there being \"no such thing as a hopeless situation\" and tries to convince Ari to join him on the mattress in the station room. Ari says nothing, and Zack murmurs, \"Or not,\" as the Artemis speeds off into outer space.","summary":"The Daedalus Encounter is an interactive movie puzzle adventure game developed by Mechadeus and published by Virgin Interactive for MS-DOS and 3DO. The premise of the game is that there are three space marines who have fought as part of an interstellar war. One of them, Casey, has been brought back to life by his partners after a space accident and he is now a brain grafted in a life-support system. In order to save themselves, the three characters and the player solve all sorts of puzzles.\n\nThe use of actress & Model Tia Carrere (Wayne's World, True Lies) as one of the main protagonist was heavily used as part of the game marketing.","total_rating":71.3707865168539,"total_rating_count":6,"url":"https://www.igdb.com/games/the-daedalus-encounter","videos":[{"id":4638,"game":4237,"name":"Trailer","video_id":"P-jx0fLfiFo","checksum":"f7f1b6e3-1224-d4d6-ff2d-dde9481ec9db"},{"id":4639,"game":4237,"name":"Game intro","video_id":"FMsGNU83SpQ","checksum":"5d0f5a3f-197f-93f8-0340-8fa9a62f306f"}]}