{"id":201319,"alternative_names":[{"id":113658,"name":"ダブルドラゴン "}],"collection":{"id":694,"created_at":1390810623,"games":[4475,5968,6384,6787,6790,9929,10194,21001,23805,26621,46277,48923,71231,79335,136134,138806,175799,198727,198728,198729,198931,200154,201319,201321,201322],"name":"Double Dragon","slug":"double-dragon","updated_at":1668435679,"url":"https://www.igdb.com/collections/double-dragon","checksum":"214108bb-0408-5032-89a8-e597c135ce34"},"cover":{"id":229313,"alpha_channel":false,"animated":false,"game":201319,"height":826,"image_id":"co4wxt","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4wxt.jpg","width":620,"checksum":"18d0acf1-1ed1-023a-7cea-a885d5a34249"},"first_release_date":576460800,"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"},{"id":33,"name":"Arcade"}],"involved_companies":[{"id":180452,"company":{"id":1218,"name":"Arc System Works"},"created_at":1658804430,"developer":true,"game":201319,"porting":false,"publisher":true,"supporting":false,"updated_at":1658804826,"checksum":"01342205-b1db-1eb9-b8aa-c65897aafb41"},{"id":189792,"company":{"id":1753,"name":"Technos Japan"},"created_at":1664980459,"developer":true,"game":201319,"porting":false,"publisher":true,"supporting":false,"updated_at":1665005679,"checksum":"b614c34a-19b1-41c7-b38b-02b4b547ff04"}],"name":"Double Dragon","slug":"double-dragon--6","summary":"The NES version of Double Dragon takes a wide range of liberties with the interpretation. The entire graphical style is more in line with Technōs’ Kunio-kun series, with characters that go for exaggerated expression rather than gritty realism.\n\nThe biggest change, however, was reserved for the moveset. You start the game with only the punch, kick and headbutt available – all the other moves are obtained via an RPG-lite style experience system. Hitting enemies is now rewarded with a certain amount of experience points depending on the attack, and each time the counter goes above 999, you’re awarded an additional heart, which extends the range of possible actions. Two hearts add the uppercut and roundhouse kick combo finishers, and with three Billy can perform the jump kick maneuver. The fourth heart unlocks access to grappling moves.\n\nThe Game Boy rendition of Double Dragon plays like somewhat of a mix between the arcade and NES versions, although it’s closer to the latter. The controls are all NES, but the RPG elements were dropped and Billy got all his moves ready from the start. The ground attack is gone, but so is the head butt, making for a rather slim arsenal of maneuvers. The game is mostly based on the NES version except for Abobo, who looks even more deformed and has learned Burnov’s grapple from Double Dragon II. The second stage has become even more elaborate, and later parts include some of the new traps from the NES Double Dragon II like the floor that starts giving away.","total_rating":50.7704537167124,"total_rating_count":5,"url":"https://www.igdb.com/games/double-dragon--6"}