{"id":172517,"cover":{"id":181359,"alpha_channel":false,"animated":false,"game":172517,"height":2100,"image_id":"co3vxr","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3vxr.jpg","width":1525,"checksum":"3af355ec-3098-ad18-84de-fa741d81bcf3"},"first_release_date":607392000,"genres":[{"id":4,"name":"Fighting"},{"id":8,"name":"Platform"}],"involved_companies":[{"id":150539,"company":{"id":1819,"name":"Shouei System"},"created_at":1632680604,"developer":true,"game":172517,"porting":false,"publisher":false,"supporting":false,"updated_at":1632685758,"checksum":"725765d6-5ce5-fb23-3b19-f403c875e034"},{"id":150540,"company":{"id":1136,"name":"Taxan"},"created_at":1632680604,"developer":false,"game":172517,"porting":false,"publisher":true,"supporting":false,"updated_at":1632685758,"checksum":"66a45695-46b8-2f79-8f87-a708c96d19b5"}],"name":"Fist of the North Star","slug":"fist-of-the-north-star","storyline":"After the death of Raoh, the Central Imperial Capital, a city ruled by the Tentei, has been in great confusion. Kenshiro returns to assists the now grown Bat and Rin as they lead the Hokuto Army resistance against the Tentei's corrupt imperial forces. As Kenshiro ventures into the Capital, he confronts the Four Generals of Gento and their leader Falco the Gold.","summary":"Fist of the North Star is a side-scrolling action video game produced by Toei Animation and developed by Shouei System for the Nintendo Entertainment System (NES). It was first released in Japan under the title Hokuto no Ken 2 (Japanese: 北斗の拳2)[a] on April 17, 1987, being the second Hokuto no Ken video game released for the Family Computer (Famicom) by the anime production company (which briefly entered the video game publishing business after their success with the original Hokuto no Ken game for the Famicom in 1986),[1] while also serving as a tie-in to the Hokuto no Ken 2 anime series which began airing on Fuji TV a few weeks earlier. Taxan published the localized NES version on April 1989, making it one of the earliest Fist of the North Star products released in the U.S. alongside Viz Communications' English adaptation of the manga.","url":"https://www.igdb.com/games/fist-of-the-north-star"}