{"id":18532,"cover":{"id":182309,"alpha_channel":false,"animated":false,"game":18532,"height":2045,"image_id":"co3wo5","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3wo5.jpg","width":1534,"checksum":"6e18bf1d-a994-9eef-511a-c4cb660a3168"},"first_release_date":569721600,"genres":[{"id":14,"name":"Sport"}],"involved_companies":[{"id":149412,"company":{"id":773,"name":"Nintendo EAD Tokyo"},"created_at":1631983504,"developer":true,"game":18532,"porting":false,"publisher":false,"supporting":false,"updated_at":1631983958,"checksum":"114e5dfd-d300-ad92-4816-0d87e3a601c0"},{"id":154528,"company":{"id":70,"name":"Nintendo"},"created_at":1635171948,"developer":false,"game":18532,"porting":false,"publisher":true,"supporting":false,"updated_at":1635171988,"checksum":"335ec3c9-47d5-f6e8-c5d3-b0da2e7f703d"}],"name":"Ice Hockey","screenshots":[{"id":22236,"game":18532,"height":1080,"image_id":"erz6jc2z9piebd0iyzhk","url":"//images.igdb.com/igdb/image/upload/t_thumb/erz6jc2z9piebd0iyzhk.jpg","width":1440,"checksum":"fc0aa03d-2839-a2df-3ee3-d99961180521"},{"id":22237,"game":18532,"height":720,"image_id":"h4g3mlj1iqfxjke9zquq","url":"//images.igdb.com/igdb/image/upload/t_thumb/h4g3mlj1iqfxjke9zquq.jpg","width":1280,"checksum":"e1e7ce5e-e75e-872c-e770-6b54f9f96754"}],"slug":"ice-hockey","storyline":"The play and mechanics of Ice Hockey are mostly similar to that of ice hockey in real life. The objective for both team is to hit a black puck with a hockey stick that each player carries into the opponent's goal. Teams are made up of five players including the goaltender, as opposed to six in real life. Players wear ice skates, which are used to skate across the icy arena. Each game is made up of three periods, with the victory going to the team who has the most points at the end of the game. At the beginning, two opposing players from each team face off in the middle of the rink. There are three kinds of players - the first is fast, weak, and feeble, but is good at the face-off; the second is average in all qualities, and the third is slow and poor at the face-off, but very powerful, both in body checking and shooting strength. The arena is similarly designed to a real-world ice hockey arena. The arena is coated in ice, with a goal on either side of the arena. There are a variety of marked areas, including the goal line that the puck must cross to score, the attacking / defending zone which is situated closely to each goal, the face-off spot, the neutral spot, and others. Each side of the arena has exactly the same design. If two opposing players fight for the puck for a certain amount of time, other players join into the fight, resulting in the player from the losing team in the fight to be put in the penalty box for a period of time.","summary":"It's fast skating', hip checkin', high scoring action. Lead your team into center ice, over the opponent's blue line. Pass over to the point and set up for the tip in - Score! Choose a country for you and your opponent, select a level of play and face off at center ice to become the top goal scorer in Nintendo's Ice Hockey! Get charged with a penalty and test your defense. Or attack on a power play and use your puck handling skills to catch your opponents off guard.","total_rating":70.9690895582409,"total_rating_count":22,"url":"https://www.igdb.com/games/ice-hockey","videos":[{"id":7635,"game":18532,"name":"Gameplay video","video_id":"AAVuhM6r9JE","checksum":"36d3fb46-6e92-90cb-1351-69e2eb3a8caa"}]}