{"id":142116,"cover":{"id":123724,"alpha_channel":true,"animated":false,"game":142116,"height":800,"image_id":"co2ngs","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ngs.jpg","width":600,"checksum":"a71b88f8-f25f-54d5-c8ae-19b94bd491c8"},"first_release_date":1614556800,"genres":[{"id":8,"name":"Platform"}],"involved_companies":[{"id":115873,"company":{"id":20279,"name":"KHAN Games"},"created_at":1609545600,"developer":true,"game":142116,"porting":false,"publisher":true,"supporting":false,"updated_at":1609632000,"checksum":"0dbee197-14bb-6a88-1177-e28b972be4bc"}],"name":"Chumlee's Adventure: The Quest for Pinky","screenshots":[{"id":415809,"alpha_channel":false,"animated":false,"game":142116,"height":441,"image_id":"sc8wu9","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8wu9.jpg","width":670,"checksum":"a1286406-5a5a-9078-a329-172e8122338a"},{"id":415810,"alpha_channel":true,"animated":false,"game":142116,"height":1358,"image_id":"sc8wua","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8wua.jpg","width":1711,"checksum":"ba363ccc-ad06-92d0-75f7-c829bf444b35"}],"slug":"chumlees-adventure-the-quest-for-pinky","storyline":"The hustle and bustle at the World Famous Gold & Silver Pawn Shop has been part of the fabric of Las Vegas for the past thirty years. No one knows this better than Chumlee. \n \nChumlee has been an employee at the pawn shop for over 15 years and has seen it all, from priceless artifacts to worthless knock off items. He’s put in thousands of hours of hard work and now he’s finally ready for a break! \n \nJoin everyone’s favorite pawn broker Chumlee as he navigates his way through the ever busy pawn shop to enjoy a day in the sun with his pup Pinky! Make your way past the countless customers and their unique items. Battle it out with Antwaun, Corey & Rick before a final encounter that will blow your mind! \n \nAre you ready for the challenge? Are you ready to “Be Awesome”? Get out there or get back to “Work”!","summary":"Chumlee's Adventure: The Quest for Pinky is a brand new, authentic game created for the Nintendo Entertainment System. Taking inspiration from NES games of old, Chumlee's Adventure: The Quest for Pinky is a platformer adventure game where you'll face off against the friends you know and love from Pawn Stars, the hit TV show as seen on the History Channel. This game is an official release, incorporating their direct input and made in conjunction with the show's stars and producers.","url":"https://www.igdb.com/games/chumlees-adventure-the-quest-for-pinky"}