{"id":138793,"cover":{"id":114418,"alpha_channel":false,"animated":false,"game":138793,"height":2100,"image_id":"co2gaa","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2gaa.jpg","width":1528,"checksum":"23880b33-b400-b23e-be5a-5c40caf7e5d2"},"first_release_date":652147200,"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"}],"involved_companies":[{"id":107937,"company":{"id":129,"name":"Konami"},"created_at":1599868800,"developer":true,"game":138793,"porting":false,"publisher":false,"supporting":false,"updated_at":1599868800,"checksum":"f7b0d410-0c44-c58b-2f3e-e1a2ba390ed7"},{"id":107938,"company":{"id":310,"name":"Ultra Games"},"created_at":1599868800,"developer":false,"game":138793,"porting":false,"publisher":true,"supporting":false,"updated_at":1599868800,"checksum":"c6efb015-14b4-457f-7c37-4594d678b4ca"}],"name":"Rollergames","slug":"rollergames--1","summary":"Is nothing sacred? RollerGames™, the 21st Century's most popular thrill sport, is the latest victim of V.I.P.E.R. (Vicious International Punks and Eternal Renegades). With their greedy eyes on RollerGames' mega prize money, they've corrupted three teams and kidnapped Emerson \"Skeeter\" Bankhead, the games' beloved commissioner. \nYou and your own three teams of righteous skate kings must stop V.I.P.E.R.'s criminal venom from infecting the entire city. So you've got to take the fight to the streets. And the sewers, and the junkyards, and the highways and the jungles . . . through six stages of dastardly traps of doom as you leap over open manholes, careening oil drums and treacherous land-slides. Race around oil slicks and man-eating canines. And avoid ambush by combat copters, bomb-wielding goons and creeps like Captain Meat Hook and the Fish Face. But time is against you. And so are V.I.P.E.R.'s judo masters, skateboard thugs, motorcycle madmen and other assorted sinister scum. \nIf your multi-faceted fists can't punch you through, you'll need your special assault body blocks, jump kicks and double whammy slams. \nIt's a bone-crunching skate-athon for your life, Skeeter's life, and for the good of RollerGames™. So vanquish V.I.P.E.R. before they melt your ball bearings into bullets.","url":"https://www.igdb.com/games/rollergames--1"}