{"id":2863,"alternative_names":[{"id":28623,"name":"Wizardry I"},{"id":28624,"name":"Wizardry 1"},{"id":53433,"name":"Wizardry Scenario #1: Proving Grounds of the Mad Overlord"},{"id":92267,"name":"ウィザードリィ 狂王の試練場"}],"cover":{"id":228127,"alpha_channel":true,"animated":false,"game":2863,"height":800,"image_id":"co4w0v","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4w0v.jpg","width":600,"checksum":"681bbdf8-a56a-ba60-7d3c-3e3e4bdd1c67"},"first_release_date":368150400,"genres":[{"id":12,"name":"Role-playing (RPG)"}],"involved_companies":[{"id":39432,"company":{"id":273,"name":"Sir-tech Software"},"created_at":1473724800,"developer":true,"game":2863,"porting":false,"publisher":true,"supporting":false,"updated_at":1473724800,"checksum":"2e3926bf-9c64-442a-2890-0b510ab599f6"},{"id":57514,"company":{"id":1743,"name":"ASCII Corporation"},"created_at":1510099200,"developer":false,"game":2863,"porting":false,"publisher":true,"supporting":false,"updated_at":1510099200,"checksum":"0745a568-8c65-3343-9df8-bab5deb44aba"},{"id":57515,"company":{"id":273,"name":"Sir-tech Software"},"created_at":1510099200,"developer":true,"game":2863,"porting":false,"publisher":false,"supporting":false,"updated_at":1510099200,"checksum":"b7911569-c98d-6583-587a-1a452c31f84d"},{"id":64051,"company":{"id":617,"name":"Bandai"},"created_at":1523059200,"developer":false,"game":2863,"porting":false,"publisher":true,"supporting":false,"updated_at":1523059200,"checksum":"e75aea79-b061-51f5-37d2-982d15c92f34"}],"name":"Wizardry: Proving Grounds of the Mad Overlord","screenshots":[{"id":415010,"alpha_channel":false,"animated":false,"game":2863,"height":144,"image_id":"sc8w82","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8w82.jpg","width":160,"checksum":"9e2b5874-e7e7-5da4-71c1-7650ed0c68eb"},{"id":415011,"alpha_channel":false,"animated":false,"game":2863,"height":144,"image_id":"sc8w83","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8w83.jpg","width":160,"checksum":"e6a44590-757f-f323-4136-b34045d02c30"},{"id":415012,"alpha_channel":false,"animated":false,"game":2863,"height":144,"image_id":"sc8w84","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8w84.jpg","width":160,"checksum":"55ff03be-3783-9201-8d77-70812a91b9d2"}],"slug":"wizardry-proving-grounds-of-the-mad-overlord","storyline":"The land of Llylgamyn is the basis of many legends. It is the center of commerce throughout the land, and home of the academy where some of the bravest warriors are trained. In it's early days it was a monarchy ruled by the royal family, but as time passed the power shifted to aristocrats and theocrats, and eventually the royal family became more symbolic then anything else.\n\nUnder a more democratic system, the High Council of Sages appointed an Overlord to govern over the kingdom. With that, the power of the royal family diminished almost completely. The Overlord was a former warrior of the realm, and a local hero. His name was Trebor. At first everything seemed well, but as time went by Trebor's thirst for power began to show. He began searching for ways to expand his rule. He learned of an ancient amulet held in a forgotten temple somewhere outside of the kingdom. Eventually, through unknown means he was able to find it's hidden location. He gathered his best men and sent them on a mission to retrieve this legendary artifact. They returned successful. Trebor, however, was not the only person who wanted this artifact. Only hours behind him in reaching it's original destination was the evil wizard Werdna (arch-enemy of Trebor). When Werdna discovered that someone had found the amulet before him he grew very angry. Using his magic he was able to discover it's new location. That evening the Wizard made his assault on Overlord's Castle. Making himself invisible he was able to sneak past Trebor's guards. He found the overlord sitting in his throne room with a group of sages studying the amulet. Werdna cast a powerful spell that made Trebor and everyone in his immediate vicinity frozen with fear. With Trebor unable to move, Werdna plucked the amulet right from his hands and left the castle.\n\nWerdna knew that once the Trebor regained his senses he would be prime suspect. He couldn't return to his tower, he needed a new hiding place. That's when he was struck with a brilliant idea. Werdna decided to use to amulet to make a new home right beneath the city of Llylgamyn! There was enough underground mining activity already, he should go unnoticed. Upon the thought of this very plan, the amulet began to glow. Suddenly there was tremendous earthquake, and in a flash Werdna found himself in a giant ten level labyrinth in the ground below the city. Summoning monsters to be his allies Werdna explored his way to the lowest depths and made a home where he would be able to study the powers of the amulet undisturbed.\n\nAfter losing the amulet and discovering the existence of the mysterious maze beneath his city, Trebor became unhinged. His madness grew daily, all he could think of was getting his amulet back. He called for the greatest warriors in the realm to enter the maze and find Werdna, but the monsters grew greater in numbers and they began to spread to even the highest depths of the maze.\n\nA year after the discovery of the maze, Trebor had managed to secure the first four floors. Most of the warriors who tried to journey deeper were never seen again, those that were returned with their minds warped, speaking of demons and dark magic. Trebor ordered the passages to the deeper layers of the maze to be magically sealed, thus preventing these creatures from making their way to the town. He also ordered that traps be set on the first three layers. Upon completion, Trebor declared the maze his own personal proving grounds. New cadets enrolled in the training academy would be offered the opportunity to brave the maze. Those that could find the secret he had hidden for them would be rewarded. Trebor decided he could use the maze as a test, those that would be able to able to make their way to the fourth floor would be deemed worthy and told the truth about Werdna and the amulet. They would be given the chance to go deeper into the maze. If they could return with the amulet, they would be inducted as members of Trebor's Personal Guard.\n\nIt has been five years since the disappearance of the amulet, and this time it is your characters that have volunteered to challenge the maze.\n\nThis is where it all begins.","summary":"The Mad Overlord Trebor was once only power-mad, but went off the deep end after he acquired a magical amulet of immense power, only to have it stolen from him by his nemesis, the evil archmage Werdna. Werdna, not quite sure how to use the amulet properly, accidentally causes an earthquake which creates a ten-level dungeon beneath Trebor's castle. To avoid looking silly, Werdna declares the dungeon to be the new lair for him and his monster hordes. Trebor, not to be outdone, declares the labyrinth his new Proving Grounds where adventurers must prove themselves for membership in his elite honor guard, and incidentally retrieve his amulet in the process.\n\nThe first Wizardry was one of the original dungeon-crawling role-playing games, and stands along with Ultima and Might & Magic as one of the defining staples of the genre.\n\nThe player generates and control a party of up to six different adventurers, choosing from four races (humans, elves, dwarves, gnomes and hobbits), three alignments (good, neutral and evil), and four basic classes (fighter, priest, mage and thief). These can later evolve into elite classes (bishop: priest with mage spells; samurai: fighter with mage spells; lord: fighter with priest spells, and ninja: fighter with thief abilities) if they meet the necessary level requirements. After outfitting the party with basic weapons and armor, the player sends it into a 3D vector maze-like dungeon to fight monsters in turn-based combat and find treasure.","total_rating":69.4501171914866,"total_rating_count":9,"url":"https://www.igdb.com/games/wizardry-proving-grounds-of-the-mad-overlord","videos":[{"id":30519,"game":2863,"name":"Gameplay video","video_id":"3ZAOEXj6r-M","checksum":"ed9401d6-ba3e-44b5-16e6-9fc61610a282"}]}