{"id":5337,"cover":{"id":113152,"alpha_channel":false,"animated":false,"game":5337,"height":800,"image_id":"co2fb4","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2fb4.jpg","width":600,"checksum":"96a5b331-22d1-6e17-fb15-08894d6d34aa"},"first_release_date":770428800,"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"}],"involved_companies":[{"id":12907,"company":{"id":2351,"name":"Sony Imagesoft"},"created_at":1392076800,"developer":false,"game":5337,"porting":false,"publisher":true,"supporting":false,"updated_at":1392163200,"checksum":"c9809f94-352d-4410-7213-aaae7e8e3c46"},{"id":12908,"company":{"id":2352,"name":"Malibu Interactive"},"created_at":1392076800,"developer":true,"game":5337,"porting":false,"publisher":false,"supporting":false,"updated_at":1392163200,"checksum":"f1270847-6bbe-b58c-54e6-c8b1b0c5783b"}],"name":"3 Ninjas Kick Back","slug":"3-ninjas-kick-back","storyline":"Fifty years ago, the master samurai fought in a ninja tournament to win a magical dagger that together with an ancient samurai sword, is believed to be the key to unlocking a secret cave laden with riches. After winning the tournament and rightfully gaining the dagger, it was stolen by the master's archrival, Koga. Though the master searched far and wide, he never found any trace of Koga or the dagger. Now, too old to continue searching, the master sends his three young apprentices, the young ninja brothers, Rocky, Colt, and Tum-Tum, to assist him in retrieving the prized dagger.\n\nOnce it has been restored to its rightful owner, the dagger shall once again be passed along to younger generations, through the winners of the ninja tournament.","summary":"You first saw Rocky, Colt and Tum Tum on the silver screen when their martial arts skills and extreme exploits saved the honor of Grandfather Mori and defeated an evil arms dealer. Now, it’s up to you! In this action-packed adventure, you become any one of the 3 Ninjas. And that’s when the fun begins. Wild animals and even wilder ninjas attack! A trio of spaced-out heavy metal rockers join forces with the evil Koga in an all-out effort to do you dirty. But if you rescue Grandfather Mori and his ceremonial dagger, you’ll have the last laugh… and unlock a secret room filled with more gold than Fort Knox!","total_rating":47.8666421524961,"total_rating_count":7,"url":"https://www.igdb.com/games/3-ninjas-kick-back"}