{"id":14501,"alternative_names":[{"id":5709,"name":"Royal Blood"},{"id":5710,"name":"Super Royal Blood"},{"id":5711,"name":"ロイヤルブラッド"},{"id":5712,"name":"スーパーロイヤルブラッド"},{"id":44320,"name":"Royal Blood"},{"id":44321,"name":"Super Royal Blood"}],"cover":{"id":260995,"alpha_channel":false,"animated":false,"game":14501,"height":1152,"image_id":"co5ldv","url":"//images.igdb.com/igdb/image/upload/t_thumb/co5ldv.jpg","width":864,"checksum":"9aa416b0-8a93-2acb-24a8-475a518bc88a"},"first_release_date":665366400,"genres":[{"id":15,"name":"Strategy"}],"involved_companies":[{"id":91434,"company":{"id":630,"name":"Koei"},"created_at":1579824000,"developer":true,"game":14501,"porting":false,"publisher":true,"supporting":false,"updated_at":1579996800,"checksum":"bf91f7c8-0fc0-7e79-1597-3b4105640fa1"}],"name":"Gemfire","slug":"gemfire","summary":"Gemfire is a marvelous war strategy from KOEI game collection. The game offers the advanced military strategy and even multiplayer support, but only at the shared screen. The story of the game starts as follows:\n\nOnce upon a time, Ishmeria was a haven for elves, fairies and other creatures of lore. Yet one day an evil wizard wielded the powers of a Fire Dragon to destroy the peace. A legendary Pastha and 6 magicians fought the wizard and trapped the Dragon. But, the wizard cast a fateful curse, turning the magicians and Dragon into cold gems, which were placed upon the crown: The Gemfire.\nGemfire's powers preserved peace in Ishmeria, until King Eselred abused the magic for his greed. Then one day, the Pastha came to Princess Robyn to plea for her help. That very night she stole the crown and hurled the gems into the midnight sky! But before she could destroy the Dragon's ruby, King Eselred caught Robyn and seized the crown!\n\nIn search of virtuous leaders, the magicians flew to the far corners of Ishmeria. Still,to this day, they struggle against Eselred's wrath. The key to saving Ishmeria is in the hands of one ruler, the ruler who will reunite the magic of Gemfire...","url":"https://www.igdb.com/games/gemfire"}