{"id":11603,"alternative_names":[{"id":43099,"name":"Pac Man 2"}],"cover":{"id":130636,"alpha_channel":false,"animated":false,"game":11603,"height":1156,"image_id":"co2sss","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2sss.jpg","width":867,"checksum":"414bb98a-f1c2-8095-10f8-a459686e4418"},"first_release_date":765590400,"genres":[{"id":9,"name":"Puzzle"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":25105,"company":{"id":263,"name":"Namco"},"created_at":1438992000,"developer":true,"game":11603,"porting":false,"publisher":true,"supporting":false,"updated_at":1438992000,"checksum":"6b4d63e2-b29c-0f10-0fa7-91d6bc133261"}],"name":"Pac-Man 2: The New Adventures","screenshots":[{"id":14163,"game":11603,"height":480,"image_id":"iqvvte9ncki03wxttrux","url":"//images.igdb.com/igdb/image/upload/t_thumb/iqvvte9ncki03wxttrux.jpg","width":640,"checksum":"ff3f6dbd-50cb-e605-ac90-51311197edd2"},{"id":21346,"game":11603,"height":480,"image_id":"afiza9davnqpkbuzafhe","url":"//images.igdb.com/igdb/image/upload/t_thumb/afiza9davnqpkbuzafhe.jpg","width":640,"checksum":"c7f003c8-ec1d-508b-29c5-0220654c66e5"},{"id":21347,"game":11603,"height":360,"image_id":"sppnc782hsjx4ztpqnf0","url":"//images.igdb.com/igdb/image/upload/t_thumb/sppnc782hsjx4ztpqnf0.jpg","width":480,"checksum":"308eea15-76b7-e05c-1306-6bea7b46cc80"},{"id":168108,"game":11603,"height":223,"image_id":"xtwtgbtqdffv7hwa7fry","url":"//images.igdb.com/igdb/image/upload/t_thumb/xtwtgbtqdffv7hwa7fry.jpg","width":256,"checksum":"b303cf12-ad4b-b936-1311-c25825e86059"},{"id":168109,"game":11603,"height":224,"image_id":"mzb1p6ttadw1u6oiwaek","url":"//images.igdb.com/igdb/image/upload/t_thumb/mzb1p6ttadw1u6oiwaek.jpg","width":256,"checksum":"9eca42ad-76a0-de6a-9449-3315cdc87bf1"},{"id":168110,"game":11603,"height":224,"image_id":"jufr8z6hhqtpzm1umuy4","url":"//images.igdb.com/igdb/image/upload/t_thumb/jufr8z6hhqtpzm1umuy4.jpg","width":256,"checksum":"8ebccef5-e3e8-f938-0ee2-b697572c52a1"},{"id":168111,"game":11603,"height":223,"image_id":"ufxa3znmp4ct2mhtuhmv","url":"//images.igdb.com/igdb/image/upload/t_thumb/ufxa3znmp4ct2mhtuhmv.jpg","width":256,"checksum":"40971248-390a-a758-95e9-15cce984b643"},{"id":168112,"game":11603,"height":224,"image_id":"af5wchzeqfwgd3cusbo7","url":"//images.igdb.com/igdb/image/upload/t_thumb/af5wchzeqfwgd3cusbo7.jpg","width":256,"checksum":"5a5d7f4b-ef70-2879-b792-fb1bc5b0ed4a"}],"slug":"pac-man-2-the-new-adventures","storyline":"After an introductory sequence in which Pac-Man introduces himself and the game's mechanics, the plot unfolds as a loosely connected series of misadventures stemming from Pac-Man's quest to complete tasks for his family, all while the ghosts and their mysterious leader plot to destroy him. Pac-Man is first tasked with finding milk for Pac-Baby, which he procures from the local farm. Some time after, Pac-Man is asked by Ms. Pac-Man to pick a special flower for Lucy, a friend of Pac-Jr's, for her birthday. Pac-Man is given a trolley ticket which he uses to venture into the nearby mountains, hang-gliding and dodging ghosts and boulders as he searches for the flower. Upon returning home with the flower, Pac-Man is exasperated to find that Lucy's party has already started, and that she has already been given another flower. Some time after, Pac-Jr comes home crying, and tells his dad that his guitar was stolen by ghosts while he was in Pac-City. Pac-Man is given a train ticket to travel to the city, where he takes on disgruntled baloon salesmen and disgruntled security guards to get the guitar back. In the final segment of the game, Pac-Man discovers from a news report that the ghosts are stealing ABC gum from children all over Pac-City, at which point the Ghost Witch of Netor takes over the broadcast and challenges Pac-Man to face her and her newly created Gum Monster. He sets off to work his way through the abandoned factory where the monster is being created. The game culminates in a final battle between Super Pac-Man and the Gum Monster. After the Gum Monster's defeat, the Ghost Witch and her minions flee, and Pac-Man is congratulated by the town and his family as a hero, except that he didn't save their ABC gum.\nDuring the game, the player can direct Pac-Man to one of two video arcades where a conversion of the original Pac-Man (based on the NES version, but with 16-bit graphics) can be played. The player can also complete an optional side quest by collecting three missing cartridge pieces. Once completed, a bonus game is unlocked in the arcades – in the SNES version, the bonus game is Ms. Pac-Man, while in the Mega Drive/Genesis version, an exclusive game called Pac-Jr. is unlocked instead. Pac-Jr. is a graphic and level hack of Ms. Pac-Man, and not a conversion of the unauthorized arcade game Jr. Pac-Man. This was done because a Genesis version of Ms. Pac-Man was already released prior to this game and Namco did not own the rights to Jr. Pac-Man at the time.","summary":"Pac-Man 2: The New Adventures, known in Japan as Hello! Pac-Man, is a side-scrolling adventure game \"sequel\" to Pac-Man. Instead of being a maze game like the majority of its predecessors, Pac-Man 2 incorporates light point-and-click adventure game elements. It was produced and published by Namco for the Super Nintendo Entertainment System (SNES) and Sega Mega Drive/Genesis systems, and was released on April 6, 1994 by Namco. The game borrows its structure and certain elements from Pac-Land, and also appears to contain certain elements from the animated series, such as Pac-Man's family and a main villain commanding the ghosts. The Genesis version was not released in Japan or Europe.","total_rating":69.1337027995388,"total_rating_count":16,"url":"https://www.igdb.com/games/pac-man-2-the-new-adventures","videos":[{"id":5472,"game":11603,"name":"Gameplay video","video_id":"SEYxgqnK27c","checksum":"0b0280ae-ee93-ec92-7010-7bd9e0d41cf9"}]}