{"id":3164,"alternative_names":[{"id":38245,"name":"Prince of Persia 2"}],"collection":{"id":187,"created_at":1320263570,"games":[836,837,2437,2438,2468,2472,3164,3165,20485,21267,21715,21797,22020,22565,43430,44706,45292,47459,59596,99585,99586,134933,138383,142256,142472,142514,142650,142709,142710,142712,143442,154143,204142,204643,213263],"name":"Prince of Persia","slug":"prince-of-persia","updated_at":1668475607,"url":"https://www.igdb.com/collections/prince-of-persia","checksum":"cdc7a8b6-58be-8da2-ed6e-2bc01f76ad10"},"cover":{"id":112177,"alpha_channel":false,"animated":false,"game":3164,"height":800,"image_id":"co2ek1","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2ek1.jpg","width":600,"checksum":"13bc0b5f-69e9-390b-3091-a9e8bd4cdf5d"},"first_release_date":757296000,"genres":[{"id":8,"name":"Platform"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":117151,"company":{"id":195,"name":"Brøderbund Software"},"created_at":1610755200,"developer":true,"game":3164,"porting":false,"publisher":true,"supporting":false,"updated_at":1610928000,"checksum":"b6245af5-a326-b725-9802-3b6ef86e6f56"},{"id":117152,"company":{"id":1404,"name":"Titus Software"},"created_at":1610755200,"developer":true,"game":3164,"porting":false,"publisher":true,"supporting":false,"updated_at":1610928000,"checksum":"dcbb46b6-d18e-bc4b-d653-2744a7e5559b"},{"id":117153,"company":{"id":31206,"name":"Interprog"},"created_at":1610755200,"developer":true,"game":3164,"porting":false,"publisher":false,"supporting":false,"updated_at":1610928000,"checksum":"35866195-29d7-1864-54c4-6c94c937ffb3"}],"name":"Prince of Persia 2: The Shadow and the Flame","screenshots":[{"id":418283,"alpha_channel":true,"animated":false,"game":3164,"height":407,"image_id":"sc8yqz","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8yqz.jpg","width":647,"checksum":"388bd705-47a6-49f5-58a5-b1f007b296c7"}],"slug":"prince-of-persia-2-the-shadow-and-the-flame","storyline":"The game takes place eleven days after the events of the first game. During this period, the Prince was hailed as a hero who defeated the evil Jaffar. He turns down all riches and instead asks for the Princess's hand in marriage as his reward, to which the Sultan of Persia reluctantly agrees. The game begins as the Prince enters the royal courts of the palace. Before he enters, his appearance changes into that of a beggar. Nobody recognizes him, and when he attempts to speak with the Princess, a man who shares his appearance (Jaffar, who is magically disguised) emerges from the shadows, ordering him to be thrown out. With guards pursuing him, the Prince jumps through a window and flees the city by way of a ship. \n \nFalling asleep on the ship, the Prince dreams of a mysterious woman who asks the Prince to come to her. At this time, the ship is struck by lightning, cast by Jaffar. When the Prince regains consciousness, he finds himself on the shore of a foreign island. He comes to a cave full of reanimated human skeletons that fight him. He finally escapes on a magic carpet. In the meantime, in Persia, Jaffar seizes the throne in the guise of the prince. The Princess falls ill under Jaffar's spell of gradual death. \n \nThe magic carpet takes the Prince to the ruins of an old city filled with screaming ghosts, snakes and traps. Arriving at what appears to have once been a throne room, the Prince loses consciousness and the mysterious woman, revealed to be his mother, appears again. She explains that the Prince is of a royal lineage and the only survivor of the massacre by \"armies of darkness\". She implores him to avenge the fallen. \n \nThe Prince rides a magical horse to a red temple, inhabited by warrior monks wearing bird headdresses. There, he finds that the shadow, created in the events of the original game, can now leave his body at his will. He wields his shadow to obtain the magic flame of the temple, at which point the bird warriors kneel before him. He flies back to Persia on the magic horse and confronts Jaffar. With the shadow and the flame, the Prince burns Jaffar, killing him for good. \n \nWith Jaffar's spell broken, the Princess awakens. The Prince orders the former Vizier's ashes to be scattered. The game ends on a cliffhanger when an old witch is shown watching the happy couple through a crystal ball. According to Jordan Mechner the plot of the old witch and the \"armies of darkness\" were set to be resolved in a sequel, which never came.","summary":"Prince of Persia 2: The Shadow and the Flame is a platform game released as the sequel to 1989's Prince of Persia. Prince of Persia 2 was published for MS-DOS and ported to Macintosh, Super NES, and FM Towns – a much shorter list of platforms than the first game. It was also available as a bonus that unlocks in the Xbox NTSC version of Prince of Persia: The Sands of Time.","total_rating":50.46644421850255,"total_rating_count":31,"url":"https://www.igdb.com/games/prince-of-persia-2-the-shadow-and-the-flame","videos":[{"id":44620,"game":3164,"name":"Gameplay Video","video_id":"_VM3ECIH2wA","checksum":"09021d49-d166-313b-4fba-7df6e85af4d4"},{"id":44621,"game":3164,"name":"Gameplay Video","video_id":"vlrDnxDAEdw","checksum":"373e3e96-1970-6af5-8f58-b17871840b39"}]}