{"id":10495,"alternative_names":[{"id":35998,"name":"Wizardry 5"},{"id":35999,"name":"Wizardry V"},{"id":36000,"name":"BS Wizardry 5"},{"id":36001,"name":"BS Wizardry V"},{"id":77531,"name":"ウィザードリィ５"}],"collection":{"id":211,"created_at":1321568924,"games":[939,2500,2863,2865,2871,2885,10495,10496,10497,27131,42314,42528,43620,50047,50048,50049,59873,62399,63796,70521,123080,139301,150013,172724,181493],"name":"Wizardry","slug":"wizardry","updated_at":1667529944,"url":"https://www.igdb.com/collections/wizardry","checksum":"9f3dc57a-5047-5965-638b-66ac062359d9"},"cover":{"id":155192,"alpha_channel":false,"animated":false,"game":10495,"height":456,"image_id":"co3bqw","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3bqw.jpg","width":343,"checksum":"4d8c1a9e-8656-60a9-6292-d3a924b7db03"},"first_release_date":599529600,"genres":[{"id":12,"name":"Role-playing (RPG)"}],"involved_companies":[{"id":101088,"company":{"id":70,"name":"Nintendo"},"created_at":1591315200,"developer":false,"game":10495,"porting":false,"publisher":true,"supporting":false,"updated_at":1591315200,"checksum":"36b5d832-a215-cfc8-b67f-97c58063aca5"},{"id":101089,"company":{"id":25230,"name":"St. GIGA"},"created_at":1591315200,"developer":false,"game":10495,"porting":false,"publisher":true,"supporting":false,"updated_at":1591315200,"checksum":"c36207ee-64e1-44e3-7d5c-e89f1d3c6c1d"},{"id":101090,"company":{"id":37,"name":"Capcom"},"created_at":1591315200,"developer":false,"game":10495,"porting":false,"publisher":true,"supporting":false,"updated_at":1591315200,"checksum":"ac530e87-2c06-d87a-2c5b-50e1cfc913d4"},{"id":159845,"company":{"id":26079,"name":"Sir-Tech Software, Inc."},"created_at":1640822783,"developer":true,"game":10495,"porting":false,"publisher":true,"supporting":false,"updated_at":1640915087,"checksum":"57b23671-7b44-b910-5c9e-4b6491eed0d1"},{"id":159846,"company":{"id":1821,"name":"ASCII Entertainment"},"created_at":1640822783,"developer":true,"game":10495,"porting":false,"publisher":true,"supporting":false,"updated_at":1640915087,"checksum":"1c886f9a-64dc-a8a2-2fde-09ee992d3d8d"}],"name":"Wizardry V: Heart of the Maelstrom","screenshots":[{"id":818923,"alpha_channel":false,"animated":false,"game":10495,"height":384,"image_id":"schjvv","url":"//images.igdb.com/igdb/image/upload/t_thumb/schjvv.jpg","width":560,"checksum":"c7f879f6-50bd-795a-c365-9f8a42bfc855"},{"id":818924,"alpha_channel":false,"animated":false,"game":10495,"height":384,"image_id":"schjvw","url":"//images.igdb.com/igdb/image/upload/t_thumb/schjvw.jpg","width":560,"checksum":"5f342a55-d880-8097-2701-8740b194e6cc"},{"id":818925,"alpha_channel":false,"animated":false,"game":10495,"height":384,"image_id":"schjvx","url":"//images.igdb.com/igdb/image/upload/t_thumb/schjvx.jpg","width":560,"checksum":"d5453b15-d76f-bfc3-4c49-17a46d096c6d"}],"slug":"wizardry-v-heart-of-the-maelstrom","storyline":"Ages have past in the kingdom of Llylgamyn. The decedents of the legendary heroes have disappeared, but the Orb they brought to the city held a great deal of knowledge. The magicks hidden within the sacred Orb of Earithin were beyond what anyone had ever imagined. It revealed many secrets of life and magic. In fact, since its discovery the entire school of magic was reorganized. Spells were improved and even new spells were concocted to replace their inferior cousins. Once balance was restored to the kingdom, the Orb was placed in the hands of The Brotherhood of Llylgamyn for safe keeping. Peace once again fell over the land.\n\nSlowly things grew dark again. The strange weather returned, the people began falling ill. What was happening? Did the orb lose it's power? An emergency meeting of the High Council was called. They spent weeks deliberating behind closed doors. Together through powerful magic and the grace of both the ancient and the new gods, they found an answer...\n\nFor some unknown reason, the very fabric in which reality is comprised was unraveling, The source of all this chaos was an unnatural, magical vortex, it seems to be located in a series of maze-like caverns beneath the Brotherhood's Temple. The maze below the city is known as the Maelstrom. The Maelstrom is home to many foul beasts and also to outcasts from the land above. It seems that the vortex is located in the very heart of the Maelstrom. The rift grows daily, and if something isn't done it will engulf the city, then the kingdom and soon the entire world. Then eventually even reality as we know it will cease to exist.\n\nThe sages knew of only one answer, to seek help from the demi-god known as Gatekeeper. Once a mortal, his power grew to a point where he soon evolved to a divine status. It had become his responsibility to watch and preserve the balance of magic and the natural world. He might be the only hope, assuming he would even be willing to listen to mortals at all.\n\nThe Sages were confident their call would be answered, so grave was the danger. However, to their utter horror, they learned that the Gatekeeper himself was held prisoner in the heart of the very vortex they wished him to destroy! Terrified, the Sages turned to the Brotherhood, whose knowledge of the mystical and magical exceeded their own. Here, a tale of evil and treachery was scryed by Brother Drew, High Prophet of the Brotherhood.\n\nThey learned of a renegade Brother, a woman named The Sorn, whose wish it is to end all order in the universe. She had discovered a means to create an ever-growing rift in reality, the vortex that now threatens our land. From this will come a new universe where chaos will reign and the world will no longer exist. It was she who trapped the Gatekeeper and made him prisoner. She must be stopped, lest everyone will perish.\n\nIt's been 3 years since this discovery, and the vortex continues to grow. Time is growing short. Two of the most powerful sages in the kingdom, Fontizan and the High Sage Yeldarb have began to seek warriors brave enough to enter the caverns beneath the temple of the brotherhood, find the Gatekeeper and free him from the vortex. However, first they must defeat the evil Sorn, which is quest in itself.\n\nIn order to even have a chance, the adventurers must first seek out G'bli Gedook, the High Priest of the Brotherhood. He is the guardian of the Orb of Llylgamyn. He resides in the first layer of the caverns just under the temple. From their they must descend into the depths of the maze and battle whatever The Sorn can conjure up to stop them.\n\nWho will step up to take this challenge? Will the old heroes return or will new heroes be made?\n\nThat is unknown, but whoever takes this challenge may La-La and Kadorto be with them.","summary":"Despite the defeat of Trebor, Werdna, and L'kbreth, dark times once again threaten the kingdom of Llylgamyn. So once again a party of adventurers must venture forth to vanquish the evil.\n\nWizardry V represents a complete revision of the gaming system used in the first four installments, with larger mazes, new spells and character classes, and an expanded system for combatting and interacting with creatures. It is also the first game in the series that allows, but does not require characters imported from a previous scenario.","url":"https://www.igdb.com/games/wizardry-v-heart-of-the-maelstrom","videos":[{"id":30618,"game":10495,"name":"Gameplay video","video_id":"B_LbtBrZv0s","checksum":"971a4b41-75d9-7542-237a-eb7ed2e4770e"}]}