{"id":48965,"alternative_names":[{"id":24459,"name":"Alien vs. Predator (Japan)"}],"collection":{"id":4049,"created_at":1507926285,"games":[20087,48965,51228,82019],"name":"Aliens vs. Predator","slug":"aliens-vs-predator","updated_at":1658467593,"url":"https://www.igdb.com/collections/aliens-vs-predator","checksum":"ebd923d0-9f0a-c6cc-7c33-a7715b6a3aa3"},"cover":{"id":53047,"game":48965,"height":197,"image_id":"mcdccobg0umfr7uxu5ae","url":"//images.igdb.com/igdb/image/upload/t_thumb/mcdccobg0umfr7uxu5ae.jpg","width":200,"checksum":"e5562c98-c77c-8bde-c91c-f436767a6198"},"first_release_date":754704000,"involved_companies":[{"id":78383,"company":{"id":66,"name":"Activision"},"created_at":1557014400,"developer":false,"game":48965,"porting":false,"publisher":true,"supporting":false,"updated_at":1557014400,"checksum":"302b1611-150a-0aba-b116-7c27ce3400fb"}],"name":"Alien vs Predator: The Last of His Clan","slug":"alien-vs-predator-the-last-of-his-clan","summary":"In the year 2593, on the planet Alpha Centauri 3, Predators looking for a hunting ground plant Alien eggs. The Aliens soon hatch and wipe out the human population. However, when the Predators move in for the hunt, they find they are vastly outnumbered and suffer the same fate. Only one of them survives. He theorizes that among the hatched Aliens there was a queen that laid additional eggs, which would explain the huge number of Aliens. The last survivor sets out to destroy the queen and regain the honor of his clan. \n \nThe Predator must traverse several side-scrolling levels on his way to the queen, while destroying Aliens in all their forms - facehuggers hatched from eggs, chestburster aliens and fully grown warriors. Various weapons are available: the standard weapon are the wrist blades. Ammunition for the shoulder cannon, the cutting disks and bombs must be picked up. The bombs not only work as weapons but can also be used to destroy barriers. To avoid a fight altogether, the Predator can also use his invisibility system, which runs down the energy supply. To recharge it, energy powerups must be collected. Also hidden in the levels are keys that open up doors blocking the way into the next area. A small radar map helps in navigating the maze-like corridors and also displays approaching enemies.","total_rating":40,"total_rating_count":0,"url":"https://www.igdb.com/games/alien-vs-predator-the-last-of-his-clan"}