{"id":7754,"alternative_names":[{"id":68353,"name":"Puzzle Boy II"},{"id":68354,"name":"パズルボーイII"},{"id":73832,"name":"A-Mazing Tater"}],"cover":{"id":179130,"alpha_channel":false,"animated":false,"game":7754,"height":800,"image_id":"co3u7u","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3u7u.jpg","width":600,"checksum":"84a3a13d-8a27-5d6c-6591-56f27442a042"},"first_release_date":681091200,"genres":[{"id":9,"name":"Puzzle"},{"id":15,"name":"Strategy"}],"involved_companies":[{"id":18104,"company":{"id":818,"name":"Atlus"},"created_at":1411516800,"developer":true,"game":7754,"porting":false,"publisher":true,"supporting":false,"updated_at":1411516800,"checksum":"fe3aedcf-4e81-8cd5-42f6-ed89b97e75c4"}],"name":"Amazing Tater","slug":"amazing-tater","storyline":"Meet Spud, the A-Mazing Tater Spud must pass the King's Challenge to become a Knight. The Challenge will test his feet, his brain, and his heart. Can you help young Spud as he tries to meet the Challenge?","summary":"This puzzle-game is the successor to Kwirk. The player has to guide a small potato to the exit of each level, which is made difficult by a number of obstacles. Crates have to be pushed out of the way or into holes to make them traversable. Difficulty is increased by the fact that there are crates and holes of several different shapes and sizes and many levels contain different types of spinning doors.\n\nThe game features four different modes of play: Beginners Mode in which the basics are explained and the player receives hints on how to solve each level; Practice Mode that lets the player choose the size of the levels which are then randomly picked; Puzzle Mode in which the player has to complete 40 levels and receives a score depending on the time it took him to complete a level; and finally Action Mode, which is basically a story mode containing two stories. The game also features a password system and four different difficulty levels.","total_rating":43,"total_rating_count":0,"url":"https://www.igdb.com/games/amazing-tater"}