{"id":7760,"alternative_names":[{"id":68557,"name":"Bomber Boy"},{"id":68558,"name":"ボンバーボーイ"},{"id":70401,"name":"Dynablaster"}],"collection":{"id":549,"created_at":1381261499,"games":[2980,3446,3448,3453,3832,6925,7760,14320,18153,18786,22773,27255,27285,28393,39023,39463,42055,45295,45407,49837,56467,58932,59395,64335,64342,66221,67318,69781],"name":"Bomberman","slug":"bomberman","updated_at":1668143742,"url":"https://www.igdb.com/collections/bomberman","checksum":"df3e0cbd-a24c-1e6b-08e4-d143dfb032ae"},"cover":{"id":152815,"alpha_channel":false,"animated":false,"game":7760,"height":720,"image_id":"co39wv","url":"//images.igdb.com/igdb/image/upload/t_thumb/co39wv.jpg","width":540,"checksum":"745f23ff-47b7-1351-9490-6f3f6484b3ee"},"first_release_date":652060800,"genres":[{"id":9,"name":"Puzzle"}],"involved_companies":[{"id":18114,"company":{"id":864,"name":"Hudson Soft"},"created_at":1411516800,"developer":true,"game":7760,"porting":false,"publisher":true,"supporting":false,"updated_at":1411603200,"checksum":"2d97bd0c-6118-4d8a-a453-5d859e71ca18"}],"name":"Atomic Punk","slug":"atomic-punk","summary":"There are four modes of gameplay in Atomic Punk, including two single player modes and two multiplayer game modes.\n\nSolo:\n\n\"Game A\" (known as \"Bomber Boy\" in the Japanese version) is similar to other games in the series, with a few differences. Power-ups, known as panels, which are usually gained in each level and carried over from one to the next, can also be bought from a store by using GP, which is collected depending on how much time it takes to complete a level and how many blocks are destroyed. At the beginning of each round, the player decides which panels to use to complete the round. Another difference is that the linear gameplay of the original, with the player advancing levels after completing each one, was changed to implement a world map with nine locations.\n\nThe second game mode, \"Game B\" (known as \"Bomber Man\" in the Japanese version) is the same as that in the original Bomberman game, but the stage area is squared rather than rectangular and the screen is always centered on Bomberman rather than scrolling when he touches the border.\n\nVs.:\n\nPanel Mode, in which players begin with only one bomb to place at a time and a bomb blast length of one unit, and Bomb Up and Fire Up panels appear.\n\nPowerful Mode, in which players have four bombs to place at a time and a bomb blast length of four units, and no panels appear.","total_rating":79,"total_rating_count":3,"url":"https://www.igdb.com/games/atomic-punk"}