{"id":7826,"alternative_names":[{"id":2580,"name":"コスモタンク"}],"cover":{"id":8212,"game":7826,"height":172,"image_id":"xvpey7nplz8tx60u66el","url":"//images.igdb.com/igdb/image/upload/t_thumb/xvpey7nplz8tx60u66el.jpg","width":199,"checksum":"0893ed41-6d1f-64cb-c8f3-79289c0987be"},"first_release_date":644803200,"genres":[{"id":5,"name":"Shooter"}],"involved_companies":[{"id":18274,"company":{"id":818,"name":"Atlus"},"created_at":1412035200,"developer":false,"game":7826,"porting":false,"publisher":true,"supporting":false,"updated_at":1412035200,"checksum":"7dcaa818-55e3-f5c4-4995-8bf74ff18906"},{"id":18275,"company":{"id":3723,"name":"Asuka Technologies"},"created_at":1412035200,"developer":true,"game":7826,"porting":false,"publisher":false,"supporting":false,"updated_at":1412035200,"checksum":"3d00e4bc-4068-30a5-75dc-0abe6880412d"}],"name":"Cosmo Tank","slug":"cosmo-tank","summary":"The player controls an armoured fighting vehicle from either a first-person perspective or a third-person perspective; depending on the level design. All games begin on a planet's surface with an overhead view. When the player enters a tunnel, the view switches to first-person. After destroying the Life Core inside a tunnel, the player travels to a new planet through a vertically scrolling stage. \n \nCosmo Tank has three modes. In quest mode, the object of the game is to destroy Alien Life Cores on five planets to free them from Master Insect. Players can earn experience levels in the quest mode by defeating enemies. The maximum amount of experience points that a player can earn is 999; which allows players to reach the level cap of 6. In training mode, the player practices in a closed area and is given a ranking. In vs. mode, the Game Link Cable is used to allow two players to race to defeat the alien leader. \n \nAfter either beating the game or acquiring a game over, the player is given a rank that shows how far he made it in the game along with his target score. The lowest rank in the game is a skull and crossbones (signifying a casualty on the battlefield).","total_rating":60,"total_rating_count":0,"url":"https://www.igdb.com/games/cosmo-tank"}