{"id":136134,"alternative_names":[{"id":58953,"name":"Double Dragon 2 Gameboy"},{"id":58957,"name":"Double Dragon II GB"},{"id":58958,"name":"Double Dragon II Game Boy"},{"id":83714,"name":"The Renegades"}],"collection":{"id":694,"created_at":1390810623,"games":[4475,5968,6384,6787,6790,9929,10194,21001,23805,26621,46277,48923,71231,79335,136134,138806,175799,198727,198728,198729,198931,200154,201319,201321,201322],"name":"Double Dragon","slug":"double-dragon","updated_at":1668435679,"url":"https://www.igdb.com/collections/double-dragon","checksum":"214108bb-0408-5032-89a8-e597c135ce34"},"cover":{"id":137015,"alpha_channel":true,"animated":false,"game":136134,"height":1990,"image_id":"co2xpz","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2xpz.jpg","width":1493,"checksum":"7a0ccd9a-2967-382e-8c37-e7a04442fb06"},"first_release_date":691632000,"genres":[{"id":4,"name":"Fighting"},{"id":25,"name":"Hack and slash/Beat 'em up"},{"id":33,"name":"Arcade"}],"involved_companies":[{"id":104554,"company":{"id":287,"name":"Acclaim Entertainment"},"created_at":1595721600,"developer":false,"game":136134,"porting":false,"publisher":true,"supporting":false,"updated_at":1595721600,"checksum":"325240e1-38d0-4299-e366-ce60d8e40e8b"},{"id":164461,"company":{"id":1753,"name":"Technos Japan"},"created_at":1645619369,"developer":true,"game":136134,"porting":false,"publisher":false,"supporting":false,"updated_at":1645622806,"checksum":"b799a922-a2fc-2e78-c0e6-872d35e0e49b"}],"name":"Double Dragon II","screenshots":[{"id":431317,"alpha_channel":false,"animated":false,"game":136134,"height":144,"image_id":"sc98t1","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc98t1.jpg","width":160,"checksum":"237a85d7-4634-bb7f-2b45-fd2a12ec829c"},{"id":431318,"alpha_channel":false,"animated":false,"game":136134,"height":144,"image_id":"sc98t2","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc98t2.jpg","width":160,"checksum":"07c73f1d-c97a-d068-63ea-ae2229ef5713"},{"id":431319,"alpha_channel":false,"animated":false,"game":136134,"height":144,"image_id":"sc98t3","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc98t3.jpg","width":160,"checksum":"03bafe86-fbdc-46a1-2019-7e6e2c5b20fd"},{"id":431320,"alpha_channel":false,"animated":false,"game":136134,"height":144,"image_id":"sc98t4","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc98t4.jpg","width":160,"checksum":"ead8787d-1bff-ed57-3bad-565b5913d93f"},{"id":431321,"alpha_channel":false,"animated":false,"game":136134,"height":144,"image_id":"sc98t5","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc98t5.jpg","width":160,"checksum":"512bceeb-1e09-0822-7523-0239b2b8032d"},{"id":431322,"alpha_channel":false,"animated":false,"game":136134,"height":144,"image_id":"sc98t6","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc98t6.jpg","width":160,"checksum":"86c7cc3f-792d-3a8a-15fc-27cd995de2d3"},{"id":431323,"alpha_channel":false,"animated":false,"game":136134,"height":144,"image_id":"sc98t7","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc98t7.jpg","width":160,"checksum":"fc1d58cb-fc3b-9f0d-a6eb-5ec271879bc6"}],"slug":"double-dragon-ii","storyline":"Your name is Billy Lee. You're young, but you've already lived through enough agony to fill three lifetimes. You saw your city obliterated in a nuclear war. You saw roving gangs of thugs take over the streets. You learned the hard way that \"might makes right\" is the rule of law in a world where only the strong survive.\nThen you saw your girlfriend get gunned down by the Black Shadow Warriors. And you felt helpless as they destroyed your home: the world-famous Double Dragon dojo, home of the mighty Double Dragon Warriors.\nYou knew what had to be done.\nYou applied every scrap of martial arts knowledge and succeeded in wiping out the Black Shadow Warriors. It wasn't easy, but you did it. Finally, you were able to rest.\nBut not for long.\nAnxious to keep your skills sharp, you and your brother Jimmy joined the Scorpions.\nYou saw envy and hatred that burned in Anderson's eyes. You knew he would be trouble someday, but you never dreamed he would eliminate Wright (another Scorpion instructor), scrawl your name on the floor, and pin the blame on you! You were horrified when Gordon actually believed Anderson's twisted tale of evil and ordered you and Jimmy to pay for the crime...with your lives.\nNow war has spilled out of the dojo and into the streets. You must battle countless enemies bent on your destruction, as you prowl nightmarish urban ruins in search of one man who framed you and another who ordered your death.\nThere must be no mercy. You must clear your name. You have all the tools you need to get the job done: fists of fire, feet of fury, and the martial arts skills of the Double Dragon.\nOnce again, you know what has to be done. And only you can do it!","summary":"Double Dragon II is a side-scrolling developed and released for the Game Boy and unrelated to Double Dragon II: The Revenge.\nThe player takes control of martial artist Billy Lee, who is being hunted down by an organization called the \"Scorpions\" for murdering one of its members. The objective of the game is to fight off the members of the Scorpions and confront the true culprit, a rival martial artist named Anderson. A second player can now join in anytime via the use of a Game Link Cable, taking control of Billy's brother, Jimmy.\n\nThe combat system is simpler compared to previous Double Dragon games, including the first Game Boy game. The player can perform a series of punches or a kick on most enemies, followed by straight punch or a high kick that knocks the enemy to the floor. Pressing the A and B buttons simultaneously will cause the player to kneel. While kneeling, pressing either button will cause the player to perform an aerial uppercut. Instead of the hair grab from previous games, the player will do a collar grab (similar to Renegade), in which the player can repeatedly punch his opponent in the face or push them to the ground. While standing near a fallen enemy, a jumping knee drop can be performed. Despite the presence of armed enemies, the player cannot disarm them and pick up their weapons like in other games in the series.\n\nThe game is composed of three missions, spread across ten stages. The first two missions each consist of four stages that follows a basic structure: the player fight their way through a street until reaching the boss. This is followed by a subway platform, a fight inside a subway car, and the destination platform, where the player confronts another boss. The final mission, composed of only two stages, starts at the streets again, but this time the player must fight his way to the entrance of the Scorpions headquarters. Once inside the building, the player fight their way through a series of floors, including an area where all the previous bosses appear, until reaching the top floor where Anderson awaits. The game has three difficulty settings, but the Easy setting only allows the first mission to be played.","url":"https://www.igdb.com/games/double-dragon-ii","videos":[{"id":47791,"game":136134,"name":"Gameplay Video","video_id":"gf9EwVNk_Co","checksum":"b498c824-d6cd-044c-dba1-f8435189ba51"},{"id":47792,"game":136134,"name":"Dev Diary","video_id":"I3UpESY9X88","checksum":"e8f7aca1-81d8-2a15-c59e-92e01711c1a3"}]}