{"id":48710,"alternative_names":[{"id":24505,"name":"MVP Baseball (Japan)"}],"cover":{"id":155630,"alpha_channel":false,"animated":false,"game":48710,"height":1853,"image_id":"co3c32","url":"//images.igdb.com/igdb/image/upload/t_thumb/co3c32.jpg","width":1389,"checksum":"c0cfe599-a54a-d698-8c8e-a9bffd7d02e6"},"first_release_date":688953600,"genres":[{"id":13,"name":"Simulator"},{"id":14,"name":"Sport"}],"involved_companies":[{"id":64716,"company":{"id":2566,"name":"LJN"},"created_at":1525910400,"developer":true,"game":48710,"porting":false,"publisher":false,"supporting":false,"updated_at":1525910400,"checksum":"d77e03cc-05f1-bf62-f737-ccee48f56e99"}],"name":"Roger Clemens' MVP Baseball","slug":"roger-clemens-mvp-baseball","summary":"Join one of the most dominant pitchers in baseball history for Roger Clemens' MVP Baseball. While the game does not come with the license of Major League Baseball or the MLBPA, there are still 26 similar teams with rosters resembling those of their actual MLB counterparts, including 1991 statistics. Though player names could not be used, the fictional ones make it apparent who each player represents. For instance, you can strike out one of Oakland's Bash brothers (M. Bash or J. Bash) with Texas' R. Nolan or hit a home run with Detroit's C. Fieldman off of Chicago's M. Gaddox.\n\nThe gameplay of Roger Clemens differs from that of most NES baseball games. Though the batting scenes may resemble those typified by R.B.I. Baseball and Major League Baseball, the view switches to what one might see from the outfield stands once the ball is hit. This results in different controls from most baseball games as well.\n\nA player can challenge a friend or the computer, and one-player games may be exhibition or part of a 33-game season, complete with playoffs once the season is complete. In order to help make your season a successful one, Roger Clemens himself is there to offer advice.","total_rating":43,"total_rating_count":2,"url":"https://www.igdb.com/games/roger-clemens-mvp-baseball","videos":[{"id":19392,"game":48710,"name":"Gameplay video","video_id":"uD7Nyd2JHu0","checksum":"5ac418aa-320d-4faf-8c8a-7cf7315822b2"},{"id":19762,"game":48710,"name":"Gameplay video","video_id":"cRXi9Ngd7sc","checksum":"b1aa94af-814b-25c1-2215-9df55b97edd3"}]}