{"id":8164,"cover":{"id":134678,"alpha_channel":false,"animated":false,"game":8164,"height":800,"image_id":"co2vx2","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2vx2.jpg","width":600,"checksum":"19eb4381-0704-b3ab-d22f-cfa6a8652614"},"first_release_date":974678400,"genres":[{"id":4,"name":"Fighting"},{"id":25,"name":"Hack and slash/Beat 'em up"}],"involved_companies":[{"id":19423,"company":{"id":667,"name":"Crave Entertainment"},"created_at":1415318400,"developer":false,"game":8164,"porting":false,"publisher":true,"supporting":false,"updated_at":1415318400,"checksum":"a8d0d87e-157e-2252-7997-72a95b957178"},{"id":19425,"company":{"id":901,"name":"Crawfish Interactive"},"created_at":1415318400,"developer":true,"game":8164,"porting":false,"publisher":false,"supporting":false,"updated_at":1415318400,"checksum":"fdc0287d-6383-b532-c793-166c78890191"}],"name":"Godzilla The Series: Monster Wars","screenshots":[{"id":391410,"alpha_channel":false,"animated":false,"game":8164,"height":213,"image_id":"sc8e0i","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0i.jpg","width":237,"checksum":"11084037-c465-eac2-2f6f-31e2c5fe3e5b"},{"id":391411,"alpha_channel":false,"animated":false,"game":8164,"height":586,"image_id":"sc8e0j","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0j.jpg","width":650,"checksum":"959440ef-d91f-e5e7-ecfd-eaf2ef2fe257"},{"id":391412,"alpha_channel":true,"animated":false,"game":8164,"height":480,"image_id":"sc8e0k","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0k.jpg","width":480,"checksum":"351be551-5f0a-103a-6b52-4787eef11f43"},{"id":391413,"alpha_channel":false,"animated":false,"game":8164,"height":586,"image_id":"sc8e0l","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0l.jpg","width":650,"checksum":"9f92de3a-f24c-0ad0-4c57-eb6846402118"},{"id":391414,"alpha_channel":false,"animated":false,"game":8164,"height":586,"image_id":"sc8e0m","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0m.jpg","width":650,"checksum":"3ff4d148-87be-9ad3-5faf-52f34fafd784"},{"id":391415,"alpha_channel":false,"animated":false,"game":8164,"height":586,"image_id":"sc8e0n","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0n.jpg","width":650,"checksum":"2e626c1b-ac51-663c-42f6-0e220007f9dc"},{"id":391416,"alpha_channel":false,"animated":false,"game":8164,"height":586,"image_id":"sc8e0o","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0o.jpg","width":650,"checksum":"685879f1-8e18-5367-2bd1-fd9c4fe060bb"}],"slug":"godzilla-the-series-monster-wars","storyline":"After receiving word of a mutant attack in Nigeria, Randy Hernandez and Monique Dupre went to investigate alongside Godzilla. After getting past the Nigerian military, Godzilla defeated El Gusano Gigante, leading to Dr. Elsie Chapman discovering that it had been feeding on plants used in the manufacture of chemical weapons. Back in New York, Audrey Timmonds reported on a garbage-eating microbe that had gone on a rampage. H.E.A.T. boarded the Heat-Seeker while Godzilla made his way through the city itself. Once again, the military tried to stop him, but were unable to do so. When he reached the Nanotech Creature, he was able to defeat it, and it dispersed from its conglomerate form, leading Timmonds to commend H.E.A.T.'s efforts in defeating the P.E.M.C. Some time after this, Dr. Chapman picked up strange waves coming from nearby New Jersey. She showed it to her colleague Dr. Mendel Craven, who recognized them as faster-than-light tachyon pulses. The team went to New Jersey to investigate, leaving Godzilla to navigate there underwater, battling through scores of submarines and giant cephalopods. He soon came face to face with a Cryptocledius headed the other direction that attacked him with sonic vocalizations. Not understanding what the beast had been doing there, Craven began looking into them, and determined that they were some sort of distress signal emanating from the bottom of the Pacific Ocean, and that it had been signaling for 55 million years. Godzilla then trekked through an unnamed city facing the usual opposing forces until he was faced with a Giant Bat that took a toll on him, but he was able to force into retreat. H.E.A.T. then headed for Site Omega, a military outpost in the Pacific. Godzilla then left the city, battling huge rats in addition to the miliary forces. He then walked all the way to Site Omega on the ocean floor, where he encountered more giant cephalopods and undersea attackers. He eventually arrived on the island and fought through yet another military onslaught before coming face to face with Cyber Godzilla, the resurrected cyborg created from the corpse of Godzilla's mother.[1]. She attacked her son with missiles, but was ultimately lain to waste. After Cyber Godzilla's defeat, the aliens that had apparently been around were seen retreating. Anthony Hicks approached Nick and offered him the position of lead researcher on the incapacitated mutations there on the island, but Nick declined in order to continue protecting the mutations that had yet to be discovered.","summary":"Aliens are creating mutants on Earth, and it is up to Godzilla to save the planet from the giant monsters in GODZILLA THE SERIES: MONSTER WARS. You take control of the giant lizard in 10 levels of action that take place in deserts, cities, and underwater. Free-scrolling technology gives you total control of Godzilla, and new cross-hairs improve the accuracy of Godzilla’s attacks that include fireball, tail whip, bite, claw, stomp, and flame breath. As an added bonus, all of the attacks can be linked together for unlimited combinations. And you are going to need those combinations to destroy the 16 types of enemies that Godzilla will face. Try to save the planet from giant monsters and aliens in GODZILLA THE SERIES: Monster Wars.","url":"https://www.igdb.com/games/godzilla-the-series-monster-wars","videos":[{"id":38214,"game":8164,"name":"Gameplay Video","video_id":"RXLC3syFBFw","checksum":"d1111add-4198-19e4-3e22-14b238bd6bfd"}]}