{"id":75893,"cover":{"id":134677,"alpha_channel":false,"animated":false,"game":75893,"height":800,"image_id":"co2vx1","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2vx1.jpg","width":600,"checksum":"36fc6549-f1ac-78e9-a1d7-c9402d603150"},"first_release_date":944006400,"genres":[{"id":25,"name":"Hack and slash/Beat 'em up"}],"involved_companies":[{"id":58142,"company":{"id":901,"name":"Crawfish Interactive"},"created_at":1510704000,"developer":true,"game":75893,"porting":false,"publisher":false,"supporting":false,"updated_at":1510704000,"checksum":"00ea5cd5-2ec5-4632-6d8a-1309afbfec89"},{"id":58143,"company":{"id":667,"name":"Crave Entertainment"},"created_at":1510704000,"developer":false,"game":75893,"porting":false,"publisher":true,"supporting":false,"updated_at":1510704000,"checksum":"d9edfbfc-566d-e98a-f7c5-88f0eb124554"}],"name":"Godzilla: The Series","screenshots":[{"id":391405,"alpha_channel":false,"animated":false,"game":75893,"height":224,"image_id":"sc8e0d","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0d.jpg","width":256,"checksum":"8808dd7d-2d81-b1ed-ab7c-0c9881f80a6d"},{"id":391406,"alpha_channel":false,"animated":false,"game":75893,"height":300,"image_id":"sc8e0e","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0e.jpg","width":338,"checksum":"b8259b73-a3c8-88c3-8ee0-35b7ed8ab891"},{"id":391407,"alpha_channel":false,"animated":false,"game":75893,"height":720,"image_id":"sc8e0f","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0f.jpg","width":800,"checksum":"575d6689-e031-36cc-19c2-da0cafd816a4"},{"id":391408,"alpha_channel":false,"animated":false,"game":75893,"height":720,"image_id":"sc8e0g","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0g.jpg","width":800,"checksum":"87b0ce9f-2a01-520c-c672-8bfbd103db54"},{"id":391409,"alpha_channel":false,"animated":false,"game":75893,"height":586,"image_id":"sc8e0h","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc8e0h.jpg","width":650,"checksum":"da207601-b6a4-6f3d-b54d-867e51b74b4a"}],"slug":"godzilla-the-series","storyline":"After a giant electrical powered monster, named The Crackler began attacking New York City, Godzilla went to fight it while Randy Hernandez looked into a way to stop it. Godzilla fought it back, and was able to defeat it when it was weakened by its unwitting creator finally addressing his emotions. Afterward, Niko Tatopoulos called Major Anthony Hicks to tell him to stop attacking Godzilla, who had just saved the city, but Hicks revealed that no-one had orders to attack Godzilla. He was chased into the water by a helicopter, and went ashore on an island. On the island, Godzilla was attacked by more military vehicles and a population of Giant Mutant Bees, and eventually fought their Queen. After defeating the Mutant Bees, H.E.A.T. noticed that military assets were still attacking Godzilla, and they decided to continue facing them to get to their source. As Godzilla continued, he was met with more military and Cyber Flies before facing an enormous tank. After that, H.E.A.T. began to investigate tar on a beach that they believed to be linked to the disappearance of several swimmers. They were then attacked by a Mutant Giant Squid, which Godzilla defeated before more attacked, along with the military. Eventually they came upon some squids that were not charred from Godzilla's Fire Balls, but encased in the digestive tar they had found earlier. Before they could ponder for too long as to what was really creating the tar, the Crustaceous Rex surfaced and attacked Godzilla. While it was capable of using its tar to immobilize Godzilla, he was able to defeat it. After noticing that Godzilla was acting very hyperactive, H.E.A.T. was contacted by Cameron Winter, who accused them of trespassing before admitting that he was behind the odd military attacks on Godzilla in order to test his Solstice Technologies weapons, and that he was using a machine to control Godzilla. N.I.G.E.L. was able to dismantle it, and Godzilla advanced on the island and defeated updated versions of the Solstice Helicopter and Solstice Tank. Godzilla then reached the Solstice Industries facility on the island and destroyed it. With the mystery of who was attacking Godzilla behind them, H.E.A.T. and Godzilla headed back to New York City.","summary":"Godzilla: The Series is a shooter game developed by Crawfish Interactive and published by Crave for the Gameboy Color based on the Godzilla series. It is the prequel to Godzilla The Series: Monster Wars.","url":"https://www.igdb.com/games/godzilla-the-series","videos":[{"id":38213,"game":75893,"name":"Gameplay Video","video_id":"KQJJNhuTccE","checksum":"269a24a9-ae29-fe8a-dd0c-b4154f10346f"}]}