{"id":1464,"cover":{"id":226160,"alpha_channel":false,"animated":false,"game":1464,"height":800,"image_id":"co4ui8","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4ui8.jpg","width":600,"checksum":"a3d8192f-64a9-ba42-3e47-cddc6615a7ee"},"first_release_date":965088000,"genres":[{"id":5,"name":"Shooter"}],"involved_companies":[{"id":3107,"company":{"id":771,"name":"Rare"},"created_at":1350000000,"developer":true,"game":1464,"porting":false,"publisher":true,"supporting":false,"updated_at":1350000000,"checksum":"447c5ec8-ba5d-f86a-1ce9-2d39e75163f5"},{"id":3507,"company":{"id":70,"name":"Nintendo"},"created_at":1357084800,"developer":false,"game":1464,"porting":false,"publisher":true,"supporting":false,"updated_at":1357084800,"checksum":"9b899fb4-f866-0502-f2d4-fdc86d0e50d3"}],"name":"Perfect Dark","screenshots":[{"id":1494,"game":1464,"height":432,"image_id":"e0tzmzsi2ccoempcxl6q","url":"//images.igdb.com/igdb/image/upload/t_thumb/e0tzmzsi2ccoempcxl6q.jpg","width":640,"checksum":"d2cea4e4-cbda-0f72-352d-8d63eeda2cce"},{"id":1495,"game":1464,"height":430,"image_id":"wjnm44taqvg7gf9auksy","url":"//images.igdb.com/igdb/image/upload/t_thumb/wjnm44taqvg7gf9auksy.jpg","width":640,"checksum":"355d97f2-de1c-79a7-c244-d81d2fd28440"},{"id":1496,"game":1464,"height":434,"image_id":"l3lvqahxa7wlljg4kbnz","url":"//images.igdb.com/igdb/image/upload/t_thumb/l3lvqahxa7wlljg4kbnz.jpg","width":640,"checksum":"af78c7b0-5498-8d58-830b-4450bf10797c"},{"id":1497,"game":1464,"height":427,"image_id":"skvclfwhikaftyqiuxj6","url":"//images.igdb.com/igdb/image/upload/t_thumb/skvclfwhikaftyqiuxj6.jpg","width":640,"checksum":"0a089036-9dca-146a-37d4-0c0f98a4659a"},{"id":1498,"game":1464,"height":430,"image_id":"irzzuypw71b0gwaszh0u","url":"//images.igdb.com/igdb/image/upload/t_thumb/irzzuypw71b0gwaszh0u.jpg","width":640,"checksum":"c00b854f-a4b6-95fd-6e1e-5f06eb92f285"}],"slug":"perfect-dark--2","storyline":"Set in early 2022, Perfect Dark follows agent Joanna Dark during the final stages of her training at the Carrington Institute, a research centre founded by Daniel Carrington. After completing her training, Joanna is sent on a mission to destroy a cyborg manufacturing facility in the South American jungle. The facility is run by Mink Hunter and produces high-tech weaponry for terrorist operations. Joanna completes her mission successfully, killing Hunter and destroying the entire facility. She then reports that, during her landing in the jungle, she witnessed an aircraft being shot down and made a note of the coordinates. Carrington learns that there is a UFO in the area and that dataDyne, the Carrington Institute's rival corporation, is getting away with the alien wreckage.\n\nJoanna is sent to investigate the crash site, but is ultimately captured and taken to the Pelagic I research vessel, along with the alien wreckage. An alien eventually rescues Joanna, telling her that she must gather as much information on the alien wreckage as possible, and then sink the Pelagic I. After succeeding, Joanna tells Carrington that the wreckage belonged to an alien race called the Skedar. The situation changes abruptly when the Carrington Institute is stormed by a dataDyne strike team who hopes to destroy any evidence against them. Joanna defends the Carrington Institute and her work earns her enough recognition to take part in her next mission. The game ends with the Carrington Institute carrying out further investigations on dataDyne.","summary":"Perfect Dark is an action video game developed by Rare and released for the Game Boy Color handheld console in 2000. As a prequel to its Nintendo 64 counterpart, the game follows agent Joanna Dark as she completes her training at the Carrington Institute research centre and uncovers information against rival corporation dataDyne. The gameplay revolves around shooting opponents and completing objectives such as rescuing hostages or recovering items. The game also includes a multiplayer mode where two players may compete against each other in several deathmatch modes.","total_rating":73,"total_rating_count":2,"url":"https://www.igdb.com/games/perfect-dark--2"}