{"id":3579,"alternative_names":[{"id":38945,"name":"Pocket Puyo Puyo~n"},{"id":38948,"name":"ぷよぷよ〜ん"},{"id":60945,"name":"Puyo Puyo 4"},{"id":60946,"name":"Puyo Puyo~n Party"}],"cover":{"id":139425,"alpha_channel":false,"animated":false,"game":3579,"height":800,"image_id":"co2zkx","url":"//images.igdb.com/igdb/image/upload/t_thumb/co2zkx.jpg","width":600,"checksum":"891960a7-7272-4cc3-e76a-ef644d86930f"},"first_release_date":920505600,"genres":[{"id":9,"name":"Puzzle"}],"involved_companies":[{"id":9255,"company":{"id":1831,"name":"Compile"},"created_at":1389052800,"developer":true,"game":3579,"porting":false,"publisher":false,"supporting":false,"updated_at":1389139200,"checksum":"b466effa-e9c0-acd0-7296-e952221821e9"},{"id":9256,"company":{"id":112,"name":"Sega"},"created_at":1389052800,"developer":false,"game":3579,"porting":false,"publisher":true,"supporting":false,"updated_at":1389139200,"checksum":"d6cee145-97e2-095d-787d-5d56486c4f52"}],"name":"Puyo Puyo~n","screenshots":[{"id":337641,"alpha_channel":false,"animated":false,"game":3579,"height":480,"image_id":"sc78ix","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc78ix.jpg","width":640,"checksum":"638ad014-05cd-f91e-e631-42d332099091"},{"id":337642,"alpha_channel":false,"animated":false,"game":3579,"height":480,"image_id":"sc78iy","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc78iy.jpg","width":640,"checksum":"f9a5b06d-61ed-0aef-6fd0-bc364697b1a1"},{"id":337643,"alpha_channel":false,"animated":false,"game":3579,"height":480,"image_id":"sc78iz","url":"//images.igdb.com/igdb/image/upload/t_thumb/sc78iz.jpg","width":640,"checksum":"bbbfad61-1ab6-aa70-03b8-ff551773b298"}],"slug":"puyo-puyo-n","summary":"This game was released only in Japan. It is the fourth game in the Puyo Puyo series and the last set during the Madou-era in the main series.\nContinuing the trend of naming the games after puns, the name comes from a pun on \"yon\", the Japanese word for the number 4, but this time this is the only reference to the pun.\n\nThe gameplay in is similar to that of Puyo Puyo 2, but adds super attacks. Clearing chains now builds up a \"charge meter\" which allows players to use them. The only other addition was a new game mode which could be played with a number of different field sizes, smaller or bigger than the standard 6x12, however, it removes several game modes that were present in Puyo Puyo Sun, i.e. the tournament, task and chain training modes. The art is also vastly different to the previous game in the series and, of course, the Fever series; this style was only otherwise used for Minna de Puyo Puyo.\n\nSTORY:\nSatan has released an odd demon called Pierott. Pierott invites Arle and Carbuncle over to the “Puyo Puyo Circus”. All seemed to be just fine, Arle and Carbuncle went into a tent to watch a magic show, but Satan had Carbuncle volunteer for a magic trick he was doing. A magic trick? Or a trap? He puts Carbuncle on the stand, and casts a spell, which makes Carbuncle, disappear! Arle wasn't worried, she didn't even know what was going on, but later on, she couldn't find Carbuncle anywhere! She then has to start battling monsters and oddball characters in a match of Puyo Puyo to try to reach Satan, and get Carbuncle back!\n\nThis version of the game have different music and lacks the voiced cutscenes due to cartridge's memory limitations, but can be played in 4-player mode like the Dreamcast version and included a Transfer Pack mode where one could unlock more artwork by plugging in Pocket Puyo Puyo Sun.","url":"https://www.igdb.com/games/puyo-puyo-n"}