{"id":8253,"alternative_names":[{"id":63992,"name":"Adventure 1-2-3"}],"collection":{"id":2111,"created_at":1459275578,"games":[2298,2299,8253,18512,18513,18517,18518,18519,18520,18521,18522,18523,18524,18525,18526,18527,55925,61384,68961,69247,69658,70169,70319,70803,71451,72537,80650,80766],"name":"Scott Adams Classic Adventures","slug":"scott-adams-classic-adventures","updated_at":1667756931,"url":"https://www.igdb.com/collections/scott-adams-classic-adventures","checksum":"8f0b4c39-dff5-52f6-d838-d42c71b36cf6"},"cover":{"id":141798,"alpha_channel":true,"animated":false,"game":8253,"height":2000,"image_id":"co31eu","url":"//images.igdb.com/igdb/image/upload/t_thumb/co31eu.jpg","width":1500,"checksum":"85bb55f5-1438-3282-b0f9-89f53be7181f"},"first_release_date":312854400,"genres":[{"id":31,"name":"Adventure"}],"involved_companies":[{"id":33814,"company":{"id":2519,"name":"Sears"},"created_at":1457913600,"developer":false,"game":8253,"porting":false,"publisher":true,"supporting":false,"updated_at":1457913600,"checksum":"961637ad-ab83-9e05-bb3d-5bbafa8f785e"},{"id":136629,"company":{"id":82,"name":"Atari"},"created_at":1622268179,"developer":true,"game":8253,"porting":false,"publisher":false,"supporting":false,"updated_at":1622318151,"checksum":"b64194f2-a653-d48e-0bb2-d892ffb58209"}],"name":"Adventure","screenshots":[{"id":28526,"game":8253,"height":500,"image_id":"ilwcuu9hvzpjzvynwztq","url":"//images.igdb.com/igdb/image/upload/t_thumb/ilwcuu9hvzpjzvynwztq.jpg","width":825,"checksum":"8f836e70-cd75-2fce-d209-ca38f5ff79a9"},{"id":473068,"alpha_channel":false,"animated":false,"game":8253,"height":295,"image_id":"sca50s","url":"//images.igdb.com/igdb/image/upload/t_thumb/sca50s.jpg","width":418,"checksum":"b7258ce1-c405-7531-8371-ce29c899ab5f"}],"slug":"adventure","storyline":"According to the game's instructions, an evil magician has stolen the Enchanted Chalice and hidden it somewhere in the kingdom. The player's goal is to find the Chalice and return it to the Golden Castle. The player character, represented by a square avatar, explores a multi-screen landscape containing castles, mazes, and various rooms, with thirty rooms in all. Hidden throughout the world are a sword, keys that unlock each of the three castles (golden, black, and white), a magic bridge that allows the avatar to travel through barriers, and a magnet that attracts the other items toward it.\n\nRoaming the world are three dragons. Yorgle, the yellow dragon, is afraid of the gold key and will run from it. He roams the game freely, but can guard the Chalice or help the other dragons guard items. Grundle, the green dragon, guards the magnet, the bridge, the black key, and the chalice. Rhindle, the red dragon, is the fastest and most aggressive. He guards the white key and chalice.\n\nThe dragons have four possible states, all indicated with different sprites: chasing the player, biting, having swallowed the player's avatar, and death. When initially encountered, a dragon is in the chase state. When a dragon collides with the avatar, it will enter the bite state, freezing in place. After a fraction of the second, the dragon completes the bite. If the dragon has a second collision with the avatar at that moment, it swallows the avatar, who becomes trapped in the dragon's belly.","summary":"Adventure is a video game for the Atari 2600 video game console, released at Christmas time in 1979. In the game, the player controls a square avatar whose quest is to hunt an open world environment for a magical chalice, returning it to the golden castle. The game world is populated by roaming enemies: dragons, which can eat the avatar; and a bat, which randomly steals and hides items around the game world.\n\nAdventure was designed and programmed by Atari employee Warren Robinett, and published by Atari, Inc. At the time, Atari programmers were generally given full control on the creative direction and development cycle for their games, and this required them to plan for their next game as they neared completion of their current one to stay productive.\n\nRobinett submitted the source code for Adventure to Atari management in June 1979 and soon left Atari. Atari released the game in early 1980.","total_rating":70.2619537843875,"total_rating_count":20,"url":"https://www.igdb.com/games/adventure","videos":[{"id":23821,"game":8253,"name":"Gameplay video","video_id":"I6-zN_eaRd8","checksum":"a6f5180d-f683-43fd-c277-8d64248a89f8"}]}