{"id":11139,"cover":{"id":10448,"game":11139,"height":324,"image_id":"cknbbg7xu1okwyt1uvnv","url":"//images.igdb.com/igdb/image/upload/t_thumb/cknbbg7xu1okwyt1uvnv.jpg","width":250,"checksum":"83306001-b6bb-3030-2d70-a50b2aa62a65"},"first_release_date":410140800,"genres":[{"id":33,"name":"Arcade"}],"involved_companies":[{"id":24303,"company":{"id":4509,"name":"Mystique"},"created_at":1434326400,"developer":true,"game":11139,"porting":false,"publisher":true,"supporting":false,"updated_at":1434326400,"checksum":"0138e58f-3357-63d2-2a67-9222f2b19ffc"}],"name":"Beat 'Em & Eat 'Em","screenshots":[{"id":10412,"game":11139,"height":266,"image_id":"ahtymx5qasgxrdqajn0n","url":"//images.igdb.com/igdb/image/upload/t_thumb/ahtymx5qasgxrdqajn0n.jpg","width":320,"checksum":"b93a4c7f-80ab-6485-806a-d1e7a0101394"}],"slug":"beat-em-and-eat-em","summary":"Beat 'Em and Eat 'Em is a pornographic video game for the Atari 2600 by Mystique in 1982. Distribution was handled by American Multiple Industries until distribution changed to Game Source. Players control two nude women; the goal is to catch sperm falling from a masturbating man on a rooftop without missing. Its gameplay has been compared to the Atari game Kaboom!. There is also gender-reversed version of the game titled Philly Flasher that features identical gameplay. Beat 'Em & Eat 'Em has received negative reception since its release and is an oft-cited example of pornographic Atari 2600 games.\nPlayers control two nude women on the street who must catch semen in their mouths that comes from a masturbating man on a rooftop without missing. This can be accomplished merely by touching the women's bodies on the sperm before it hits the ground. A more difficult setting requires players catch the sperm before it goes past the women's shoulders. If any sperm hits the ground, the first turn is over. Players are allowed to miss four times before the game is over. They can gain a turn every 69 points scored (up to two extra turns). Players move both women using the controller's paddle and the game allows each player to control one woman. The game plays similarly to the Atari game Kaboom!.","url":"https://www.igdb.com/games/beat-em-and-eat-em"}