{"id":18103,"cover":{"id":14316,"game":18103,"height":819,"image_id":"mhjrkv6pyo5hb2rjjzuu","url":"//images.igdb.com/igdb/image/upload/t_thumb/mhjrkv6pyo5hb2rjjzuu.jpg","width":600,"checksum":"3cee2c5b-97da-cdfd-2dd9-54e6246906f8"},"first_release_date":410140800,"genres":[{"id":10,"name":"Racing"},{"id":33,"name":"Arcade"}],"involved_companies":[{"id":33239,"company":{"id":66,"name":"Activision"},"created_at":1456617600,"developer":true,"game":18103,"porting":false,"publisher":true,"supporting":false,"updated_at":1456704000,"checksum":"d92b4140-97d7-4934-d94d-bc8137fe66e9"}],"name":"Grand Prix","slug":"grand-prix","summary":"The player drives a Formula One car in a time trial on one of four race tracks, each of which has a different difficulty level. Difficulty is gauged by the length of the course, the number of cars and oil slicks on the track, and the number of bridges to cross. The player views the race from a top-down perspective, and the screen scrolls from right to left. The player's car maneuvers only on a vertical axis, and loses a little speed when it does so. The joystick's button is the throttle: Depressing it accelerates, and releasing it decelerates. Pressing the joystick leftward applies the brake. The transmission audibly shifts as the player's car accelerates and decelerates. Grand Prix is a time trial, and the competing cars are obstacles rather than competition for the finish line. The player's car can easily outpace the other cars, but if it collides with one, its speed drops lower than that of the impacted car. Driving over an oil slick causes the player's car to skid slightly sideways, but does not slow it down. Once every scale mile, the player crosses a narrow bridge over blue water. Colliding with any wall of the bridge stops the car, and the player must slowly gain speed to continue.","total_rating":61.93004035641685,"total_rating_count":6,"url":"https://www.igdb.com/games/grand-prix","videos":[{"id":15258,"game":18103,"name":"VR","video_id":"JRTmFS10pWo","checksum":"9da49a5d-a21c-3d9b-7a49-9ddfec473ced"}]}