{"id":18286,"cover":{"id":14552,"game":18286,"height":300,"image_id":"qkcpsch2xwnnkdpqqkv8","url":"//images.igdb.com/igdb/image/upload/t_thumb/qkcpsch2xwnnkdpqqkv8.jpg","width":217,"checksum":"d7cafdb5-3efa-99c2-64ce-e5739e94c1bd"},"first_release_date":1278547200,"genres":[{"id":5,"name":"Shooter"},{"id":31,"name":"Adventure"}],"involved_companies":[{"id":33670,"company":{"id":9379,"name":"Ed Fries"},"created_at":1457481600,"developer":true,"game":18286,"porting":false,"publisher":false,"supporting":false,"updated_at":1457568000,"checksum":"b18a7496-3ea1-84a9-f9a7-50797054156d"},{"id":33671,"company":{"id":9380,"name":"Atari Age"},"created_at":1457481600,"developer":false,"game":18286,"porting":false,"publisher":true,"supporting":false,"updated_at":1457568000,"checksum":"ae63bc3b-dbae-e46a-b563-1b09e34f97c7"}],"name":"Halo 2600","screenshots":[{"id":21566,"game":18286,"height":523,"image_id":"ytsp6clfjfffwnu66dpm","url":"//images.igdb.com/igdb/image/upload/t_thumb/ytsp6clfjfffwnu66dpm.jpg","width":800,"checksum":"438314d9-8433-8ee8-4241-caa7dc323e41"},{"id":21567,"game":18286,"height":700,"image_id":"ct6r8lbdqwsdr3yneekf","url":"//images.igdb.com/igdb/image/upload/t_thumb/ct6r8lbdqwsdr3yneekf.jpg","width":1240,"checksum":"e764da19-5c07-f41d-0761-8227cc224f4e"},{"id":21568,"game":18286,"height":420,"image_id":"zulc7dhj1lspquipqjbm","url":"//images.igdb.com/igdb/image/upload/t_thumb/zulc7dhj1lspquipqjbm.jpg","width":640,"checksum":"ad8e37a3-2d16-e8c0-897a-e0f747fccd05"}],"slug":"halo-2600","storyline":"The player uses the joystick to control the character of Master Chief as he makes his way through 64 screens, divided into four zones: outdoors, Covenant base, ice world, and a final boss area.[1][2] Weapons and power-ups are available to combat the many enemies that appear. The player and enemies can each be killed by one hit unless a shield is collected.[1][3] There are two power-ups in the game, both guarded by what appears to be nine enemies but is actually three. The first is a gun with a faster rate of fire. The second is a pair of boots that allows the player to move faster. In addition to these, by killing certain enemies, the player can obtain an energy shield that will take one shot to prevent the loss of one of the player's three lives. After successfully completing the game once, the game returns to the menu screen, but with a red sky. If the player chooses to play again from that screen the game will run in \"Legendary\" mode and the player will move and shoot at a slower rate.","summary":"Halo 2600 is an action-adventure video game developed for the Atari 2600 video game console, inspired by the Halo series of video games. Halo 2600 was written by Ed Fries, former vice president of game publishing at Microsoft, who was involved in Microsoft's acquisition of Halo developers Bungie Studios. Fries decided to create a version of Halo for the Atari 2600 after being inspired by a book called Racing the Beam: The Atari Video Computer System by Ian Bogost and Nick Montfort. The Atari 2600 had such limited RAM, only 128 bytes, that drawing Master Chief was difficult, and creating a game with other characters was even more so. Fries later stated that making the game taught him that constraint is sometimes a fuel for creativity.","url":"https://www.igdb.com/games/halo-2600"}