{"id":197988,"cover":{"id":218121,"alpha_channel":false,"animated":false,"game":197988,"height":1098,"image_id":"co4oax","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4oax.jpg","width":824,"checksum":"f29cea8a-a103-7766-abf4-28b394131ec5"},"first_release_date":790387200,"genres":[{"id":9,"name":"Puzzle"}],"involved_companies":[{"id":168309,"company":{"id":2821,"name":"Eighting"},"created_at":1650319291,"developer":true,"game":197988,"porting":false,"publisher":false,"supporting":false,"updated_at":1650328108,"checksum":"70d7631e-5130-cd03-082d-6f82cee5ffed"},{"id":168310,"company":{"id":864,"name":"Hudson Soft"},"created_at":1650319292,"developer":false,"game":197988,"porting":false,"publisher":true,"supporting":false,"updated_at":1650328108,"checksum":"21358aec-f425-c996-ad01-adee70c15322"}],"name":"Bomberman: Panic Bomber","slug":"bomberman-panic-bomber--2","summary":"The Neo Geo port of Panic Bomber. It is a \"falling blocks\" puzzle game based on the Bomberman franchise. The goal of the game is essentially to cause your opponent to lose by causing their gameplay field to fill to the top with objects. You do this by causing chains of bombs to explode, sending useless rubble over to your opponent's field, which they must then remove themselves. Bombs are earned by causing chains of three identical blocks to disappear. Bombs can only be blown up with an explosion from a lit bomb, which falls from the top of the screen every so often. If the player causes enough damage, they can eventually earn a giant bomb, which will remove a large amount of debris from the playing field, and cause their opponent a good deal of trouble.\n\nThe game's regular story mode revolves around Bomberman's hunt for the Golden Bomber statue. During his trek, he fights against several different odd characters, like Drifty the balloon, or Cecil the tiger. However, all that can really be earned from playing through this mode is a harder difficulty level, earned by finishing the entire story at the \"hard\" difficulty level.","url":"https://www.igdb.com/games/bomberman-panic-bomber--2"}