{"id":175905,"alternative_names":[{"id":111191,"name":"Ninja 外伝"}],"cover":{"id":224181,"alpha_channel":false,"animated":false,"game":175905,"height":800,"image_id":"co4sz9","url":"//images.igdb.com/igdb/image/upload/t_thumb/co4sz9.jpg","width":600,"checksum":"1a8ba584-9215-88df-8a59-88dae77b2dc5"},"first_release_date":694137600,"genres":[{"id":4,"name":"Fighting"},{"id":25,"name":"Hack and slash/Beat 'em up"}],"involved_companies":[{"id":152565,"company":{"id":14776,"name":"Tecmo"},"created_at":1633792924,"developer":true,"game":175905,"porting":false,"publisher":false,"supporting":false,"updated_at":1633793171,"checksum":"f313212c-7aff-bb48-3cdd-8a781781930e"},{"id":152566,"company":{"id":2406,"name":"Atari, Inc."},"created_at":1633792924,"developer":false,"game":175905,"porting":false,"publisher":true,"supporting":false,"updated_at":1633793171,"checksum":"674910e9-ad32-2149-8a6c-41cfb7dec7b5"}],"name":"Ninja Gaiden","slug":"ninja-gaiden--4","summary":"In comparison to the better known console version, this game is a traditional beat'em up game similar to Double Dragon in which the player walks from left to right while battling numerous enemies. Only if all foes are dispatched of, the player can advance in the level. It's also possible to perform special attacks and use weapons. The latter are either collectable power-ups or environmental objects like phone boots.\n\nThe player's ninja can attack his enemies using his bare hands and feet or using a sword (for a limited time). He can also perform moves such as a flying neck throw, a back flip and hang kicks, performed while hanging in scenario objects. Throwing enemies against objects such as phone cabins, oil drums or dumpsters will destroy them, revealing power ups such as health items and swords. At some points, Ryu will have to perform acrobatic moves to carry on. He has a life bar starting with five units.\n\nThe game takes place in United States' locations such as Las Vegas, North Carolina, Los Angeles, the Grand Canyon and Brooklyn. The enemies in those stages are mostly of the same five kinds, including Jason Vorhees' look-alikes and other masked men. There is a boss fight at the end of each stage.\n\nA two-player co-operative game is also featured. Whenever the player dies, a continue screen will appear showing the player's ninja chained to a table while a circular saw descends upon him.","url":"https://www.igdb.com/games/ninja-gaiden--4"}